{"text_length": 8260, "summary": "If people on metformin have less knee pain and are able to do more physical activity, then knee replacements can wait.”\n\nProfessor Cicuttini and her colleagues are now working with consumers, GPs, orthopaedic surgeons and other healthcare professionals to introduce metformin into the knee OA management pathway in order to improve patient outcomes and potentially better target knee replacements. “It is a different way to treat knee OA pain. It could be provided to patients in addition to other treatments they use and has the potential to delay people having knee replacements before they are absolutely needed. The study, published in JAMA, investigated the effects of metformin, a drug commonly prescribed for type 2 diabetes, on knee pain. Osteoarthritis Cartilage.2022 11];30(11):1434-1442\n\nNever miss a breakthrough: Join the SciTechDaily newsletter. PMID: 31551381; PMCID: PMC6773287 Usiskin I. Surgical Treatments for Osteoarthritis. This trend has been partly explained by the lack of effective treatments for knee OA and improved longevity of knee replacements. Wallis JA, Taylor NF, Bunzli S, Shields N. Experience of living with knee osteoarthritis: a systematic review of qualitative studies. Beswick AD, Wylde V, Gooberman-Hill R, Blom A, Dieppe P. What proportion of patients report long-term pain after total hip or knee replacement for osteoarthritis? Implications for Surgery and Healthcare Costs\n\nProfessor Cicuttini said effective treatments that improved knee pain in osteoarthritis were limited. However, a systematic review and meta-analysis provided consistent evidence that mild radiological OA was a major contributor to the 20-30% patient dissatisfaction with knee replacements, including persisting pain[5]. “To go through the effort and cost of a big operation like a knee replacement, only to be unhappy with the results because of ongoing pain and symptoms, is definitely low-quality care.", "timestamp": "2025-05-16 14:29:21"}