{"text_length": 9173, "summary": "\"For people over the age of perhaps 50 and 60, Depardieu evokes memories of being a great actor of a certain era, but I don't know how many younger people are interested in that story anymore,\" she says. \"And I think the fall of Depardieu really does represent this seismic change in France, that's perhaps come later than in Hollywood and the rest of the world, but it is here now. She says there was condemnation when Depardieu's lawyer Jérémie Assous accused the actor's two female victims in the court case, a 54-year-old set dresser and a 34-year-old assistant director, of \"hysteria\", being \"liars\" and working for the cause of \"rabid feminism\". The world's most famous film festival, in Cannes, began on the same day that Gérard Depardieu, one of the biggest film stars France has ever produced, was found guilty of sexually assaulting two women on the film set of a 2021 film, The Green Shutters, who described him groping them while using obscene language. \"He is no longer sacred,\" she told journalists, a reference to the scale of Depardieu's power in the French film industry. Eve Jackson, the Culture Editor at French news channel France 24, tells the BBC that Depardieu \"has been revered as one of the sons of the Cannes Film Festival. Change has perhaps come later than in Hollywood and the rest of the world, but it is here now – Eve Jackson\n\nUnsurprisingly, Cannes Jury President, Juliette Binoche, who has also starred opposite Depardieu, was asked for her thoughts on the importance of his conviction at yesterday's opening press conference. Last year's festival, anticipating Depardieu's forthcoming trial, was full of activity from France's own #MeToo movement, with French female film-makers using international cinema's most public platform to show films dealing with the subject of sexual abuse. A few days before Depardieu's conviction, the 90-year-old Bardot publicly called the actor a \"genius\" on French TV, and deplored that \"talented people who touch the bottom of a girl are consigned to the deepest dungeon\". Getty Images Adèle Haenel is one of the younger stars who has been vocal about sexual assault (Credit: Getty Images)\n\nBut Jackson points to a reaction to an event during the Depardieu trial, which she says is significant of a societal shift.", "timestamp": "2025-05-16 14:29:06"}