{"text_length": 7685, "summary": "St Clair Obscur: Expedition 33 has a lot of moving parts in its turn-based battle system. By the time you have a full party, you're juggling pretty distinct characters with bespoke playstyles. Part of the fun is experimenting with different characters, ability sets, and combos to find what works best for you. One of the odd design decisions in Clair Obscur is that you will start getting items that can be used at “camp” before you actually unlock the ability to set one up. You can set up camp once you reach the overworld map that lets you travel between hubs. This will come a few hours into playing, and after you have a team of at least three characters. Each character in Clair Obscur has a free aim ability that lets you aim and shoot projectiles at enemies in real-time. This is helpful for taking out flying enemies that will dodge your standard sword strikes, but it also doesn’t end your turn like an attack, ability, or item will. Your “ammo” is your AP, which fuels most of your abilities. Pictos are equipment that give each character passive buffs and effects. Some examples include giving you additional AP for each dodge or parry. But Pictos often still have stat boosts as well. So you can unload several bullets into an enemy to take down their shields, clearing the way for more powerful attacks. Clair Obscur's turn-based battles are built around timing mechanics. There are QTEs to increase ability power, as well as dodge and parry mechanics. For much of the early game, I relied on dodging more than parrying because the timing for those felt more forgiving. Almost every ability in Clair Obscur has an additional reaction to something else. You can mix both of them into your response, but if you commit to parrying, you’ll get the added benefit of countering. Make sure your team has status effect abilities that you can build combos from. Juggling all these combos and moving parts can be overwhelming. When you get the hang of it, that's when the game's combat really shines. As you’re upgrading your team and assigning their abilities, look for combo opportunities. Set your enemies on fire early and often. The Burn status effect deals decent damage at the beginning of every enemy turn. The effect stacks, so you can theoretically keep it going for an entire battle until the enemy is burnt to a crisp. This is especially useful when fighting fast enemies who get multiple turns in a row. Homegirl’s stance-shifting kit allows her to pivot between stat distributions. The trade-off for that flexibility is that her stance changes are tied to other abilities. Some attacks will automatically shift her to one stance or another, and that means moving into the desired one can sometimes require a few turns of setup. Managing her stance shifting requires some forethought. Once you figure out how best to utilize her abilities, she will mow through the most powerful foes you’ll face in Clair Obscur.", "timestamp": "2025-04-24 23:54:44"}