{"text_length": 7226, "summary": "But basic, slow breathing is all that’s needed for most people to experience the stress-reducing benefits of breathwork. Breathwork activates calming signals across brain circuits. “Maybe not everyone, but a lot of people will find that to be beneficial, and to me, that’s amazing.”\n\nAbout this breathwork and neuroscience research news\n\nAuthor: Will Houston\n\nSource: UCLA\n\nContact: Will Houston – UCLA\n\nImage: The image is credited to Neuroscience News People new to breathwork should start with something less intense, Dr. Feldman suggested: “Don’t go out and run a marathon when you’ve been sitting on the couch.”\n\nThe Wim Hof Method and a similar technique, Holotropic Breathwork, can lead to altered states of consciousness, which both Lindqvist and Dr. Feldman described as “psychedelic.”\n\nThis – and the tingling physical sensations – likely results from changes in carbon dioxide levels caused by hyperventilation, Dr. Feldman explained. Source: UCLA\n\nBreathwork – intentionally changing breathing patterns to improve physical, mental or emotional well-being – may seem woo-woo, but the science behind the practice is sound, says Jack Feldman, PhD, a professor of neurobiology at the David Geffen School of Medicine at UCLA. But one doesn’t need to understand how breath affects the brain to benefit from breathwork, Dr. Feldman said, “much like you can drive a car without understanding how an engine works.”\n\nPracticing common breathing techniques, such as box breathing or 4-7-8 breathing, for a few minutes a day is a great way to start, he said. Some of Dr. Feldman’s recent work has investigated whether the placebo effect contributes to the efficacy of breathwork. … It’s something we think that evolved early that we ultimately hijacked in terms of breathwork.”\n\nWhat makes breathwork work? In other words, do deep breaths calm us down because we expect them to?", "timestamp": "2025-05-19 14:31:03"}