{"text_length": 9283, "summary": "“So whatever is needed on me, I’m excited to be able to facilitate in whatever role, so it could change each game, each night, defensively, offensively, but the goal is to just lead, just be myself.”\n\nJalen Brunson committed five fouls in the third quarter (and one in the fourth)\n\nThe Celtics kept building massive leads against the Knicks early in the series only to see them leak away like water cupped between two hands. Advertisement:\n\nOffensively, Kornet got plenty of help from Brown, Derrick White and Jrue Holiday, but the Celtics held the Knicks to 17 points in the quarter in large part because they could not get anything going near the rim. “I unfortunately was a little tired and didn’t have my usual wit and charm.”\n\nKristaps Porzingis was the exact opposite\n\nGoing forward, the Celtics will also need to consider to what extent Porzingis can be part of the rotation – in stark contrast to Kornet, Porzingis played 12 minutes and was -12 in a game the Celtics won by 25 points. The Celtics are a championship-caliber team oozing with playoff experience and championship-quality mental strength, which is what made it so stunning that they went down 2-0 at home against the Knicks in the first place. We did that tonight, and we’ve got to try to find a way to win Game 6.”\n\nAdvertisement:\n\nThe Celtics showed their mettle. That strategy has now worked against both Brunson and Towns at various times in the series, and as the Celtics look ahead to a Game 6 that few thought they would see, they will need to consider how they can make both players work as much as possible on the defensive end. In two of those games, the Celtics shot their worst games all year, and on Wednesday, they built a 20-plus point lead without Tatum. “So we kind of have to play a little differently and just find ways to create offense, to rebound, just everything he does on the court. He wasn’t always rewarded with an assist – one of the Celtics’ best plays of the game started when Brown collapsed the defense and ended with Kornet sliding to the rim for an open pick-and-roll dunk several passes later. Wednesday’s game wasn’t just a team fighting for pride after its star went down – the Celtics were the better, more fundamental team. The rest of Brown’s game is what propelled the Celtics forward and kept their season alive. We haven’t won anything yet, just gotta find a way to go to New York and win a game.”\n\nWhite’s 3-point shooting was excellent, but he also went to the free-throw line 11 times. Advertisement:\n\nBut Brown’s biggest contributions may have come on the defensive end, where he took on the task of guarding Jalen Brunson and hounded the Knicks’ guard into a very tough game. However, Tatum’s injury ensured that the Celtics won’t be fully healthy for the foreseeable future.", "timestamp": "2025-05-16 14:29:56"}