{"text_length": 10756, "summary": "“One application that I’m exploring now is to use this cone by cone activation to simulate cone loss in healthy subjects.”\n\nThey are also exploring whether Oz could help people with color blindness to see all the colors of the rainbow, or if the technique could be used to allow humans to see in tetrachromatic color, as if they had four sets of cone cells. Credit: Neuroscience News\n\nBut using a new technique called “Oz,” scientists at the University of California, Berkeley, have found a way to manipulate the human eye into seeing a brand-new color — a blue-green color of unparalleled saturation that the research team has named “olo.”\n\n“It was like a profoundly saturated teal … the most saturated natural color was just pale by comparison,” said Austin Roorda, a professor of optometry and vision science at UC Berkeley’s Herbert Wertheim School of Optometry & Vision Science, and one of the creators of Oz. Science Advances\n\nAbstract\n\nNovel color via stimulation of individual photoreceptors at population scale\n\nWe introduce a principle, Oz, for displaying color imagery: directly controlling the human eye’s photoreceptor activity via cell-by-cell light delivery. Or, by primarily activating the M cone cells, Oz can show people the color olo. Attempting to activate M cones exclusively is shown to elicit a color beyond the natural human gamut, formally measured with color matching by human subjects. With an individual’s cone map in hand, the Oz system can be programmed to rapidly scan a laser beam over a small patch of the retina, delivering tiny pulses of energy when the beam reaches a cone that it wants to activate, and otherwise staying off. Further experiments show that subjects perceive Oz colors in image and video form. “We’ve created a system that can track, target and stimulate photoreceptor cells with such high precision that we can now answer very basic, but also very thought-provoking, questions about the nature of human color vision,” Fong said. But for a human to actually perceive a whole new color, Ng and Roorda would need to find a way to activate not just one cone cell, but thousands of them. The laser beam is just one color — the same hue as a green laser pointer — but by activating a combination of S, M and L cone cells, it can trick the eye into seeing images in full technicolor. “When the laser gets jittered, the normal color of the laser almost looks like yellow because the difference is so stark.”\n\nProbing the nature of color vision\n\nOz isn’t just useful for projecting tiny movies into the eye. “It gives us a way to study the human retina at a new scale that has never been possible in practice.”\n\nThe Oz technique is described in a new study published last week in the journal Science Advances. Theoretically, novel colors are possible through bypassing the constraints set by the cone spectral sensitivities and activating M cone cells exclusively.", "timestamp": "2025-04-25 11:06:06"}