{"text_length": 7753, "summary": "Credit: Tel Aviv University\n\n“Identifying the deer’s plentiful source, they began to develop the unique scrapers in the same place,” Litov explains. Prof. Barkai explains that the study reveals “links between technological developments and changes in the fauna hunted and consumed by early humans.”\n\nWhile previous theories credited advancements in stone tools to biological evolution, he and his team suggest a “double connection, both practical and perceptual.”\n\nPractically, tool sophistication evolved to meet the demands of hunting smaller, faster prey. Prehistoric hunters seemed to favor flint from the same region where the deer roamed – Mounts Ebal and Gerizim – suggesting a deep-rooted awareness of the landscape and its significance. “We found a connection between the plentiful source of fallow deer and the source of flint used to butcher them,” he notes. “In this study we tried to understand why stone tools changed during prehistoric times, with a focus on a technological change in scrapers in the Lower Paleolithic, about 400,000 years ago,” Litov explained. Tools made from a variety of local stones have been found at Jaljulia, but something unique occurred when they began sourcing both their prey and tool-making materials from the Samarian highlands. “Consequently, we see the emergence of the new Quina scrapers, with a better-shaped, sharper, more uniform working edge compared to the simple scrapers used previously,” Litov added. Archaeological evidence, including fallow deer bones from Mount Gerizim and other sites, suggests that the area supported deer populations well into the Holocene. A humble flint scraper, carried miles across rugged ground, reminds us that tools are never just tools. “Apparently, the Mountains of Samaria gained a prominent or even sacred status as early as the Paleolithic period,” Litov concludes, “and retained their unique cultural position for hundreds of thousands of years.”\n\nPrehistoric man was smarter than we thought\n\nPairing a resource with a place crops up again and again in human history, from obsidian quarries in the American Southwest to jade rivers in ancient China. These specialized tools – first appearing in Jaljulia around 500,000 years ago – later spread more broadly, showing up at Qesem Cave between 400,000 and 200,000 years ago. Hunters, then, were linking an essential resource – flint – to the very landscape that provided their new staple food.", "timestamp": "2025-05-19 14:31:24"}