{"text_length": 9863, "summary": "“Generalizability of Treatment Outcome Prediction Across Antidepressant Treatment Trials in Depression” by Diego Pizzagalli et al. They found that adding a brain connectivity marker to traditional clinical data (such as age, sex and baseline depression severity) significantly improved prediction performance across both studies. Objective\n\nTo assess whether neuroimaging and clinical features predict response to sertraline and escitalopram in patients with major depressive disorder (MDD) across 2 multisite studies using machine learning and to predict change in depression severity in 2 independent studies. Design, Setting, and Participants\n\nThis prognostic study included structural and functional resting-state magnetic resonance imaging and clinical and demographic data from the Establishing Moderators and Biosignatures of Antidepressant Response in Clinical Care (EMBARC) randomized clinical trial (RCT), which administered sertraline (in stage 1 and stage 2) and placebo, and the Canadian Biomarker Integration Network in Depression (CANBIND-1) RCT, which administered escitalopram. “However, many other options are available for treating depression and if we can identify markers for specific treatments, then the resulting decision support tools could be tested in biomarker-guided clinical studies.”\n\nAs mental health disorders continue to rise globally, the need for faster, data-driven treatment approaches is more urgent than ever. “We identified a brain connectivity marker that was predictive of response to common antidepressants across two large-scale clinical trials in the U.S. and Canada,” explained Peter Zhukovsky, a former postdoctoral fellow in Dr. Pizzagalli’s laboratory and now Scientist in the Brain Health Imaging Centre at the Centre for Addiction and Mental Health (CAMH) and first author of the study. The team’s findings underscore the promise of brain-based diagnostics to transform how depression is treated. In secondary analyses, prediction performance was assessed using observed vs predicted correlations between change in depression severity. Multivariate regressions showed substantial cross-trial generalizability in change in depression severity (predicted vs observed r ranging from 0.31 to 0.39). The use of early-treatment (week 2) instead of pretreatment depression severity scores resulted in the best generalization performance, comparable to within-trial performance.", "timestamp": "2025-04-25 11:05:15"}