{"text_length": 7757, "summary": "As Lovelace put it, “We’re kind of filling in some of this story, and we’re showing that the ideas that we’ve held for so long — ideas that were supported by the fragmented evidence that we had — weren’t quite right.”\n\nFor students of science and lovers of dinosaurs, this discovery is a reminder that big changes in knowledge often come from tiny bones. The work we have done with Dr. Lovelace breaks this cycle and creates an opportunity for reciprocity in the research process.”\n\nPublished in the Zoological Journal of the Linnean Society, the study adds critical data to the global picture of dinosaur origins. But the fossil of Ahvaytum bahndooiveche—and the layer of rock just beneath it containing a newly described amphibian—suggests that dinosaurs or their relatives were already living in the northern hemisphere as early as this humid episode or just after. (CREDIT: Zoological Journal of the Linnean Society)\n\nFilling the gaps in the fossil record\n\nWhy didn’t scientists find these fossils earlier? That further supports the idea of early dinosauromorph diversity in Laurasia during the mid–late Carnian. The Popo Agie Formation, though rarely yielding complete skeletons, has now given scientists one of the oldest and most significant finds in northern hemisphere dinosaur history. Along with Ahvaytum bahndooiveche, researchers also found bones from a silesaurid, a dinosaur-like creature, in the same formation. These findings challenge the “diachronous rise” theory, which said dinosaurs appeared first in the south and slowly expanded north as climates became friendlier. Instead, dinosaurs might have been widespread from the beginning, but their fossils in the north are harder to find due to fewer well-preserved rock layers. “We have, with these fossils, the oldest equatorial dinosaur in the world — it’s also North America’s oldest dinosaur,” said Lovelace. (CREDIT: David M. Lovelace)\n\nScientists had long believed that harsh environmental barriers kept early dinosaurs confined to southern Pangaea.", "timestamp": "2025-04-25 11:05:33"}