{"text_length": 8807, "summary": "Alzheimer’s & Dementia\n\nAbstract\n\nElevated serum cortisol associated with early-detected increase of brain amyloid deposition in Alzheimer’s disease imaging biomarkers among menopausal women: The Framingham Heart Study\n\nINTRODUCTION\n\nThis study investigates whether midlife cortisol levels predict Alzheimer’s disease (AD) biomarker burden 15 years later, with particular attention to sex differences and menopausal status. All this allowed them to investigate cortisol’s impact at an earlier stage of Alzheimer’s disease pathogenesis, where interventions might be most effective. “Our work shows that considering sex and hormonal status in understanding Alzheimer’s disease pathogenesis is important, and suggests that stress reduction and hormonal interventions may hold promise for Alzheimer’s prevention, especially in at-risk women,” said Sudha Seshadri, founding director of the Biggs Institute and senior author of the study. Cortisol levels were associated with increased amyloid buildup, not tau. “The results highlight the importance of identifying early risk factors when biomarkers are detectable but cognitive impairment is absent,” said Arash Salardini, MD, associate professor of cognitive and behavioral neurology with the Glenn Biggs Institute for Alzheimer’s and Neurodegenerative Diseases at UT Health San Antonio. Source: UT San Antonio\n\nCan stress lead to Alzheimer’s disease? Given the neuroprotective effects of estrogen and testosterone, which mitigate cortisol’s deleterious impact on neural tissues, they also explored sex-specific differences, focusing particularly on post-menopausal risk. Also, several cross-sectional and longitudinal studies had reported that higher blood cortisol levels are linked to an increased likelihood of developing the disease. Genetic studies had identified mutations in glucocorticoid, or steroid hormones that have anti-inflammatory and immunosuppressive effects, signaling pathways that increase susceptibility to Alzheimer’s disease.", "timestamp": "2025-05-19 14:31:05"}