{"text_length": 8677, "summary": "The Celtics’ defense against the Knicks’ star is about more than just the man guarding him to start possessions, but Brown and his additional length clearly made an impact, with Brunson scoring just 22 points (7-17 FGs) after torching the Celtics for 39 in Game 4. They ran their own Spain pick-and-roll, Towns got caught in the back screen, and Kornet rolled free to the basket for a reverse alley-oop dunk …\n\nThe seven blocks stood out, but the Celtics have also been at their best offensively in this series (124.7 points scored per 100 possessions) in Kornet’s 78 minutes on the floor. It’s been one of the Celtics’ best three-game stretches of offense (129.6 points scored per 100 possessions) this season. The Knicks made one more 3-pointer than Boston over the first two games, but the Celtics have made 31 more over the last three. The first of those third-quarter blocks came at the end of a terrific defensive possession for the Celtics’ third big man. Bad shots will arise when you take that many 3-pointers, and there were certainly some bad ones as the Celtics blew 20-point leads in Games 1 and 2. After a Josh Hart 3 for the Knicks, the Celtics got the ball up the floor quickly and Al Horford got it back to a trailing White, who was already 5-for-9 from 3-point range at that point. He spun into the paint, drew two more defenders and made a terrific wraparound pass to Kornet for a layup …\n\nWhen asked what his job is with Tatum out, Brown responded, “Get it done in multiple ways … Whatever is needed, I’m excited to facilitate in whatever role.”\n\n4. “I feel like I can guard with the best of them.”\n\nOn offense, Brown had almost as many assists (12) as he had through the first four games (13). Facing elimination for the first time in two years and missing their best player, the Boston Celtics responded with a huge second half in Game 5 of the Eastern Conference semifinals, torching the New York Knicks’ defense and cruising to a 127-102 victory on Wednesday. Games 1, 4 and 5 account for three of the four times in these playoffs that a team has taken at least 58% of its shots from 3-point range. Then the Celtics were able to get out in transition, even after made buckets on the other end of the floor. The Celtics, of course, set an NBA record this season by taking 53.6% of their shots from beyond the arc. Because Brown was guarding Brunson, the Knicks guard sometimes got caught guarding Brown in transition.", "timestamp": "2025-05-16 14:44:58"}