{
    "status": "ok",
    "totalResults": 37,
    "category": "technology",
    "country": "us",
    "timestamp": "2025-05-16 14:45:03",
    "articles": [
        {
            "id": "47ec6a29a56633d4aee9f8148d4ac63b",
            "title": "First look at Kingdom Hearts 4 in three years suggests Mickey Mouse is playable - Eurogamer",
            "url": "https://www.eurogamer.net/first-look-at-kingdom-hearts-4-in-three-years-suggests-mickey-mouse-is-playable",
            "publishedAt": "2025-05-15T08:46:22Z",
            "urlToImage": "https://assetsio.gnwcdn.com/KINGDOM-HEARTS-III-%E2%80%93-Opening-Movie-Trailer-1-23-screenshot.png?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
            "source": "Eurogamer.net",
            "description": "Square Enix has released fresh screenshots of Kingdom Hearts 4, giving us our first look at the game in three years.",
            "content": "Square Enix has released fresh screenshots of Kingdom Hearts 4, giving us our first look at the game in three years.\r\nThe last time the game was shown was back in 2022 for the series' 20th anniversar… [+2316 chars]",
            "full_content": "Square Enix has released fresh screenshots of Kingdom Hearts 4, giving us our first look at the game in three years.\n\nThe last time the game was shown was back in 2022 for the series' 20th anniversary, revealing Sora's return and the expansive metropolis of Quadratum.\n\nNow, following the cancellation of mobile game Kingdom Hearts Missing-Link yesterday, Square Enix is appeasing fans with a handful of screenshots.\n\n\"We're currently working hard on Kingdom Hearts 4 and will continue pouring ourselves into the game's development. We're dedicated to making this an experience that lives up to your expectations!\" reads an official social media post.\n\n\"We've seen how excited you are, and we are truly grateful from the bottom of our hearts. We are equally excited and can't wait to share more about Kingdom Hearts 4 when the time is right. Until then, we appreciate your patience.\"\n\nThe screenshots show Sora mid-battle in Quadratum against a handful of Heartless, as well as close-ups of some character models and moments in the city.\n\nOne screenshot suggests Mickey Mouse will be playable in this game. Disney's lead character has always been a part of the series and has previously been playable in a limited capacity, but his inclusion here hints at a bigger playable role this time around.\n\nTo our Kingdom Hearts community,\n\n\n\nWe’re currently working hard on Kingdom Hearts IV and will continue pouring ourselves into the game’s development. We’re dedicated to making this an experience that lives up to your expectations! [1/2] pic.twitter.com/4lbg6l2ErZ — KINGDOM HEARTS (@KINGDOMHEARTS) May 15, 2025 To see this content please enable targeting cookies. Manage cookie settings\n\nPerhaps what's most interesting is what isn't shown in these screenshots. The Kingdom Hearts games fuse together the worlds of Disney and Final Fantasy, but we're yet to see which Disney kingdoms will be featured in the new game, nor which Final Fantasy characters will make an appearance. I can certainly imagine Clive turning up at some point.\n\nAlso, where are longtime partners Donald and Goofy?\n\nKingdom Hearts 4 remains without a release date, but it's been in development for quite some time. It's been six years since the release of Kingdom Hearts 3 on PS4 and Xbox One and fans are eagerly anticipating the next installment.\n\nLast year, series director Tetsuya Nomura said Kingdom Hearts 4 will lead towards a series conclusion as he looks to retire."
        },
        {
            "id": "92fc7b66c28922cf7c0b7415110f8859",
            "title": "Apple Vision Pro Price Guessed Incorrectly Multiple Times On ‘The Price Is Right’ Show For The 256GB Version, Despite The Headset Garnering Massive Attention Worldwide - Wccftech",
            "url": "https://wccftech.com/apple-vision-pro-price-guessed-incorrectly-on-the-price-is-right-show/",
            "publishedAt": "2025-05-15T04:48:00Z",
            "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/05/Apple-Vision-Pro-4.jpg",
            "source": "Wccftech",
            "description": "The Apple Vision Pro is a product that generated massive hype, but even then, contestants on The Price Is Right show guessed its price incorrectly",
            "content": "The astronomical number of eyeballs on the Apple Vision Pro during the WWDC 2024 keynote highlighted the products uniqueness, while also introducing a price tag that would make interested parties gul… [+1849 chars]",
            "full_content": "The astronomical number of eyeballs on the Apple Vision Pro during the WWDC 2024 keynote highlighted the product’s uniqueness, while also introducing a price tag that would make interested parties gulp upon hearing the figure, but it appears that some are not aware of how much the device costs. On ‘The Price Is Right’ show, the 256GB model was showcased for four contestants, and while the mixed reality headset generated heaps of attention around several regions, it appears that there might be a few who have little clue about how ludicrously expensive the headset really is.\n\nOut of the four contestants who tried guessing the Apple Vision Pro’s price, none of them managed to come close to the actual figure\n\nOn Threads, Justin Ryan posted a video that was spotted by AppleInsider, where the host asks four contestants how much they think the 256GB model of the Apple Vision Pro costs. Given that the firm has a trillion-dollar status and the majority of individuals would be familiar with the pricing, it is interesting that none of the four people came even remotely close to the head-mounted wearable’s $3,499 figure, indicating that regular buyers expected it to be significantly more affordable than it already is.\n\nThe objective of The Price Is Right is to guess the product’s price without going overboard. The closest that one of the contestants came to the Apple Vision Pro was $1,270, and even then, it was not half of the device’s $3,499 retail price in the U.S. for the 256GB model. Then again, Apple CEO Tim Cook previously stated that the AR headset was never something that was targeted to the masses, but aimed at those who wanted to experience tomorrow’s technology today.\n\nIt appears that there are few affluent technology enthusiasts around because the Apple Vision Pro did not even garner 500,000 shipped units, highlighting that an affordable alternative could be a potential solution to help the California-based giant ramp up shipments worldwide. As for the remaining three contestants, one mentioned a price of $750, with the second one guessing a figure of $1,000, and the last one believing that the Apple Vision Pro costs $1,001.\n\nNews Source: justinryan.io"
        },
        {
            "id": "60e171c4f7fcb2d54b8704b85fa2dfce",
            "title": "Material 3 Expressive is already making its way to Wear OS Tiles - 9to5Google",
            "url": "http://9to5google.com/2025/05/14/material-3-expressive-wear-os-tiles/",
            "publishedAt": "2025-05-15T02:53:00Z",
            "urlToImage": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2025/05/Material-3-Expressive-Wear-OS-buttons.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
            "source": "9to5google.com",
            "description": "While Material 3 Expressive is not coming to Wear OS 6 until later this year, Google is already updating Tiles with the new design language.",
            "content": "While Material 3 Expressive is not coming to Wear OS 6 until later this year, Google is already beginning to update apps and Tiles with the new design language. \r\nOne hallmark of M3 Expressive on wat… [+998 chars]",
            "full_content": "While Material 3 Expressive is not coming to Wear OS 6 until later this year, Google is already beginning to update apps and Tiles with the new design language.\n\nOne hallmark of M3 Expressive on watches is embracing the round screen with UI elements that “hug the display.” Arc-shaped buttons placed on the perimeter are an example of that.\n\nOne Pixel Watch user has already noticed them on the two Google Calendar Wear OS Tiles: Next event (“Calendar”) and Next tasks (“More”). In comparison, the previous design makes use of pill-shaped buttons that are much smaller. The new approach gives users a larger touch target to hit.\n\nOld vs. new (Credit: u/TurningTablesAgain)\n\nAdvertisement - scroll for more content\n\nGoogle Calendar for Wear OS was updated to version 2025.18.1 today, though we’re not seeing the Material 3 Expressive buttons live on watches we checked today. There’s presumably a server-side component to this rollout.\n\nMaterial 3 Expressive will debut on the Pixel Watch later this year, but app updates are already underway. More broadly, Wear OS Tiles with M3E will get much denser with new layouts that show and offer much more.\n\nMore on Material 3 Expressive:"
        },
        {
            "id": "4992089ec1646f20d85635b6e53299c4",
            "title": "Mortal Kombat 1 Looks To Be Winding Down Support With The 'Definitive Edition' - Nintendo Life",
            "url": "https://www.nintendolife.com/news/2025/05/mortal-kombat-1-looks-to-be-winding-down-support-with-the-definitive-edition",
            "publishedAt": "2025-05-15T00:45:00Z",
            "urlToImage": "https://images.nintendolife.com/2445379fad2a8/large.jpg",
            "source": "Nintendo Life",
            "description": "That's a wrap",
            "content": "@tdub154420 : What drives me crazy is that people defend DLC because \"iT's ChEaPeR ThAN bUyiNg A NeW gAmE!\" when it really bloody isn't. Many \"season passes\" cost as much as a whole new game (sometim… [+1062 chars]",
            "full_content": "Following rumours late last year Mortal Kombat 1 could be winding down its support sooner rather than later, NetherRealm and WB Games have this week announced the arrival of the Mortal Kombat 1: Definitive Edition.\n\nThis version of the game, which is available for $59.99 USD (or your regional equivalent), is said to offer the \"most extensive Mortal Kombat 1 experience\" including not only the base game and more recent Khaos Reigns story expansion but also both Kombat Packs (including all of the DLC fighters so far).\n\nAll up there are 35 fighters and 21 Kameos. Additionally, you'll also get the \"new movie skins\" update, Animalities which dropped alongside Khaos Reigns, and there's even Floyd. You can see the full trailer for the Definitive Edition on the game's official YouTube channel.\n\nThis again follows rumours in 2024 about NetherRealm supposedly axing its plans for a second story expansion and third Kombat Pack. The series co-creator Ed Boon previously claimed this particular entry could potentially have \"years of content\" going forward, following its release in 2023.\n\nAlongside this announcement is a \"May Hotfix\" update which contains character and Kameo Fighter adjustments."
        },
        {
            "id": "739ab43c1ca2262ede430a769c18c0fa",
            "title": "Apple Intelligence: Three features Apple needs to copy from the competition - 9to5Mac",
            "url": "https://9to5mac.com/ai-features-apple-needs-to-adopt/",
            "publishedAt": "2025-05-14T22:15:00Z",
            "urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/04/apple-intelligence-rainbow.jpeg?resize=1200%2C628&quality=82&strip=all&ssl=1",
            "source": "9to5Mac",
            "description": "To call the Apple Intelligence rollout a blunder is quite the understatement. However, there are three features it could adopt to catch up.",
            "content": "Considering the host of AI features Apple promised at last years WWDC, here we are one year later, and the company seems even further behind the competition than it did last June.\r\nTo call the Apple … [+3591 chars]",
            "full_content": "Considering the host of AI features Apple promised at last year’s WWDC, here we are one year later, and the company seems even further behind the competition than it did last June.\n\nTo call the Apple Intelligence rollout a blunder is quite an understatement. However, I am hopeful that in a few weeks, we might see a few new features (or maybe concepts of a plan) that may actually make it feel like the company might catch up:\n\n#1: Google’s Notebook LM\n\nWith support for custom instructions and, more recently, multiple languages, Audio Overviews have been a massive part of my study routine for dense and technical machine learning papers.\n\nStill, every time I use it, I can’t help but think how fantastic it would be if Safari had a native Audio Overview-like feature. (Or if Apple Notes had a broader Notebook LM-like feature, for that matter.)\n\nFrom the possibility of creating automatic daily audio digests of Read Later links, to listening to an instant roundup of anything I might be reading in Safari, Apple has a ton of options to bring AI to its browser beyond the Summarization tool.\n\n#2: Anthropic’s MCP\n\nLast year, Anthropic announced Model Context Protocol (MCP): an open standard that allows LLMs to securely and seamlessly interact with external tools, APIs, and platforms through a unified interface.\n\nYou are looking at Claude interacting directly with Blender and creating a 3D scene from a user prompt.\n\nIn the last few months, MCP has been adopted by OpenAI, Zapier, Google DeepMind, Replit, Microsoft, Block, and many other companies and platforms. It actually has a chance of becoming as much of a standard for LLM-platform interaction, as HTTPS is for the web or SQL is for databases.\n\nConsidering the frameworks already in place with Siri Intents and Siri Shortcuts, we’d be much more likely to see the company announce its own MCP-like protocol next month rather than see Apple adopt MCP proper.\n\nRegardless, users would benefit hugely from, for instance, asking an LLM (even Siri!) to create an entire Keynote presentation from a Pages document. Likewise, users who rely on accessibility tools would unlock possibilities that to this day feel like science fiction.\n\n#3: OpenAI’s Screen Sharing\n\nCurrently, Apple offers Visual Intelligence, which lets the user “click and hold it to do things like look up details about a restaurant or business; have text translated, summarized, or read aloud; identify plants and animals; and more”.\n\nHowever, it still lacks a crucial feature that ChatGPT users have been enjoying since last year: video and screen sharing.\n\nWhile applying AI to a photo may be helpful, it already feels like a prehistoric workflow compared to just opening the camera or messing with the phone and talking about what is on the screen with ChatGPT. Ask ChatGPT to help you with a food allergy question while you flip through a menu, and you’ll see what I mean.\n\nRoundup\n\nFor all the talk about AI we have all seen over the last couple of years, the truth is that the wider audience (think grandma) is still having difficulty going beyond a few mindless prompts on ChatGPT and figuring out how that may actually fit into their lives.\n\nThe key to making AI useful is to actually deliver its benefits in the context where the user already is, rather than having them jump back and forth between apps. Granted, many (if not all) of these features could potentially involve server-side processing of sensitive data, but hey, that’s the job.\n\nAs long as users know what is going on, they can decide whether to use a feature. However, passing on the development of these features due to privacy challenges is no longer an option.\n\nHow about you? Which AI features from other apps and services would you like to see Apple adopt natively on the Mac and the iPhone? Let us know in the comments."
        },
        {
            "id": "69ad0248c874492cb80d4109ee0ad4fb",
            "title": "The latest Apple Maps update will bring out your bougie side - TechCrunch",
            "url": "https://techcrunch.com/2025/05/14/the-latest-apple-maps-update-will-bring-out-your-bougie-side/",
            "publishedAt": "2025-05-14T20:55:40Z",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-1224111372_9d6ea2.jpg?resize=1200,777",
            "source": "TechCrunch",
            "description": "Apple Maps announced a collaboration with the MICHELIN Guide, The Infatuation, and Golf Digest to help users find recommended restaurants and golf courses",
            "content": "Apple Maps announced a collaboration with the MICHELIN Guide, The Infatuation, and Golf Digest to help users find recommended restaurants and golf courses in their area.\r\nStarting in the U.S., users … [+848 chars]",
            "full_content": "Apple Maps announced a collaboration with the MICHELIN Guide, The Infatuation, and Golf Digest to help users find recommended restaurants and golf courses in their area.\n\nStarting in the U.S., users will be able to filter their Maps searches to see restaurants with MICHELIN ratings, which denote exceptional dining experiences. But if you’re on the go, you’re probably not making a last-minute MICHELIN booking — but options from The Infatuation, a restaurant recommendation website, can help fill in the gaps.\n\nThough the MICHELIN Guide is most well-known for its dining expertise, it also offers hotel recommendations and booking services, which will also be available on Apple Maps.\n\nThe Golf Digest integration on Maps will function similarly, allowing users to filter their searches to find recommended golf courses — but we imagine more users will be looking for places to eat, rather than to tee off.\n\nThese partners will also contribute to Apple Maps’ curated guides, which can help travelers find their way to top destinations on a visit."
        },
        {
            "id": "50c81a356f8cea7573d94e7fd2a62a29",
            "title": "2025 MacBook Air Is Now Cheaper Than 2020 Model, Amazon Slashes Prices Like Never Before - Gizmodo",
            "url": "https://gizmodo.com/2025-macbook-air-is-now-cheaper-than-2020-model-amazon-slashes-prices-like-never-before-2000602421",
            "publishedAt": "2025-05-14T20:17:05Z",
            "urlToImage": "https://gizmodo.com/app/uploads/2025/05/macbookair-2025.jpg",
            "source": "Gizmodo.com",
            "description": "If you’ve been dreaming of the most powerful MacBook Air, don’t miss this incredible deal from Amazon.",
            "content": "If you’re familiar with Apple, you probably know that the company rarely (never?) offers discounts on its latest products through its own website. Thats why smart shoppers know to check Amazon which … [+2175 chars]",
            "full_content": "If you’re familiar with Apple, you probably know that the company rarely (never?) offers discounts on its latest products through its own website. That’s why smart shoppers know to check Amazon which consistently delivers the best prices on Apple devices.\n\nCurrently, Amazon is selling a great deal on the freshly released 2025 MacBook Air 13-inch, a power-laptop that only came out two months ago. At only $849, down from the original $999, this is a unique opportunity to own Apple’s latest ultra-portable powerhouse at a price that’s hard to believe.N ow is the time to act before this deal inevitably sells out.\n\nSee at Amazon\n\nPowerful M4 Chip\n\nThe 2025 MacBook Air features the new M4 chip which is designed specifically for Apple Intelligence. This new-generation processor brings performance and efficiency to new levels and makes the MacBook Air faster, smarter and more responsive than before. It’s the sort of increase in performance that makes day-to-day tasks feel instantaneous and creative work truly enjoyable.\n\nObviously, you’ll love its stunning 13.6-inch Liquid Retina display: The screen is bright, vibrant and incredibly sharp, and makes everything from streaming movies to editing documents a pleasure. Colors are true-to-life and text is crisp so whether you’re working or unwinding, you’ll appreciate the visual clarity.\n\nWith 16GB of total memory and a 256GB SSD (the 512GB model is also on sale), this MacBook Air is built for multitasking and performance. You can have several applications open simultaneously, switch between tasks in the blink of an eye and store hundreds of photos and videos without ever feeling lag. The fast SSD assures that all operations from startup to launching applications take place in the blink of an eye.\n\nApple has also packed this laptop with functionality for how we work and live today: The 12MP Center Stage camera is perfect for video calls, which always keep you in frame as you move around. Touch ID makes logging in and secure payment easy. All-day battery life allows you to take your MacBook Air anywhere and ditch the charger.\n\nAmazon customer reviews are extremely favorable with an average rating of 4.8 out of 5 stars provided by hundreds of users. The fact that a new release is already discounted by a huge amount is unprecedented for Apple products. At just $849, it’s hard to imagine this deal lasting long.\n\nSee at Amazon"
        },
        {
            "id": "59efda8ed5ea74d070e11f3416fb0132",
            "title": "New 2025 iPad Now Costs Less Than AirPods Pro, Amazon Clears Out Stock - Gizmodo",
            "url": "https://gizmodo.com/new-2025-ipad-now-costs-less-than-airpods-pro-amazon-clears-out-stock-2000602403",
            "publishedAt": "2025-05-14T20:05:54Z",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/12/ipad-.jpg",
            "source": "Gizmodo.com",
            "description": "You can finally treat yourself to an Apple product that no longer costs a fortune.",
            "content": "It’s incredible to receive a brand-new 2025 iPad (which is powered by Apple’s advanced A16 chip) at an all-time low price on Amazon. Originally listed for $349 for the 128GB WiFi model, this 11-inch … [+2188 chars]",
            "full_content": "It’s incredible to receive a brand-new 2025 iPad (which is powered by Apple’s advanced A16 chip) at an all-time low price on Amazon. Originally listed for $349 for the 128GB WiFi model, this 11-inch iPad had been selling for $319 just hours ago but has now dipped below the $300 threshold to an unbeatable price of $299. For a machine that can easily transform into a laptop alternative for most individuals, this price is truly mindblowing.\n\nSee at Amazon\n\nIt Can Replace Your Laptop\n\nThe 2025 iPad 11-inch is a real monster and it changes everything you know a tablet can be: It features the A16 chip which is the same high-end processor that powers Apple’s top-of-the-line devices (iPhone 16) for massive performance on everything from creative tasks to multitasking and graphics-intensive gaming. This kind of performance is coupled with all-day battery life and means you can rely on your iPad from morning meetings to late nights of streaming.\n\nThis base model has a ample 128GB so there’s more than enough space for your favorite apps, creative pursuits, documents, and high-definition video. With Wi-Fi 6 turned on, you’ll experience scorchingly quick downloads, seamless streaming and fast file transfers, which makes it perfect for work and play.\n\nThe 11-inch Liquid Retina display is simply breathtaking, and this is why we love Apple: Colors pop, details are crystal clear and the True Tone feature adjusts the display’s color temperature automatically to match your surroundings. The responsiveness of the screen is also a note-taker’s and artist’s dream especially when paired with the Apple Pencil (USB-C), to turn the iPad into a digital canvas.\n\nApple’s iPadOS introduces a new standard of productivity and flexibility to the device: Multitasking is seamless with the capability to run multiple apps side by side, utilize drag-and-drop between windows and leverage a massive ecosystem of more than a million apps created exclusively for iPad. Pre-installed apps such as Safari, Messages and Keynote are simple to get started with, while the App Store provides unlimited possibilities for creativity.\n\nWith its all-but-unanimous praise (an average review score of 4.7 out of 5 from over 1,200 reviews), the 2025 iPad 11-inch is a productivity monster. For under $300, this is an opportunity to own a device that can literally do it all, for a price that feels like too good to be true.\n\nSee at Amazon"
        },
        {
            "id": "9673e7e2d5668d42000cb325dfaae905",
            "title": "Epic Resubmits Fortnite to U.S. App Store After Not Hearing From Apple for 120+ Hours - MacRumors",
            "url": "https://www.macrumors.com/2025/05/14/epic-resubmits-fortnite-to-app-store/",
            "publishedAt": "2025-05-14T20:01:01Z",
            "urlToImage": "https://images.macrumors.com/t/pEcGnr4wvdeAn0ib_eEGxq98EkI=/1600x/article-new/2020/08/fortnite-apple-logo-2.5.jpg",
            "source": "MacRumors",
            "description": "On Friday, Epic Games submitted Fortnite to the U.S. App Store, and since then, we've been waiting to see if Apple would approve the game and...",
            "content": "On Friday, Epic Games submitted Fortnite to the U.S. App Store, and since then, we've been waiting to see if Apple would approve the game and allow it back on the iPhone and the iPad. There's been no… [+2496 chars]",
            "full_content": "On Friday, Epic Games submitted Fortnite to the U.S. App Store, and since then, we've been waiting to see if Apple would approve the game and allow it back on the iPhone and the iPad. There's been no word from Apple so far, but ‌Epic Games‌ opted to pull its first App Store review request, and has now resubmitted Fortnite.\n\n\n\nFortnite leaker Shiina shared the news, with the information reposted by ‌Epic Games‌ CEO Tim Sweeney. According to Sweeney, ‌Epic Games‌ needs to release a weekly Fortnite update with new content on Friday, and platforms need to be updated simultaneously. The company pulled the prior version, and submitted a new version with the update for review.\n\n‌Epic Games‌ apparently had not heard from Apple since submitting Fortnite to the ‌App Store‌ on Friday. \"The first request went unreviewed for 120+ hours,\" wrote Shiina. Apple's App Review guidelines suggest that 90 percent of ‌App Store‌ submissions are reviewed in less than 24 hours, but it's clear that Fortnite's return to the ‌App Store‌ is not straightforward for Apple.\n\nApple banned the ‌Epic Games‌ developer account back in 2020 when ‌Epic Games‌ violated its ‌App Store‌ rules to add web-based purchases, kicking off a multi-year legal battle. Because the main ‌Epic Games‌ developer account continues to be banned, Epic submitted Fortnite to the U.S. ‌App Store‌ using an account from Epic Games Sweden, a subsidiary that Epic formed to create the ‌Epic Games‌ Store alternative app marketplace in the European Union.\n\nPrior to submitting Fortnite to the U.S. ‌App Store‌, ‌Epic Games‌ CEO Tim Sweeney said that Epic \"conversed\" with Apple about its plan, but at no point did he say that Apple had okayed the idea. It's still not clear if Apple will approve Fortnite for the U.S. ‌App Store‌, because the Epic Games vs. Apple lawsuit made it clear that Apple was well within its rights to terminate Epic's account, and does not have an obligation to allow Fortnite into the ‌App Store‌.\n\n‌Epic Games‌ is trying to bring Fortnite back to the U.S. ‌App Store‌ because Apple is now required to allow U.S. developers to direct customers to web-based purchase options available outside of the ‌App Store‌, which is what Fortnite got banned for in the first place. The order was part of an injunction levied by the judge overseeing ‌Epic Games vs. Apple‌, and it is now being enforced. Apple is appealing the ruling, but has to follow it until Apple hears from the appeals court.\n\nSweeney said that he would be \"very surprised\" if Apple \"decided to brave the geopolitical storm of blocking a major app from iOS,\" and it is true that Apple might not want to risk further angering the judge overseeing the case."
        }
    ]
}