{
    "status": "ok",
    "totalResults": 16,
    "category": "entertainment",
    "country": "us",
    "timestamp": "2025-05-16 14:43:35",
    "articles": [
        {
            "id": "0e1f8ca02bde4d8936d9a4c601c03f71",
            "title": "‘Shōgun’ Star Cosmo Jarvis to Lead ‘Young Stalin’ Biopic From ‘Zone of Interest’ Producer Access Entertainment (EXCLUSIVE) - Variety",
            "url": "https://variety.com/2025/film/news/cosmo-jarvis-joseph-stalin-biopic-young-stalin-1236398702/",
            "publishedAt": "2025-05-15T07:19:00Z",
            "urlToImage": "https://variety.com/wp-content/uploads/2025/01/GettyImages-2192201538.jpg?w=1000&h=563&crop=1",
            "source": "Variety",
            "description": "Géla Babluani has signed on to direct the period thriller, which is being financed by Len Blavatnik‘s Access Entertainment.",
            "content": "Cosmo Jarvis, star of FX’s smash hit series “Shōgun,” will star as future Soviet leader Joseph Stalin in “Young Stalin.” Georgian-French helmer Géla Babluani (“13 Tzameti,” “Money”) has signed on to … [+1994 chars]",
            "full_content": "Cosmo Jarvis, star of FX’s smash hit series “Shōgun,” will star as future Soviet leader Joseph Stalin in “Young Stalin.” Georgian-French helmer Géla Babluani (“13 Tzameti,” “Money”) has signed on to direct the period thriller that is being financed by Len Blavatnik‘s Access Entertainment, which backed Jonathan Glazer’s Oscar-winning Holocaust film “The Zone of Interest” and last year’s “Conclave.”\n\nBased on the acclaimed bestseller by Simon Sebag Montefiore, “Young Stalin” charts the early days of the Soviet strongman when he was a bank-robbing gangster in pre-revolutionary Russia. Babluani and Sebag Montefiore wrote the screenplay for the film that is also being backed by AI Film and Monte Rosso Prods.\n\nPopular on Variety\n\nSet against the backdrop of Imperial Russia’s criminal underworld and revolutionary ferment, the film explores the making of the bloody dictator who would reshape the 20th century through terror, war and ideology — and the largest bank heist in Russian history, according to the logline.\n\nDirector Géla Babluani said: “I’ve always been drawn to stories that live in the shadows, and there’s no shadow longer than Stalin’s. This isn’t a portrait of power — it’s a descent into the fire that forged it. With Cosmo, we have a lead actor who understands danger, charm and the fractures of identity.”\n\nUpgrade is presenting the package to international buyers in Cannes. Principal photography is set to begin in Tbilisi in July.\n\nSam Taylor of F&ME (“Before the Rain”) is producing alongside Archil Gelovani of IFP (“April”), Vladimer Katcharava of 20 Steps (“Girls of the Sun”) and Alexander Kushaev (“The Painted Bird”). Blavatnik is executive producing with Danny Cohen and Vince Holden. Rupert Lloyd, Gunda Bergman and Esko Rips round out the producing team.\n\n“Stalin’s early life as a bank-robber is an extraordinary and largely unknown story, driven by revolutionary zeal and characterized by violence, betrayal and lust for power,” Cohen added.\n\nJarvis’ upcoming projects include Guy Ritchie‘s next film, “Wife & Dog,” and he recently starred in A24’s Iraq War thriller “Warfare.” He is repped by UTA and the Artists Partnership. Babluani is handled by UBBA in Paris."
        },
        {
            "id": "e7d7e6c6f7b526b3dc85c86034ad77e2",
            "title": "Horoscope for Thursday, 5/15/25 by Christopher Renstrom - SFGATE",
            "url": "https://www.sfgate.com/horoscope/article/horoscope-thursday-5-15-25-christopher-renstrom-20319965.php",
            "publishedAt": "2025-05-15T05:19:58Z",
            "urlToImage": "https://s.hdnux.com/photos/47/72/12/10461851/6/rawImage.jpg",
            "source": "SFGate",
            "description": "ARIES (March 20 - April 18): Don't stress about trying to make a situation work.  You'll find a way.  Besides you said you wanted to try a different approach.",
            "content": "Star-crossed lovers?PlentyOfFish sorted through 150,000 users to find trends in matches between certain astrological signs. Who's your best match? Click through to find out. \r\nAries, March 21 to Apri… [+7105 chars]",
            "full_content": "Star-crossed lovers?PlentyOfFish sorted through 150,000 users to find trends in matches between certain astrological signs. Who's your best match? Click through to find out. \r\nAries, March 21 to Apri… [+7105 chars]"
        },
        {
            "id": "63e79b0ad3ba09921405288dbad205b8",
            "title": "Halle Bailey granted sole physical, legal custody of son Halo after ex DDG’s alleged abuse - Page Six",
            "url": "https://pagesix.com/2025/05/14/celebrity-news/halle-bailey-granted-sole-custody-of-son-after-ex-ddgs-alleged-abuse/",
            "publishedAt": "2025-05-15T02:07:00Z",
            "urlToImage": "https://pagesix.com/wp-content/uploads/sites/3/2025/05/104504911.jpg?quality=75&strip=all&w=1024",
            "source": "Page Six",
            "description": "The “Little Mermaid” star was also granted a temporary order of protection from her ex after alleging multiple instances of abuse.",
            "content": "Halle Bailey has been granted temporary sole physical and legal custody of her son, Halo, whom she shares with ex DDG, until a June 4 court hearing. \r\nOn Tuesday, the “Little Mermaid” star petitioned… [+3743 chars]",
            "full_content": "Halle Bailey has been granted temporary sole physical and legal custody of her son, Halo, whom she shares with ex DDG, until a June 4 court hearing.\n\nOn Tuesday, the “Little Mermaid” star petitioned the court for sole custody of their 16-month-old son after she accused the rapper — whose real name is Darryl Dwayne Granberry Jr. — of domestic abuse. She has asked that she maintains sole custody of their child moving forward.\n\nAccording to legal documents obtained by Page Six, the singer claimed she filed without giving notice to her ex because she “was afraid that the violence would reoccur” and that she feared “the other party would take the children out of the area” before the order could be granted and served.\n\n8 Halle Bailey has been granted temporary sole physical and legal custody of her son, Halo, whom she shares with ex DDG. hallebailey/Instagram\n\n8 The court order comes after Bailey accused her ex of physically attacking her multiple times after their breakup. ddg/Instagram\n\nA rep for DDG did not immediately respond to Page Six’s request for comment.\n\nThe “Color Purple” actress, 25, was granted a temporary order of protection from her ex after alleging that he physically attacked her multiple times following their October 2024 breakup.\n\nIn the legal docs, Bailey claimed the first incident of abuse took place in January after she attempted to set up a visitation schedule with DDG.\n\nShe claimed the YouTuber, 27, arrived at her home to pick up their son and became verbally abusive, telling her, “Get out of my car, bitch,” as she attempted to help buckle their baby boy into his car seat.\n\n8 Bailey petitioned the court for sole custody of the 16-month-old without giving notice to her ex because she “was afraid that the violence would reoccur.” Halle Bailey / Instagram\n\n8 In the legal docs, she claimed the violence first took place in January when she attempted to set up a visitation schedule with the rapper. WireImage for Parkwood\n\nWant more celebrity and pop culture news? Start your day with Page Six Daily. Thanks for signing up! Enter your email address Please provide a valid email address. By clicking above you agree to the Terms of Use and Privacy Policy. Want celebrity news as it breaks? Hooked on Housewives? Check out more newsletters\n\nHe then allegedly pulled Bailey’s hair and pushed her face into the steering wheel, chipping a front tooth.\n\nThe “Grown-ish” alum chose to ride in DDG’s car to his home as she was concerned about her son’s safety. Upon their arrival, she said she described the alleged incident to DDG’s family.\n\nShe included photos of her chipped tooth and bruises on her arm in her restraining order request, which was granted by the LA courts.\n\n8 Bailey claimed DDG pulled her hair and pushed her face into the steering wheel, resulting in a chipped tooth. Getty Images for Gucci\n\n8 She also included photos of the bruises she allegedly sustained in the attack. California Judicial Council\n\nDDG must stay 100 yards away from Bailey and Halo and cannot have firearms in his possession. The rapper is also not allowed to contact her either directly or indirectly.\n\nBailey also requested that he not be able to use his streaming platforms to weaponize his fanbase against her.\n\n“Whenever he wishes to cause upset, he starts bad mouthing me to his several millions of fans,” she said in the documents, per ABC News.\n\n8 The singer also asked that DDG stop using his streaming platforms to weaponize his fanbase against her. hallebailey/Instagram\n\n8 Bailey was granted a temporary restraining order that stipulated DDG must stay 100 yards away from her and Halo. Getty Images for Gucci\n\n“He claims I am withholding our son and that I am with other men. As a result, I then receive threats and hate on social media.”\n\nIn November 2024, Halle called out her ex for livestreaming with their son, writing in part on X, “i wasn’t told or notified and i am extremely upset to have my baby in front of millions of people.”\n\nHalle and DDG welcomed baby Halo in December 2023. The pair called it quits on their relationship just 10 months later.\n\nIf you or someone you know is affected by any of the issues raised in this story, call the National Domestic Violence Hotline at 1-800-799-SAFE (7233) or text START to 88788."
        },
        {
            "id": "330dd98f4d722ebee5f611cc18edfefc",
            "title": "Cassie testifies on Kid Cudi relationship and alleged violence during Diddy trial - The Washington Post",
            "url": "https://www.washingtonpost.com/entertainment/music/2025/05/14/cassie-ventura-testimony-diddy-trial-day-3/",
            "publishedAt": "2025-05-15T01:51:40Z",
            "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TBLYHE4XUGLJANHL3RT2L25XPM.jpg&w=1440",
            "source": "The Washington Post",
            "description": "During testimony in Sean “Diddy” Combs’s sex-trafficking trial, Cassie Ventura shared details about Combs’s alleged abuse and her relationship with rapper Kid Cudi.",
            "content": "NEW YORK Star witness Casandra Cassie Ventura continued bombshell testimony in her former partner Sean Diddy Combss sex-trafficking trial on Wednesday, revealing more details about the music moguls a… [+5752 chars]",
            "full_content": "NEW YORK — Star witness Casandra “Cassie” Ventura continued bombshell testimony in her former partner Sean “Diddy” Combs’s sex-trafficking trial on Wednesday, revealing more details about the music mogul’s alleged abuse with accusations of rape, arson and blackmail. During the singer’s second day of testimony at the Daniel Patrick Moynihan U.S. Courthouse in Manhattan, Ventura shared the $20 million settlement amount she received in her explosive 2023 lawsuit against Combs.\n\nVentura said her litigation against Combs is over and that she is testifying against him “to do the right thing.”\n\nplay Play now NaN min Follow on Podcast episode Spotify Apple Google Amazon\n\nJurors were also shown explicit photos of freak-offs — the drug- and sex-fueled parties at the center of the prosecution’s case against Combs, who is charged with five criminal counts of racketeering conspiracy, sex trafficking and transportation to engage in prostitution. He has pleaded not guilty to all charges and faces 15 years to life in prison if convicted on all counts.\n\nAdvertisement\n\nAhead of the defense team’s plans to cross-examine Ventura on Thursday, here’s what we learned during her second day of testimony:\n\nVentura recounts alleged rape by Combs\n\nOn the stand, Ventura was asked to describe Combs’s alleged rape of her, which she said took place at her home in 2018 after they had broken up.\n\nEarlier that day, the singer said she and Combs had a pleasant lunch together, describing their conversation as “closure,” since she had begun a relationship with Alex Fine, who is now her husband. Later, when the two returned to Ventura’s home, she says that Combs raped her.\n\nThe incident was first mentioned in the 35-page lawsuit Ventura brought against Combs in November 2023. During Wednesday’s testimony, she revealed that the lawsuit was settled for $20 million. She added that she had been writing a book about her experiences when he paid her.\n\nAdvertisement\n\n“I wanted to be compensated for the time and the pain and the many, many years of having to try to fix my life,” Ventura said. It is unclear if the terms of her settlement barred her from releasing a book.\n\nVentura identified an alleged victim who is expected to testify\n\nProsecution showed Ventura an image of “Mia,” an alleged victim who will be testifying under a pseudonym, and asked the singer if she recognized her. Ventura said she did.\n\nIn the prosecution’s opening statements on Monday, Assistant U.S. Attorney Emily Johnson referred to Mia as a former Combs employee who was sexually assaulted multiple times by Combs. Johnson also described a girlfriend of Combs’s using the pseudonym “Jane,” who began dating Combs in 2020.\n\nJohnson alleged that Combs also forced Jane to perform in freak-offs, videotaping the events and then blackmailing her with the videos. They were still in a relationship as recently as last year, Johnson added.\n\nAccusations of blackmail using freak-off videos\n\nVentura said she felt “trapped” on a commercial flight home to New York from the Cannes film festival — the year was unclear from testimony — as Sean Combs played freak-off videos for her on the plane and threatened to release them.\n\nAdvertisement\n\nVentura described being terrified of the embarrassment that would ensue if he leaked those videos. “I didn’t want to feel scared anymore,” she said. “He could put these videos out and ruin everything.” The footage, Ventura added, would “make me out to be somebody that I’m not in an unfair way.”\n\nAfter their flight landed, they had dinner in New York. That same night, they had another freak-off.\n\nVentura admits to being violent\n\nCombs’s defense attorneys are expected to argue that Ventura and Combs had a mutually toxic relationship and that she was also violent toward him. Prosecutors asked Ventura to volunteer some of these episodes before she is cross-examined.\n\nVentura testified that she once became enraged when she learned a woman took a photo of her while she was drunk at a birthday party in a bar. She found the woman at her car, she said, “pulled her out and … I was punching her in the head.”\n\nAdvertisement\n\nWhen asked by the government if she ever initiated a physical fight with Combs, Ventura said yes.\n\nIn one such incident, Ventura said she punched Combs in the face as hard as she could as they were riding in a Cadillac Escalade in Los Angeles. Afterward, she said Combs’s “whole demeanor” changed. “His eyes went black” and he attacked her, she alleged. Later, she said her face was “just knots and bleeding. Swollen everything.”\n\nFreak-offs lead Ventura to opiate abuse\n\nVentura said she had an “ongoing, off-and-on addiction to opiates,” which she used to “come down” from the drugs she had taken earlier during freak-offs. “Opiates made me feel numb, which is why I relied on them so heavily,” Ventura said.\n\nVentura testified that Combs would procure drugs like Vicodin, oxycodone and Percocet for her, sometimes using his employees to fill prescriptions. She would take opiates with or without him present, she said, until at one point she was using them daily. Ventura said she went to rehab in 2020.\n\nVentura talks about her relationship with Kid Cudi\n\nWhile on the stand, Ventura was asked about her previous relationship with rapper Kid Cudi, whose legal name is Scott Mescudi. The singer said she dated him for a brief period in 2011 during a break in her on-and-off relationship with Combs. According to her testimony, the producer found out about the pair after going through her phone during a freak-off in Los Angeles and lunged at her with a wine bottle opener.\n\nAdvertisement\n\nUpon arriving to her family’s home in Connecticut for the Christmas holidays that year, pictures were taken, showing bruises on her buttocks and upper right thigh — the result of a previous visit to Combs’s home to try to “resolve” the Mescudi issue, she said. Ventura said she told her mom about Combs’s physical violence — but not the freak-offs. She said she “couldn’t hurt her like that … I was also just terrified. It’s not normal.”\n\nVentura also discussed an alleged arson incident that she claimed Combs orchestrated against Mescudi. Her settled lawsuit accused Combs of threatening to blow up the rapper’s car during Paris Fashion Week in 2012. Around that time, Mescudi’s car exploded in his driveway, her lawsuit claimed. A spokeswoman for Mescudi told The New York Times, “This is all true.”"
        },
        {
            "id": "fa23328f8db0c2e93f7244b43d573bf7",
            "title": "Halle Berry Breaks the Cannes Dress Code With Stunning High-Low Bubble Dress - instyle.com",
            "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNbEk1dWtvWmtpRjBXbTdUaHpVanBadHJVWHppcHJpRWpqMWFubVlqUkZkSHIxRTRWOTN5allmMmpvblFtb0NhNHdHTWVMUW5LSlBEdUFudzJOSS0xZkQyYnpjWXZoanQ4eG8xUFhrM1Y5ZUF5RzlDZWhGZDRxNE9aV2xGV1VjOVJ5cTNQcQ?oc=5",
            "publishedAt": "2025-05-14T21:12:43Z",
            "urlToImage": null,
            "source": "Google News",
            "description": null,
            "content": null,
            "full_content": null
        },
        {
            "id": "0df2138a22cec67df66f0c2a7235276a",
            "title": "HBO Max is mocking itself with memes as Warner Bros. Discovery rolls out yet another rebrand - Business Insider",
            "url": "https://www.businessinsider.com/hbo-social-team-knows-rebrand-is-absurd-theyre-leaning-in-2025-5",
            "publishedAt": "2025-05-14T21:09:00Z",
            "urlToImage": "https://i.insider.com/682506783fe8d3928365e205?width=1200&format=jpeg",
            "source": "Business Insider",
            "description": "The social team at HBO Max probably knew it would be made fun of for backpedaling on its name, so it joined in on the roast.",
            "content": "The internet is making fun of Max for changing its name to HBO Max (for the second time). But no one is mocking the re-rebrand with as much gusto as Max itself.\r\nThe company is poking fun at the swit… [+2212 chars]",
            "full_content": "Warner Bros. Discovery distributed this meme to the media when it announced it was changing the name of its streaming service back to HBO Max.\n\nWarner Bros. Discovery distributed this meme to the media when it announced it was changing the name of its streaming service back to HBO Max. Warner Bros. Discovery\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThe internet is making fun of Max for changing its name to HBO Max (for the second time). But no one is mocking the re-rebrand with as much gusto as Max itself.\n\nThe company is poking fun at the switch by posting conclave references on TikTok, Harry Potter memes on Instagram, and teasing X on the social platform.\n\nThe self-deprecation is not limited to Max's main accounts. An Instagram page for the HBO show, \"Curb Your Enthusiasm,\" also chimed in, for example.\n\nMax's social team is going all out with the jokes because it probably knows that backpedaling to an earlier name is silly. It's much better to laugh with the internet than be laughed at.\n\n\"This is something where they were like, 'We're just going to get totally excoriated, so at least we can be in on the joke a little bit,'\" Jeremy Goldman, a senior director of client briefings at EMARKETER, told Business Insider.\n\nFor those not acquainted with the confusing name history of the Warner Bros. Discovery streaming service, Max has bounced around from \"HBO Go,\" to \"HBO Now,\" to \"HBO Max,\" then \"Max,\" and now back to \"HBO Max.\"\n\nThere were probably business reasons for each of the name changes that made sense in a boardroom, but the frequent switches have been confusing for the average consumer (my Roku remote still has an HBO Now button).\n\nWhile WBD put out a relatively straight press release today about the rebrand, the company distributed a meme to go along with it, as my colleague Peter Kafka, who dove into the business implications of the rebrand, pointed out.\n\nOn social media, the company went all in on silliness. There, being earnest is a recipe for mockery.\n\nIf you're posting to social and you've got something slightly embarrassing to say, such as that you are backtracking on an earlier rebrand, better to lean into humor and irreverence, knowing that the internet won't shy away from pointing out you're repeating yourself. (Full disclosure: I work at a company that also flipped back to its original name after attempting a rebrand.)\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nBudget airline Ryanair is particularly adept at making jokes at its own expense on social media. The company often posts viral TikTok videos that make fun of the trade-offs of its cheap flights, such as limited legroom or additional costs for some seats.\n\nSo kudos to Max for laughing at itself. Just please don't change your name again.\n\nWBD declined to comment on the social strategy."
        },
        {
            "id": "1ef73edc40beae282696a1d01209a953",
            "title": "Tom Cruise’s Crazy, Death-Defying Stunts Land 5-Minute Cannes Standing Ovation at ‘Mission Impossible – The Final Reckoning’ Premiere - Variety",
            "url": "https://variety.com/2025/film/festivals/tom-cruise-cannes-mission-impossible-final-reckoning-premiere-1236388364/",
            "publishedAt": "2025-05-14T20:07:00Z",
            "urlToImage": "https://variety.com/wp-content/uploads/2025/05/GettyImages-2215077477.jpg?w=1000&h=563&crop=1",
            "source": "Variety",
            "description": "Tom Cruise returned to Cannes three years after \"Top Gun Maverick\" to electrify the festival all over again with his final \"Mission: Impossible\" film.",
            "content": "Tom Cruise said goodbye to the “Mission: Impossible” franchise in electrifying fashion at the Cannes Film Festival, where “Mission: Impossible – The Final Reckoning” earned a five-minute ovation than… [+4282 chars]",
            "full_content": "Tom Cruise said goodbye to the “Mission: Impossible” franchise in electrifying fashion at the Cannes Film Festival, where “Mission: Impossible – The Final Reckoning” earned a five-minute ovation thanks in part to Cruise’s commitment to putting breathless and death-defying practical stunts on the big screen. The Cannes premiere was a massive event, with a 40-piece orchestra welcoming guests into the theater with the franchise’s iconic theme before the screening.\n\nThe audience lapped up the film’s special effects but the long run-time left some theatergoers bleary-eyed and exhausted. In the final stretch of the film, featuring death-defying acrobatics from Cruise, a handful of attendees got up and fled the Palais.\n\nThough Cruise’s willingness to risk his life for “Mission: Impossible” has been covered relentlessly, what the Cannes audience did not expect was how much he was willing to bare all.\n\nPopular on Variety\n\nThe 62-year-old survived a three-minute knife fight sequence on a submarine wearing only skimpy boxer briefs. The same was true for part of the film’s mind-blowing underwater sequence. Honestly? The view wasn’t bad at all for a movie star in the fourth decade of his career.\n\nDuring the standing ovation, Cruise clutched his heart and nodded gratefully, with both he and director Christopher McQuarrie kissing and thanking guests Zoe Saldaña and Marco Perego-Saldaña. As the clapping continued, the camera panned to each member of the large cast, including Simon Pegg, Angela Bassett and Hayley Atwell.\n\n“This response is why we do it. You are why we do it. The big screen experience is why we do it,” McQuarrie then said in a speech, which ended up being longer than the ovation itself. “Thank you all for being here and for supporting us. I want to thank this extraordinary cast — when I tell you how extraordinary they are, it wasn’t just showing up to work every day. This film was made during a pandemic and two industry strikes. These two films were made over a period of seven years with a lot of uncertainty, a lot of gaps in between their faith and their hard work, their dedication, their unquestioning devotion to this. This film would not be possible without the hard work of each and every one of these people standing up here. It’s the most extraordinary cast in the world.”\n\nOf Cruise, the director continued: “As a kid, I didn’t fit in and a lot of my life was imaginative play. I got to grow up and have my very own action figure.”\n\nMcQuarrie then passed the mic to Cruise. “To be here in Cannes and have these moments — I mean as a kid when we were growing up, I really can’t even dream of something like this happening,” he said. “I think McQ said it all, I’m just very grateful for 30 years to be able to entertain you with this franchise.”\n\nAddressing McQuarrie, the movie star said, “Grateful to you, my friend. Every step of the way what you’ve done and how you’ve expanded it — it just went beyond our expectations. I look forward to making a bunch of other kind of movies with you, I can’t wait.”\n\nCruise and Paramount are surely hoping “The Final Reckoning” follows in the footsteps of “Top Gun: Maverick,” which dazzled Cannes in 2022 and earned a five-minute standing ovation on its way $1.46 billion at the worldwide box office that summer. The “Top Gun” sequel’s Cannes premiere was an extravaganza complete with eight fighter jets flying over the Palais as Cruise and the cast walked down the red carpet. Cruise was also awarded a surprise Honorary Palme d’Or before the screening.\n\nWhether or not “The Final Reckoning” can match the box office highs of “Top Gun: Maverick” remains to be seen. Cruise’s last “Mission: Impossible” outing, 2023’s “Dead Reckoning Part One,” ended its run with a disappointing $571 million worldwide, a sharp decline from the $791 million that 2018’s “Fallout” earned. But one can never doubt Cruise’s ability to deliver a blockbuster.\n\nIn addition to Cruise, “The Final Reckoning” brings back franchise stalwarts like Simon Pegg and Ving Rhames. The cast also includes Hayley Atwell, Vanessa Kirby, Pom Klementieff, Henry Czerny, Angela Bassett and Rolf Saxon, all of whom appeared in previous “Mission: Impossible” installments. Newcomers to the series include Janet McTeer, Hannah Waddingham,and Nick Offerman. The film is directed by Christopher McQuarrie, who helmed three previous “Mission: Impossible” movies.\n\n“Mission: Impossible – The Final Reckoning” opens in theaters May 23 from Paramount Pictures."
        },
        {
            "id": "7966cb4dac7afe4c4620a10c9c5f3e1e",
            "title": "Bruce Springsteen Calls Donald Trump ‘Incompetent and Treasonous’ at 2025 Tour Kick-Off - Rolling Stone",
            "url": "http://www.rollingstone.com/music/music-news/bruce-springsteen-donald-trump-incompetent-treasonous-1235339576/",
            "publishedAt": "2025-05-14T20:03:14Z",
            "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2025/05/Springsteen-comment-trump.jpg?crop=0px%2C0px%2C1800px%2C1014px&resize=1600%2C900",
            "source": "Rolling Stone",
            "description": "At the kick-off show of his 2025 European tour, Bruce Springsteen delivered a fiery speech against Donald Trump.",
            "content": "Bruce Springsteen kicked off his 2025 Land of Hope and Dreams European tour Wednesday night at Co-op Live in Manchester, England, by delivering a fiery speech that railed against Donald Trump.\r\n“The … [+4302 chars]",
            "full_content": "Bruce Springsteen kicked off his 2025 Land of Hope and Dreams European tour tonight at Co-op Live in Manchester, England, by delivering a fiery speech that railed against Donald Trump.\n\n“The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock & roll, in dangerous times,” he told the crowd right after walking onto the stage. “In my home, the America I love, the America I’ve written about, and has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent, and treasonous administration. Tonight, we ask all who believe in democracy and the best of our American experience to rise with us, raise your voices against the authoritarianism, and let freedom ring. This is ‘Land of Hope and Dreams.'”\n\n\n\nSpringsteen is a passionate liberal who has campaigned for every Democratic candidate for president over the past two decades, and he’s made no effort to disguise his contempt for President Trump, but this is his most passionate denunciation of him to date.\n\nHammering the point home, he followed up “Land of Hope and Dreams” with “Death to My Hometown,” a politically charged song from his 2012 LP, Wrecking Ball, about how rapacious corporate greed contributed to the Great Recession of 2007-08.\n\nA bit later in the show, he performed “Rainmaker” from the 2020 album Letter to You for the first time in a concert setting. The song is a cautionary tale about how demagogues exploit desperate people by offering easy answers to their problems. “Rainmaker says white’s black and black’s white,” Springsteen sings. “Says night’s day and day’s night/Says close your eyes and go to sleep now/I’m in a burnin’ field unloadin’ buckshot into low clouds.”\n\nThe theme of economic desperation and dislocation continued later in the show with “My Hometown” (“Now Main Street’s whitewashed windows/And vacant stores”) and “Youngstown” (“Now the yards just scrap and rubble/He said, ‘Them big boys did what Hitler couldn’t do'”). Editor’s picks\n\nPrior to “My City of Ruins,” Springsteen paused to deliver another speech about the state of America. “There’s some very weird, strange, and dangerous shit going on out there,” he said. “In America, they are persecuting people for using their right to free speech and voicing their dissent. This is happening now. In America, the richest men are taking satisfaction in abandoning the world’s poorest children to sickness and death. This is happening now.”\n\nHe continued: “And in my country, they are taking sadistic pleasure in the pain that they inflict on loyal American workers, they are rolling back historic civil rights legislation that led to a more just and moral society. They are abandoning our great allies and siding with dictators against those struggling for their freedom. They are defunding American universities that won’t bow down to their ideological demands. They are removing residents off American streets and without due process of law, are deporting them to foreign detention centers and prisons. This is all happening now.\n\n“A majority of our elected representatives have failed to protect the American people from the abuses of an unfit president and a rogue government. They have no concern or idea for what it means to be deeply American. The America l’ve sung to you about for 50 years is real and regardless of its faults is a great country with a great people. So we’ll survive this moment. Now, I have hope, because I believe in the truth of what the great American writer James Baldwin said, he said, ‘In this world there isn’t as much humanity as one would like, but there’s enough.’ Let’s pray.” Related Content\n\nThis tour was initially seen as an additional leg of Springsteen and the E Street Band’s Letter to You run, which kicked off in early 2023. But it was renamed the Land of Hope and Dreams Tour earlier this month, and it is clearly tilting in a more political direction now that Trump is back in the White House.\n\nThe back half of the show stuck largely to classics like “Badlands,” “Thunder Road,” “Born to Run,” and “Bobby Jean.” But instead of wrapping with “I’ll See You In My Dreams” like last time, he opted for Bob Dylan’s 1964 classic “Chimes of Freedom.” He hadn’t played it since the 1988 Amnesty International Human Rights Now! Tour. Trending Stories Lorde: ‘I’m an Intense Bitch’ Kesha Is Horny and 'Boy Crazy' on Hyperpop Single Lorde Says She's 'In the Middle Gender-Wise': 'I'm a Woman Except When I’m a Man' Mexican Beauty Influencer Shot and Killed on TikTok Live\n\n“Thank you, Manchester, for a beautiful night,” he hold the crowd. “I’m always a little nervous on that first night. It takes a little getting used to, even after all this time. Take this home with you.”"
        },
        {
            "id": "ef6161eb72929b2d943e4e58a689d947",
            "title": "Blake Lively’s Lawyers Are Extorting Taylor Swift, Justin Baldoni Claims - The Hollywood Reporter",
            "url": "http://www.hollywoodreporter.com/news/general-news/blake-livelys-lawyers-extorting-taylor-swift-justin-baldoni-claims-1236217199/",
            "publishedAt": "2025-05-14T19:28:09Z",
            "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2025/02/GettyImages-2003747429-e1740096649155.jpg?w=819&h=460&crop=1",
            "source": "Hollywood Reporter",
            "description": "In a Wednesday letter to the court, lawyers for the 'It Ends With Us' director say that Lively's legal team threatened to release private text messages involving Swift. A lawyer for the actress denied the accusations.",
            "content": "Justin Baldoni‘s legal team is accusing Blake Lively‘s lawyers of trying to extort Taylor Swift, with the aim of getting the singer to issue a public statement in support of the It Ends With Us actre… [+2833 chars]",
            "full_content": "Justin Baldoni‘s legal team is accusing Blake Lively‘s lawyers of trying to extort Taylor Swift, with the aim of getting the singer to issue a public statement in support of the It Ends With Us actress.\n\nMichael Gottlieb, representing Lively, allegedly reached out to an attorney at the law firm, Venable, which represents the singer, and “demanded that Ms. Swift release a statement of support for Ms. Lively, intimating that, if Ms. Swift refused to do so, private text messages of a personal nature” in the actress’ possession would be made public, according to a letter filed in court on Wednesday by Bryan Freedman, a lawyer for Baldoni.\n\nIn the letter, Freedman says that a representative for Swift “addressed these inappropriate and apparently extortionate threats” in at least one written message to Lively’s legal team. He seeks those communications since they’d substantiate claims that Lively is intimidating and coercing witnesses in the sprawling legal battle. Additional details weren’t provided beyond an undisclosed source “highly likely to have reliable information.”\n\nGottlieb called the accusations “categorically false.” He added, “We unequivocally deny all of these so-called allegations, which are cowardly sourced to supposed anonymous sources, and completely untethered from reality. This is what we have come to expect from the Wayfarer parties’ lawyers, who appear to love nothing more than shooting first, without any evidence, and with no care for the people they are harming in the process. We will imminently file motions with the court to hold these attorneys accountable for their misconduct here.”\n\nThe filling comes days after Swift was subpoenaed by Baldoni’s legal team, which declined to comment for this story. Her involvement in the dueling lawsuits relates to an incident in which Lively invited the It Ends With Us director to her New York City home in 2023 to discuss changes to a rooftop scene at the beginning of the movie. Once there, Baldoni said he was ambushed by Lively’s husband, Ryan Reynolds, and close friend, Swift, according to the lawsuit, which cites communications that include the name “Taylor.” The megastars praised Lively’s version of the scene, allegedly pressuring Baldoni to accept the revisions.\n\nIn a text, Lively referred to Reynolds and Swift as her “dragons.” The message read, “If you ever get around to watching Game of Thrones, you’ll appreciate that I’m Khaleesi, and like her, I happen to have a few dragons. For better or worse, but usually better. Because my dragons also protect those I fight for.”\n\nVenable on Monday challenged the subpoena, arguing that the singer and firm don’t have any relevant information and that Baldoni only seeks to “distract from the facts of the case.” Lively and Reynolds supported the firm’s bid to void the subpoena.\n\nIn Wednesday’s filing, Freedman says that he expects to resolve the issue with Venable shortly since the two sides are negotiating in good faith.\n\nSwift didn’t immediately respond to requests for comment."
        },
        {
            "id": "3f09e48c95b10bdae6d495affec9d6b7",
            "title": "AP PHOTOS: A look at the second day of the Cannes Film Festival - AP News",
            "url": "https://apnews.com/article/cannes-film-festival-photos-mission-impossible-b522af22739995ed60f4ffcdeb788fae",
            "publishedAt": "2025-05-14T19:13:00Z",
            "urlToImage": "https://dims.apnews.com/dims4/default/39a0fc4/2147483647/strip/true/crop/8091x4551+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F0a%2F12188b1d60d669938957f6871712%2F6b2b6c9216e74a47b36a4000f31fd6ae",
            "source": "Associated Press",
            "description": "CANNES, France (AP) — Much of the cinema world has descended on the Cannes Film Festival as the French Riviera extravaganza kicks off its 78th edition.",
            "content": "Greg Tarzan Davis, from left, editor Eddie Hamilton, Angela Bassett, Tramell Tillman, Tom Cruise, director Christopher McQuarrie, Hannah Waddingham, Simon Pegg, Esai Morales, and Pom Klementieff take… [+221 chars]",
            "full_content": "CANNES, France (AP) — Much of the cinema world has descended on the Cannes Film Festival as the French Riviera extravaganza kicks off its 78th edition.\n\nThree years after flying into the Cannes Film Festival with “Top Gun: Maverick,” Tom Cruise returned to the Croisette on Wednesday with “Mission: Impossible — Final Reckoning.”\n\nZoe Saldana poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (AP Photo/Natacha Pisarenko) Zoe Saldana poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (AP Photo/Natacha Pisarenko) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nTramell Tillman, from left, director Christopher McQuarrie, Hannah Waddingham, and Angela Bassett take a selfie upon arrival for the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Joel C Ryan/Invision/AP) Tramell Tillman, from left, director Christopher McQuarrie, Hannah Waddingham, and Angela Bassett take a selfie upon arrival for the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Joel C Ryan/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nHalle Berry poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Halle Berry poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nAndie MacDowell poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Andie MacDowell poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nEva Longoria poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Eva Longoria poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nCuba Gooding Jr. poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Cuba Gooding Jr. poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nPom Klementieff poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Pom Klementieff poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nHayley Atwell, left, and Tom Cruise pose for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Hayley Atwell, left, and Tom Cruise pose for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nTom Cruise poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Tom Cruise poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nChloe Lecareux poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Chloe Lecareux poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nTom Cruise poses for photographers during the photo call for the film ‘Mission: Impossible – The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Tom Cruise poses for photographers during the photo call for the film ‘Mission: Impossible – The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nDirector Christopher McQuarrie poses for photographers during the photo call for the film ‘Mission: Impossible – The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Director Christopher McQuarrie poses for photographers during the photo call for the film ‘Mission: Impossible – The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nDirector Mascha Schilinski poses for photographers upon arrival at the premiere of the film ‘Sound of Falling’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Director Mascha Schilinski poses for photographers upon arrival at the premiere of the film ‘Sound of Falling’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nAissa Maiga, from left, Mohamed Grayaa, Toure Blamassi, Foued Zaazaa, Deborah Christelle Lobe Naney, Laetitia Ky and Didar Domehri pose for photographers at the photo call for the film ‘Promised Sky’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Joel C Ryan/Invision/AP) Aissa Maiga, from left, Mohamed Grayaa, Toure Blamassi, Foued Zaazaa, Deborah Christelle Lobe Naney, Laetitia Ky and Didar Domehri pose for photographers at the photo call for the film ‘Promised Sky’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Joel C Ryan/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nJury president Alice Rohrwacher poses for photographers at the photo call for the Camera d’Or jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Jury president Alice Rohrwacher poses for photographers at the photo call for the Camera d’Or jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nJury president Molly Manning Walker, centre, and jury members Nahuel Perez Biscayart, from left, Vanja Kaludjercic, Louise Courvoisier, and Roberto Minervini pose for photographers at the photo call for the Un Certain Regard jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Jury president Molly Manning Walker, centre, and jury members Nahuel Perez Biscayart, from left, Vanja Kaludjercic, Louise Courvoisier, and Roberto Minervini pose for photographers at the photo call for the Un Certain Regard jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nJury president Molly Manning Walker poses for photographers at the photo call for the Un Certain Regard jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Jury president Molly Manning Walker poses for photographers at the photo call for the Un Certain Regard jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nThis gallery features daily highlights from the festival, curated by Associated Press photo editors.\n\n___\n\nFor more coverage of the 2025 Cannes Film Festival, visit https://apnews.com/hub/cannes-film-festival."
        }
    ]
}