{
    "status": "ok",
    "totalResults": 38,
    "category": "business",
    "country": "us",
    "timestamp": "2025-05-19 14:30:15",
    "articles": [
        {
            "id": "bfa0a73fc7aa763652aa6553398a41d4",
            "title": "Nvidia seeks to build its business beyond Big Tech - Financial Times",
            "url": "https://www.ft.com/content/2ba1d064-242d-4a2a-a381-374d9643e23a",
            "publishedAt": "2025-05-18T04:01:41Z",
            "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F8d38d397-d842-4aa5-8b3a-fc2300aaf091.jpg?source=next-barrier-page",
            "source": "Financial Times",
            "description": "Chipmaker establishes ties with nation states and ‘neoclouds’ in effort to reduce reliance on Microsoft, Amazon and Google",
            "content": "Complete digital access to quality analysis and expert insights, complemented with our award-winning Weekend Print edition.\r\n<ul><li></li>Everything in Print<li></li>Weekday Print Edition<li></li>FT … [+202 chars]",
            "full_content": "Try unlimited access Only Rs100 for 4 weeks\n\nThen Rs4335 per month. Complete digital access to quality FT journalism on any device. Cancel anytime during your trial."
        },
        {
            "id": "13f47e53b6d59ef2b68dfe41866041c8",
            "title": "FDA approves Novavax COVID-19 shot but with unusual restrictions - AP News",
            "url": "https://apnews.com/article/novavax-covid19-vaccine-fda-a477c1aa612ceb293e70d904b46611b0",
            "publishedAt": "2025-05-18T02:21:00Z",
            "urlToImage": "https://dims.apnews.com/dims4/default/877d8cb/2147483647/strip/true/crop/4959x2789+0+258/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F18%2Fa071c1a2e9c2e25a5d5a31f70451%2Fbb1f9522401d46799998e0a09444a3b9",
            "source": "Associated Press",
            "description": "The Food and Drug Administration has approved Novavax's COVID-19 vaccine but with unusual restrictions. Novavax makes the nation's only traditional protein-based coronavirus vaccine and while it has long been authorized for use, it had expected full approval …",
            "content": "WASHINGTON (AP) The Food and Drug Administration has issued a long-awaited approval of Novavaxs COVID-19 vaccine but with unusual restrictions.\r\nNovavax makes the nations only traditional protein-bas… [+2479 chars]",
            "full_content": "WASHINGTON (AP) — The Food and Drug Administration has issued a long-awaited approval of Novavax’s COVID-19 vaccine but with unusual restrictions.\n\nNovavax makes the nation’s only traditional protein-based coronavirus vaccine – and until now it had emergency authorization from FDA for use in anyone 12 and older.\n\nBut late Friday, the FDA granted the company full approval for its vaccine for use only in adults 65 and older – or those 12 to 64 who have at least one health problem that puts them at increased risk from COVID-19.\n\nVaccines made by Novavax’s competitors Pfizer and Moderna already are fully licensed for use in anyone 12 and older, and also are authorized for use in children as young as 6 months.\n\nNext month, influential advisers to the Centers for Disease Control and Prevention were set to debate if yearly COVID vaccines still should be recommended for everyone or only certain people at higher risk. The Novavax decision suggests the Trump administration may already have decided how to proceed in advance of that meeting.\n\nNovavax chief executive John C. Jacobs welcomed the licensure.\n\n“Market research and U.S. CDC statistics indicate that older individuals and those with underlying conditions are the populations most likely to seek out COVID-19 vaccination seasonally. This significant milestone demonstrates our commitment to these populations and is a significant step towards availability of our protein-based vaccine option,” he said.\n\nIn its Friday approval letter, the FDA didn’t explain the restrictions although they reflect skepticism about vaccines from Health Secretary Robert F. Kennedy Jr. and other Trump officials.\n\nNovavax originally showed its vaccine was safe and effective in a 30,000-person clinical trial. The FDA had been on track to grant Novavax full approval – without restrictions -- by its April 1 target date, according to two people with direct knowledge of the situation who spoke on condition of anonymity to discuss confidential agency matters.\n\nNovavax later announced the FDA instead was asking it to run an additional trial after approval, which is highly unusual. FDA did order several additional trials to be completed in the next few years, some examining whether the vaccine might be associated with some heart conditions. Another required study must assess the benefits of continuing vaccination in 50- to 64-year-olds who don’t have health problems that increase their risk from COVID-19.\n\n—-\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content."
        },
        {
            "id": "95bf1035eb03bc81bf2ac1179ab69f71",
            "title": "Spectrum down in Kansas City due to cut fiber lines, provider says - FOX4KC.com",
            "url": "https://fox4kc.com/news/spectrum-down-in-kansas-city-due-to-cut-fiber-lines-provider-says/",
            "publishedAt": "2025-05-18T01:31:19Z",
            "urlToImage": "https://fox4kc.com/wp-content/uploads/sites/16/2022/05/000_macbook-vs-surface-go-839a26-2.jpg?w=1280",
            "source": "WDAF FOX4 Kansas City",
            "description": "If you’re a Spectrum customer in the Kansas City Metro, you’ve likely been without services for the better part of today, May 17.",
            "content": "KANSAS CITY, Mo. — If you’re a Spectrum customer in the Kansas City Metro, you’ve likely been without services for the better part of today, May 17.\r\nSpectrum says that’s due to two separate fiber li… [+1094 chars]",
            "full_content": "KANSAS CITY, Mo. — If you’re a Spectrum customer in the Kansas City Metro, you’ve likely been without services for the better part of today, May 17.\r\nSpectrum says that’s due to two separate fiber li… [+1094 chars]"
        },
        {
            "id": "771fc93575e1a5fcd08a9ae898f30f4d",
            "title": "Rail strike latest: NJ Transit, BLET chairman agree that talks are ‘moving in the right direction’ - News 12 - New Jersey",
            "url": "https://newjersey.news12.com/nj-transit-ceo-says-deal-in-engineer-strike-is-close-sides-meet-at-1-pm",
            "publishedAt": "2025-05-17T21:56:15Z",
            "urlToImage": "https://images-cf.news12static.com/3kqcuzntcg31/3JEAZEauzekwwyOYvO6vhK/0c08ebcbc913ec13a2214cd5b0583993/8ad1143a-0918-4aa3-ab58-3fb7f7ffb534.jpg?fit=thumb&w=600&h=340&q=80&fm=webp",
            "source": "News12.com",
            "description": "Four hundred engineers and trainees stepped off the job and on to the picket line on Friday in the hopes of receiving better pay.",
            "content": "Topics you care about, straight to your inbox",
            "full_content": "NJ Transit President and CEO Kris Kolluri says Saturday’s negotiations with the rail engineers union on Day 2 of the rail strike were “constructive.”\n\nHe issued a statement Saturday afternoon:\n\n\"Today's discussions continued to be constructive. We've mutually agreed to adjourn formal discussions for the day but will continue talking and look forward to resuming discussions tomorrow.\"\n\nAs union representatives left Saturday's meeting, News 12 caught up with B.L.E.T. General Chairman Tom Haas, who said he feels optimistic moving ahead.\n\n\"…We're sitting down and talking, we're moving in the right direction,\" Haas said.\n\nHaas echoed Kolluri's statement that they are \"about 95% of the way there,\" but said it has been that way for the last two years.\n\n\"It's just these last few issues that have been so difficult to work out,\" Haas said.\n\nThe National Mediation Board will get involved again Sunday as roughly 350,000 daily riders are affected by the rail strike.\n\n\"We want to be back at work. We want to be running the trains. My guys would like nothing more than to be at work and not out here,\" Haas said."
        },
        {
            "id": "d5efdbc011a9332abde56c9a396ba761",
            "title": "Nearly 18,000 containers of ice cream recalled for potential plastic contamination - NBC News",
            "url": "https://www.nbcnews.com/news/us-news/ice-cream-recalled-plastic-rcna207471",
            "publishedAt": "2025-05-17T21:39:27Z",
            "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250517-ice-cream-ch-1613-0dad1e.jpg",
            "source": "NBC News",
            "description": "Wells Enterprises, the company that produces the Blue Bunny and Halo Top ice cream brands, has recalled nearly 18,000 containers of ice cream and frozen yogurt due to batches possibly containing pieces of plastic.",
            "content": "Wells Enterprises, the company that produces the Blue Bunny and Halo Top ice cream brands, has recalled nearly 18,000 containers of ice cream and frozen yogurt due to batches possibly containing piec… [+798 chars]",
            "full_content": "Wells Enterprises, the company that produces the Blue Bunny and Halo Top ice cream brands, has recalled nearly 18,000 containers of ice cream and frozen yogurt due to batches possibly containing pieces of plastic.\n\nThe Iowa-based company issued the voluntary recall on April 25, according to a Food and Drug Administration report released earlier this week, NBC Dallas-Fort Worth reported.\n\nThe recall includes 22 flavors sold in 3-gallon tubs, sent to more than 100 distribution centers across the U.S., including locations in Iowa, Michigan, Illinois and Texas. The products have “use by” dates ranging from March 2026 through October 2026.\n\nThe FDA categorized the recall as Class II, meaning consumption of the product can cause “temporary or medically reversible adverse health consequences,” according to the FDA website.\n\nWells Enterprises did not immediately respond to NBC News’ request for comment.\n\nA full list of recalled products with identifying information can be found in the FDA report."
        },
        {
            "id": "32c75be0e18f800f49e2554ea1de3b0b",
            "title": "Moody's downgrades US credit rating due to rising debt - Cointelegraph",
            "url": "https://cointelegraph.com/news/moodys-downgrades-us-credit-rating",
            "publishedAt": "2025-05-17T20:41:20Z",
            "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-05/0196df9d-2893-760b-bb3d-327fbd565418",
            "source": "Cointelegraph",
            "description": "Moody's, a credit rating agency, has downgraded the creditworthiness of the US government, citing high debt and a lack of fiscal responsibility.",
            "content": "Moody's credit rating agency downgraded the credit rating of the United States government from Aaa to Aa1, citing the rising national debt as the primary driver behind the reduction in creditworthine… [+2599 chars]",
            "full_content": "Moody's credit rating agency downgraded the credit rating of the United States government from Aaa to Aa1, citing the rising national debt as the primary driver behind the reduction in creditworthiness.\n\nAccording to the May 16 announcement from the rating agency, US lawmakers have failed to stem annual deficits or reduce spending over the years, leading to a growing national debt. The rating agency wrote:\n\n\"We do not believe that material multi-year reductions in mandatory spending and deficits will result from the current fiscal proposals under consideration. Over the next decade, we expect larger deficits as entitlement spending rises while government revenue remains broadly flat.\"\n\nThe credit downgrade is only one degree out of the 21-notch rating scale used by the company to assess the credit health of an entity.\n\nAn overview of the US national debt. Source: US National Debt Clock\n\nDespite the negative short to medium-term credit outlook, Moody's maintained a positive outlook on the long-term health of the United States, citing its robust economy and the status of the US dollar as the global reserve currency as strengths, reflecting \"balanced\" lending risks.\n\nRelated: Asia’s wealthy shifting from US dollar to crypto, gold, China: UBS\n\nInvestors react to Moody's US credit revision\n\nMoody's announcement drew mixed reactions from investors and market participants, leaving many unconvinced by the agency's revised outlook.\n\nGabor Gurbacs, CEO and founder of crypto loyalty rewards company Pointsville, cited the rating agency's previous credit assessments during times of financial stress as unreliable, signaling that the outlook was too optimistic.\n\n\"This is the same Moody’s that gave Aaa ratings to sub-prime mortgage-backed securities that led to the 2007-2008 financial crisis,\" the executive wrote in a May 17 X post.\n\nHowever, macroeconomic investor Jim Bianco argued that the recent Moody's credit outlook does not reflect a real downgrade in the perception of US government creditworthiness and characterized the announcement as a \"nothing burger.\"\n\nInterest rates on the 30-year US Treasury Bond spiked to nearly 5% in May 2025, signaling reduced long-term investor confidence in US debt. Source: TradingView\n\nUS government debt surpassed $36 trillion in January 2025 and shows no signs of slowing, despite recent efforts by Elon Musk and others to reduce federal spending and curtail the national debt.\n\nAs the debt climbs and investors lose faith in US government securities, bond yields will spike, causing the debt service payments to go up, further inflating the national debt.\n\nThis creates a vicious cycle as the government will have to entice investors with ever-greater yields to incentivize them to purchase government debt.\n\nMagazine: Elon Musk’s plan to run government on blockchain faces uphill battle"
        },
        {
            "id": "4effa1dc175f6fd3220bc1503ac4c8f6",
            "title": "Behind Microsoft Layoffs, Automation Efforts Boom - The Information",
            "url": "https://www.theinformation.com/articles/behind-microsoft-layoffs-automation-efforts-boom",
            "publishedAt": "2025-05-17T20:29:00Z",
            "urlToImage": "https://tii.imgix.net/production/articles/15060/1431785c-1d2e-4e7a-962c-2632a8a3b5b7.jpg?fm=jpg&auto=compress&w=1200&frame=0",
            "source": "The Information",
            "description": "Jeff Hulse, a Microsoft vice president who oversees roughly 400 software engineers, told the team in recent months to use the company’s artificial intelligence chatbot, powered by OpenAI, to generate half the computer code they write, according to a person wh…",
            "content": null,
            "full_content": null
        },
        {
            "id": "266f129b4689dfb6373ee20fe815c8ef",
            "title": "MIT disavows doctoral student paper on AI’s productivity benefits - TechCrunch",
            "url": "https://techcrunch.com/2025/05/17/mit-disavows-doctoral-students-paper-on-ai-productivity-benefits/",
            "publishedAt": "2025-05-17T19:30:00Z",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/07/GettyImages-1497617145-1.jpg?resize=1200,800",
            "source": "TechCrunch",
            "description": "MIT says that due to concerns about the “integrity” of a high-profile paper about the effects of artificial intelligence on research and innovation, the",
            "content": "MIT says that due to concerns about the integrity of a high-profile paper about the effects of artificial intelligence on research and innovation, the paper should be withdrawn from public discourse.… [+1851 chars]",
            "full_content": "MIT says that due to concerns about the “integrity” of a high-profile paper about the effects of artificial intelligence on research and innovation, the paper should be “withdrawn from public discourse.”\n\nThe paper in question, “Artificial Intelligence, Scientific Discovery, and Product Innovation,” was written by a doctoral student in the university’s economics program. It claimed to show that the introduction of an AI tool into a large-but-unidentified materials science lab led to the discovery of more materials and more patent filings, but at the cost of reducing researchers’ satisfaction with their work.\n\nMIT economists Daron Acemoglu (who recently won the Nobel Prize) and David Autor both praised the paper last year, with Autor telling the Wall Street Journal he was “floored.” In a statement included in MIT’s announcement on Friday, Acemoglu and Autor described the paper as “already known and discussed extensively in the literature on AI and science, even though it has not been published in any refereed journal.”\n\nHowever, the two economists said they now have “no confidence in the provenance, reliability or validity of the data and in the veracity of the research.”\n\nAccording to the WSJ, a computer scientist with experience in materials science approached Acemoglu and Autor with concerns in January. They brought those concerns to MIT, leading to an internal review.\n\nMIT says that due to student privacy laws, it cannot disclose the results of that review, but the paper’s author is “no longer at MIT.” And while the university’s announcement does not name the author, both a preprint version of the paper and the initial press coverage identify him as Aidan Toner-Rodgers. (TechCrunch has reached out to Toner-Rodgers for comment.)\n\nMIT also says it has requested the paper be withdrawn from The Quarterly Journal of Economics, where it was submitted for publication, and from the preprint website arXiv. Apparently, only a paper’s authors are supposed to submit arXiv withdrawal requests, but MIT says “to date, the author has not done so.”"
        },
        {
            "id": "154003a0d763aac13fd7ffb8f4e1d5e7",
            "title": "TechCrunch Week in Review: Coinbase gets hacked - TechCrunch",
            "url": "https://techcrunch.com/2025/05/17/techcrunch-week-in-review-coinbase-gets-hacked/",
            "publishedAt": "2025-05-17T17:06:00Z",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/04/GettyImages-1304243736.jpeg?resize=1200,718",
            "source": "TechCrunch",
            "description": "Welcome back to Week in Review! We've got tons of news for you this week, including a hack at Coinbase; YC thinks Google is a ‘monopolist’; layoffs at",
            "content": "Welcome back to Week in Review! We’ve got tons of news for you this week, including a hack at Coinbase; YC thinks Google is a monopolist; layoffs at Microsoft; and much more. Have a great weekend!\r\nU… [+3937 chars]",
            "full_content": "Welcome back to Week in Review! We’ve got tons of news for you this week, including a hack at Coinbase; YC thinks Google is a ‘monopolist’; layoffs at Microsoft; and much more. Have a great weekend!\n\nUh-oh: Coinbase says that customers’ personal information, including government-issued IDs, was stolen in a data breach. The hackers demanded $20 million from the company, CEO Brian Armstrong said in a post on X. Coinbase said it will not pay the hackers’ ransom.\n\nIPO time, baby: After filing confidentially in December, Chime filed for an IPO this week. There are a ton of blanks in the S-1, so we didn’t get much information, like how many shares insiders plan to sell as part of the IPO. But we did learn one tidbit: Chime entered a deal with the Dallas Mavericks in 2018, which gained it the Chime logo on the team’s jersey, among other marketing benefits.\n\nKnock on wood: This story has been popping off all week — InventWood created wood called “Superwood” that’s as strong as steel. Ultimately, InventWood is planning to use wood chips to create structural beams of any dimension that won’t need finishing.\n\nThis is TechCrunch’s Week in Review, where we recap the week’s biggest news. Want this delivered as a newsletter to your inbox every Saturday? Sign up here.\n\nNews\n\nImage Credits:Granola\n\nA big bowl of Granola: VCs and founders love talking up the apps they’re using. The most recent case: Granola, an AI note-taking app that’s recently seen a boost in usage, even though it launched a year ago. And when there’s usage, money follows. The company announced it has raised $43 million in a Series B funding round at a valuation of $250 million.\n\nChoice words: “Google has chilled independent firms like YC from funding and accelerating innovative startups that could otherwise have challenged Google’s dominance,” YC wrote in an amicus brief it submitted in the U.S.’ antitrust case against the search giant. But YC isn’t calling for a complete breakup of Google.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nLove to see it: Apple announced a bunch of accessibility features, including Accessibility Nutrition Labels that will inform users of accessibility features within apps and games in the App Store; a new magnifier for Macs; a new Braille experience; and more.\n\nLayoffs at Microsoft: The company is reportedly laying off 3% of its workforce, or around 6,500 people, affecting all levels, locations, and teams. This follows a solid quarter for Microsoft, with $70.1 billion in revenue (up 13%) and net income profits of $25.8 billion (up 28%). In Washington, around 40% of the 2,000 people laid off were engineers.\n\nGemini in your car: At the Android Show — Google’s Android-only event a week ahead of Google I/O — the company announced that it’s bringing Gemini to cars that support Android Auto. Drivers (and passengers) will be able to send texts, play music, and all the other things a smart assistant does, but using natural language.\n\nLOL: What once was called HBO Go before it changed its name to HBO Now, which later became HBO Max, before settling on Max, announced this week that it’s once again changing its name back to HBO Max.\n\nJust call it a bus: Uber is introducing Route Share, a commuter shuttle service that will pick up passengers at pre-set stops in 20-minute intervals. “You can see a natural extension of us being able to bring Route Share to autonomous vehicles as well,” Sachin Kansal, Uber’s chief product officer, told us.\n\nWait, what? The New York Times spoke with two investors who said they were pitched a new startup that aims to deliver “human health optimization” using blood testing. Sound familiar? But wait till you hear who pitched the startup: Theranos founder Elizabeth Holmes’ partner, Billy Evans. Maybe it’ll work out better this time?\n\nAnalysis\n\nImage Credits:Uber\n\nAnd speaking of Uber: In 2022, senior reporter Rebecca Bellan wrote an article titled “The Amazonification of Uber” about how the company was becoming more of a closed loop to keep customers engaged. Now the company is taking it a step further, introducing Uber One Member Days, a week of discounts designed to boost its subscription program and expand its role beyond transportation."
        },
        {
            "id": "d5bb5d024d4b45380a700224cf04b115",
            "title": "REI’s anniversary sale is dropping prices on Garmins and other great outdoor gear - The Verge",
            "url": "https://www.theverge.com/tech/668088/rei-anniversary-sale-2025-garmin-watch-inreach-stoves-water-filters-deal-sale",
            "publishedAt": "2025-05-17T15:36:00Z",
            "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24483620/236554_Garmin_Forerunner_265S_AKrales_0072.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
            "source": "The Verge",
            "description": "REI’s anniversary sale includes deals on a number of our favorite outdoor gadgets, including Garmin watches, the InReach Mini 2, LifeStraw filters, and more.",
            "content": "You can save up to 30 percent on a ton of outdoor essentials, from smartwatches to stoves.\r\nYou can save up to 30 percent on a ton of outdoor essentials, from smartwatches to stoves.\r\nJust in time to… [+9448 chars]",
            "full_content": "If you want a straightforward stove that gets the job done,is a good option that’s available for around $97 ($33 off) from Coleman and REI . The compact stove is pretty basic, but it offers everything you need for simple, reliable camp cooking. It’s got enough cooking power to handle most meals and two burners, so you can cook multiple things at once. It also features a matchless push-button igniter, along with built-in wind guards for better flame control and adjustable heat knobs for more precise cooking. It’s easy to carry and set up as well, with a durable steel cooktop and a removable chrome-plated grate for easy cleanup."
        }
    ]
}