{
    "status": "ok",
    "totalResults": 44,
    "category": "sports",
    "country": "us",
    "timestamp": "2025-05-16 14:44:35",
    "articles": [
        {
            "id": "b77f0d7183e86c2abe980f7ba798bbb8",
            "title": "Celtics-Knicks: 5 takeaways as defending champions keep season alive - NBA",
            "url": "https://www.nba.com/news/celtics-knicks-takeaways-game-5-2025-nba-playoffs",
            "publishedAt": "2025-05-15T05:51:34Z",
            "urlToImage": "https://cdn.nba.com/manage/2025/05/jaylen-brown-dribble.jpg",
            "source": "Heat.com",
            "description": "Reeling from the loss of Jayson Tatum, Boston shows championship mettle in dominating New York to force Game 6.",
            "content": "Boston survives a gut check in Game 5. Can they do it again to force a decisive Game 7?\r\nThe defending champs are still alive.\r\nFacing elimination for the first time in two years and missing their be… [+8587 chars]",
            "full_content": "The defending champs are still alive.\n\nFacing elimination for the first time in two years and missing their best player, the Boston Celtics responded with a huge second half in Game 5 of the Eastern Conference semifinals, torching the New York Knicks’ defense and cruising to a 127-102 victory on Wednesday.\n\nWith Jayson Tatum having suffered a torn right Achilles tendon late in Game 4 and Kristaps Porziņģis continuing to suffer the effects of an undisclosed illness, the Celtics needed multiple players to step up and save their season. They got just that, with Derrick White scoring 34 points, Jaylen Brown dishing out a career-high 12 assists and Luke Kornet blocking a career-high seven shots.\n\nThe Knicks are still up 3-2 and will have a second chance to close the series out at Madison Square Garden on Friday (8 ET, ESPN), but they’ve now been outscored by 35 points over the five games.\n\nHere are some notes, quotes, numbers and film as the Knicks suffered their first road loss of the playoffs.\n\n1. Celtics come out of the half on fire\n\nThough they had a positive point differential overall over the first four games of this series, the Celtics had been outscored by 51 points (25.7 per 100 possessions) after halftime. They’d scored an ultra-efficient 128.4 points per 100 over 96 first-half minutes, but an anemic 94.7 per 100 over 101 second-half and overtime minutes, with the Knicks coming back from at least 14 points down in all three of their wins.\n\nGame 5 was the first time that the Celtics didn’t lead by at least nine points at halftime; the score was tied at 59. It was also the first time that Boston didn’t struggle offensively in the second half.\n\nIt did just the opposite. The Celtics scored an amazing 22 points on their first nine possessions of the third quarter, turning a tie game into a 13-point lead they would continue to build upon.\n\nThey actually missed three free throws in that stretch, but shot 5-for-6 from the field, including 3-for-3 from 3-point range. And those three misses came on 12 attempts from the line over those nine possessions.\n\nThe Celtics got four points on their very first possession of the third period, with both Jrue Holiday and Brown bullying Jalen Brunson in the paint, with an offensive rebound on Holiday’s missed free throw in between.\n\nThen the Celtics were able to get out in transition, even after made buckets on the other end of the floor.\n\nAfter a Josh Hart 3 for the Knicks, the Celtics got the ball up the floor quickly and Al Horford got it back to a trailing White, who was already 5-for-9 from 3-point range at that point. The Knicks failed to find him in transition and he drained another 3 to put the Celtics up six …\n\nA few possessions later, White had another transition 3 as the Celtics stayed hot.\n\nTransition points on Wednesday, according to Synergy tracking, were 31-9 in favor of the Celtics, who have scored 80 points on 52 transition possessions (1.54 per) over the past three games.\n\n2. Kornet steps up with Porziņģis unable to go\n\nThough Porziņģis has been struggling, he was on the floor for most of the fourth quarter in Game 4 and Kornet had averaged only 13.1 minutes through the first four games. It seemed that his primary job in this series was to foul Mitchell Robinson.\n\nWith Tatum out on Wednesday, Porziņģis got his first start since Game 1. But at the start of the third quarter, he couldn’t go.\n\n“He couldn’t breathe,” Celtics coach Joe Mazzulla said afterward. “He was available [only] if absolutely necessary.”\n\nIt wasn’t necessary, even though Horford picked up his fourth foul less than two minutes into the second half. It wasn’t necessary because Kornet was terrific. He logged 25 minutes and 38 seconds, the most he’s played in 42 career playoff games. He scored 10 points, grabbed nine rebounds and blocked seven shots.\n\n“He came in and seemed to always be in the right position,” White said of Kornet. “Seven blocks is crazy. He was unbelievable tonight and really stepped up when we needed him.”\n\nFive of those seven blocks came in the game-changing third quarter. The first of those third-quarter blocks came at the end of a terrific defensive possession for the Celtics’ third big man.\n\nThe Knicks ran a “Spain” pick-and-roll, with Hart setting a ball screen for Brunson and OG Anunoby, then setting a back screen on Kornet. But Kornet saw the back screen coming and was able to avoid getting taken out of the play. Hart was open, but hesitated beyond the arc and Kornet was able to stay down and stay in front of his drive.\n\nTowns had Jrue Holiday sealed under the basket, but Kornet recovered and denied his shot …\n\nThe real highlight came midway through the fourth quarter, when another big offensive run had the Celtics up 23. They ran their own Spain pick-and-roll, Towns got caught in the back screen, and Kornet rolled free to the basket for a reverse alley-oop dunk …\n\nThe seven blocks stood out, but the Celtics have also been at their best offensively in this series (124.7 points scored per 100 possessions) in Kornet’s 78 minutes on the floor.\n\n3. Brown takes on new roles\n\nBrown wasn’t trying to make up for Tatum’s scoring by himself. The first change we saw from Brown was on defense, where he (instead of Holiday or White) was guarding Brunson from the opening tip.\n\nThe Celtics’ defense against the Knicks’ star is about more than just the man guarding him to start possessions, but Brown and his additional length clearly made an impact, with Brunson scoring just 22 points (7-17 FGs) after torching the Celtics for 39 in Game 4.\n\nThe Knicks set 41 ball screens for Brunson, but Brown wasn’t giving up the switch easily. On that same third-quarter possession where Kornet blocked Towns (illustrated above), Brown navigated Hart’s ball screen well enough to prevent Brunson from stepping into a pull-up jumper.\n\n“My goal was just to stay between him and the basket,” Brown said. “I feel like I can guard with the best of them.”\n\nOn offense, Brown had almost as many assists (12) as he had through the first four games (13). He didn’t force any tough shots and, instead, made the right reads when he gained advantages.\n\nAnd the defensive assignment yielded some of those advantages on offense. Because Brown was guarding Brunson, the Knicks guard sometimes got caught guarding Brown in transition.\n\nThat was the case midway through the first quarter, when Brown took Brunson into the post. He spun into the paint, drew two more defenders and made a terrific wraparound pass to Kornet for a layup …\n\nWhen asked what his job is with Tatum out, Brown responded, “Get it done in multiple ways … Whatever is needed, I’m excited to facilitate in whatever role.”\n\n4. Celtics dominate from deep\n\nThe Orlando Magic were the worst 3-point shooting team in the league this season, and the Celtics outscored them by 54 points from beyond the arc over their five-game, first-round series.\n\nThrough five games in this series, the Celtics have outscored the Knicks by 90 points from 3-point range. The Knicks made one more 3-pointer than Boston over the first two games, but the Celtics have made 31 more over the last three.\n\nThe Celtics, of course, set an NBA record this season by taking 53.6% of their shots from beyond the arc. Orlando was able to limit their 3-point attempts in the first round, but they’ve been launching early and often in this series. Games 1, 4 and 5 account for three of the four times in these playoffs that a team has taken at least 58% of its shots from 3-point range.\n\nBad shots will arise when you take that many 3-pointers, and there were certainly some bad ones as the Celtics blew 20-point leads in Games 1 and 2.\n\nBut almost all of their 49 attempts on Wednesday were good looks generated by pace and ball movement, and the math has worked out over the past three games. It’s been one of the Celtics’ best three-game stretches of offense (129.6 points scored per 100 possessions) this season.\n\n5. One down, two to go?\n\nWith the Minnesota Timberwolves closing out the Golden State Warriors on Wednesday, teams that have trailed 3-1 in a best-of-seven have rallied to win the series just 13 times (4.4%) in 295 opportunities. That means the odds are still certainly against the Celtics.\n\nBut the champs have shown that, even without their best player, they’re capable of beating the Knicks on any given night.\n\n“We just have to win one game,” Mazzulla said, “and take it from there.”\n\n* * *\n\nJohn Schuhmann is a senior stats analyst for NBA.com. You can e-mail him here, find his archive here and follow him on X.\n\nThe views on this page do not necessarily reflect the views of the NBA, its clubs or Warner Bros. Discovery."
        },
        {
            "id": "93757e15a02b3bd84fa513fe316eebf8",
            "title": "2025 NFL schedules by team: Full list of times, dates, TV, streaming for entire season for all 32 franchises - CBS Sports",
            "url": "https://www.cbssports.com/nfl/news/2025-nfl-schedules-by-team-full-list-of-times-dates-tv-streaming-for-entire-season-for-all-32-franchises/",
            "publishedAt": "2025-05-15T03:04:03Z",
            "urlToImage": "https://sportshub.cbsistatic.com/i/r/2025/05/14/77a09d46-87d6-409c-858e-3b2e6e25e67e/thumbnail/1200x675/7b1b54ba545d856be770bc483e78e705/nfl-logos.jpg",
            "source": "CBS Sports",
            "description": "Team-by-team schedule for all 32 franchises",
            "content": "Well, folks, the full, 272-game NFL schedule is finally here. We know who is playing who, and when, and where, and on what TV station or streaming service. Every single game. \r\nWe've already been cov… [+59050 chars]",
            "full_content": "Well, folks, the full, 272-game NFL schedule is finally here. We know who is playing who, and when, and where, and on what TV station or streaming service. Every single game. \r\nWe've already been cov… [+59050 chars]"
        },
        {
            "id": "28996a30eda009b06613fd433cb9528a",
            "title": "Colts deleted their schedule-release video - NBC Sports",
            "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/colts-deleted-their-schedule-release-video",
            "publishedAt": "2025-05-15T01:46:46Z",
            "urlToImage": "https://nbcsports.brightspotcdn.com/dims4/default/19f25b0/2147483647/strip/true/crop/4804x2702+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa4%2F55%2Fb173fdfd480e96133a86ff7fdbea%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F1860946315",
            "source": "NBCSports.com",
            "description": "It was inevitable.",
            "content": "It was inevitable.\r\nAs the various social-media teams of the various NFL franchises try to one-up each other with funny and entertaining schedule release videos, one of them was bound to post somethi… [+893 chars]",
            "full_content": "It was inevitable.\n\nAs the various social-media teams of the various NFL franchises try to one-up each other with funny and entertaining schedule release videos, one of them was bound to post something that gave someone within the organization cold feet and/or a nervous stomach.\n\nThat apparently happened with the Colts on Wednesday. Their Minecraft-themed video (the Chargers opted for a Minecraft vibe, too) posted by the Colts was deleted.\n\nBefore it went away, others preserved it.\n\nThe most obvious culprit was Week 1. The video depicted Miami receiver Tyreek Hill as a dolphin. And he was arrested by the Coast Guard.\n\nThe video also dubs Cardinals quarterback Kyler Murray a “chicken jockey,” and it shows Chiefs quarterback Patrick Mahomes as a frog that jumps into a boxing ring to stop a fight between Pat Mahomes Sr. and John Rocker.\n\nWhatever the problem, the lesson is clear. Make sure everyone who is in a position to give the video a thumb’s down has a chance to do so before the video goes live.\n\nUnless, of course, the deletion was strategic. If so, it may have been brilliant."
        },
        {
            "id": "e08d40c3fe18871e055838173349bb60",
            "title": "Charles Barkley calls Steph Curry injury return theory 'stupid' - SFGATE",
            "url": "https://www.sfgate.com/warriors/article/barkley-calls-steph-curry-injury-theory-stupid-20328075.php",
            "publishedAt": "2025-05-15T01:24:18Z",
            "urlToImage": "https://s.hdnux.com/photos/01/50/27/31/27358802/3/rawImage.jpg",
            "source": "SFGate",
            "description": "Kenny Smith offered a truly bizarre take on Steph Curry's injury status hours before the Golden State Warriors play an elimination game on TNT.",
            "content": "Stephen Curry (in red) of Warriors is seen during Game 4 between Minnesota Timberwolves and Golden State Warriors at Chase Center on May 12, 2025 in San Francisco.\r\nAnadolu/Anadolu via Getty Images\r\n… [+2619 chars]",
            "full_content": "Stephen Curry (in red) of Warriors is seen during Game 4 between Minnesota Timberwolves and Golden State Warriors at Chase Center on May 12, 2025 in San Francisco.\r\nAnadolu/Anadolu via Getty Images\r\n… [+2619 chars]"
        },
        {
            "id": "6426257c51e934e51938008e19613a24",
            "title": "3 initial observations on the Chiefs’ 2025 schedule - Arrowhead Pride",
            "url": "https://www.arrowheadpride.com/2025/5/14/24430514/chiefs-2025-nfl-schedule-initial-observations-slate",
            "publishedAt": "2025-05-15T01:15:00Z",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/Ota5FbYviUNtQ6AuQguD45dRVh8=/0x275:3839x2285/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25994794/2198604486.jpg",
            "source": "Arrowhead Pride",
            "description": "Kansas City will (again) have a prominent place among NFL telecasts.",
            "content": "On Wednesday, the NFL released the 2025-26 regular season schedule. Fans of the Kansas City Chiefs should make plans for some late nights and to plan two major holidays around football. Heres what to… [+3831 chars]",
            "full_content": "On Wednesday, the NFL released the 2025-26 regular season schedule. Fans of the Kansas City Chiefs should make plans for some late nights — and to plan two major holidays around football. Here’s what to know about the team’s 17 regular-season games.\n\nThe NFL doesn’t buy into ‘Chiefs fatigue’\n\nYou may have a friend or cousin living in another market groaning that the Chiefs have too many high-profile slots. Someone you’ve interacted with on social media might even swear off watching Kansas City in prime time for fear that a few seconds of the broadcast may feature a high-profile romantic partner of a certain tight end. Someone somewhere still clings to anger over perceived biased officiating, vowing to never tune in to the Chiefs — or possibly football in general — again.\n\nThe NFL appears ready to call the bluff of its most angry clients.\n\nVia early schedule leaks, we have known that the Chiefs would be visiting the Dallas Cowboys on Thanksgiving and hosting the Denver Broncos on Christmas night. The first third of the season, however, will feature Kansas City early and often.\n\nIn Week 1, the Chiefs will face the Los Angeles Chargers in Brazil on a Friday night. The event, which will air for free on YouTube, will almost certainly set a record for the most-streamed live event. Kansas City will then appear on two of the first six Sunday Night Football telecasts on NBC — traveling to face the New York Giants in Week 3 while hosting the Detroit Lions in Week 6. The Chiefs will also play a road game against the Jacksonville Jaguars on ESPN’s Week 5 edition of Monday Night Football.\n\nEven the first two Sundays with 3:25 Arrowhead Time kickoffs will have massive viewership. In Week 2, the Chiefs will host the Philadelphia Eagles in a Super Bowl rematch that will be nationally televised on FOX. The vast majority of the country will likely also see their CBS-affiliate broadcast the Chiefs hosting the Baltimore Ravens in Week 4 — outside a small sampling of markets likely getting the Las Vegas Raiders hosting the Chicago Bears.\n\nMany football fans may well be tired of seeing the Chiefs win. The league is betting, however, that many of the disillusioned will still tune in to root for Kansas City’s opponents.\n\nThe Chiefs likely have a brutal first half of the season\n\nA caveat in assessing the schedule should be that we do not know which teams will fail to take an expected next step, which teams will rise above meager expectations, and — most importantly — which squads will be blessed with optimal health. All things being equal, however, the Chiefs’ first nine games appear frontloaded with the best opponents.\n\nKansas City will play five of the other seven squads who advanced to the second round of last season’s playoffs in that span (a sixth, the Houston Texans, will subsequently visit Arrowhead in Week 14). With always tough divisional contests against the Chargers and Raiders mixed in, we may learn much about how the Chiefs will rebound from a disappointing Super Bowl loss over the season’s first half.\n\nKansas City will become well acquainted with the top of the 2025 NFL Draft\n\nFormer Penn State pass rusher Abdul Carter and Colorado’s two-way superstar Travis Hunter were widely considered the best players in last month’s draft. The Chiefs will first encounter both top prospects on the road during the first five games of the season, with Carter now a Giant and Hunter a Jaguar.\n\nLate in the season, the Chiefs will get their initial look the draft’s top selection, former Miami quarterback Cam Ward, when they visit the Tennessee Titans during Week 16.\n\nKansas City will also now face generationally talented former Boise State running back Ashton Jeanty — now a Raider — twice each season, beginning with a home contest in Week 7 before concluding the season by traveling to Sin City in Week 17.\n\nTime will tell on the rookies’ star power, but four of the draft’s top six selections will line up against the Chiefs in their first season."
        },
        {
            "id": "2af9b9245195bfe52d96231f9ad2b409",
            "title": "Lions open as favorites over Packers in Week 1 of 2025 season - Pride Of Detroit",
            "url": "https://www.prideofdetroit.com/2025/5/14/24429402/detroit-lions-favorites-season-opener-packers-week-1-gambling-odds-2025",
            "publishedAt": "2025-05-15T01:00:00Z",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/sO2vR4c74BYBPxw5bZwSvdNRQnI=/0x195:5397x3021/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25994441/2183118505.jpg",
            "source": "Prideofdetroit.com",
            "description": "The Lions open the 2025 season as road favorites over the Packers in Week 1.",
            "content": "The 2025 NFL regular season schedule was released on Wednesday night, and the Detroit Lions will kick things off at Lambeau Field, where theyll take on their division rival Green Bay Packers. \r\nThe L… [+2282 chars]",
            "full_content": "The 2025 NFL regular season schedule was released on Wednesday night, and the Detroit Lions will kick things off at Lambeau Field, where they’ll take on their division rival Green Bay Packers.\n\nThe Lions and the Packers both made the playoffs in 2024, and each is considered a strong contender for the NFC North crown in 2025. But recent history has been on the side of Detroit, as the Lions have not only won the division title in back-to-back seasons, but they’ve also won six of their last seven matchups against the Packers, including winning the last three games in Lambeau Field.\n\nWith that in mind, it shouldn’t be too much of a surprise that the folks over at FanDuel Sportsbook have set the opening betting line at Lions -1.5 points.\n\nThe Lions saw both their offensive and defensive coordinators exit for head coaching positions this offseason, but the majority of the coaching staff returns, and the players on the roster are healthy, improved, and confident heading into 2025.\n\nLast season, the Lions swept the Packers without the services of their top three edge rushers, Aidan Hutchinson, Marcus Davenport, and Josh Paschal in both games. Additionally, Jameson Williams missed Week 9, while DJ Reader and Alex Anzalone were both unable to play in Week 14. All six starters are expected to be ready to go this offseason.\n\nBut the Lions aren’t just healthier; their roster and depth have also improved. In free agency, the Lions signed D.J. Reed to replace Carlton Davis and Grant Stuard to replace Jalen Reeves-Maybin, then added Roy Lopez, Avonte Maddox, and Rock Ya-Sin to strengthen their defense. They further strengthened the interior defensive line by drafting Tyleik Williams in the first round of the NFL Draft while also snagging Tate Ratledge as a potential Kevin Zeitler replacement. Additionally, Isaac Tesla gives the Lions yet another dynamic offensive weapon, Ahmed Hassanein adds more juice on the edge, while Georgia’s Dan Jackson and Dominic Lovett will bolster the Lions' special teams.\n\nWhile the Lions have focused their offseason on getting bigger and more athletic, the Packers spent their offseason getting a lot more athletic—investing in speedy linebackers in free agency while adding wide receivers and offensive/defensive linemen in the draft—and sacrificing bulk. This strategy should help them be more competitive throughout the season, but it’s also fair to wonder how this approach will play out against the Lions.\n\nWe’ll find out in Week 1."
        },
        {
            "id": "2235035640712faca364c37cd86beab0",
            "title": "Bears 2025 schedule release: Challenges throughout for new coach Ben Johnson - Chicago Sun-Times",
            "url": "https://chicago.suntimes.com/bears/2025/05/14/bears-nfl-schedule-release-day-thursday-tracker-caleb-williams-eagles-packers-fox-amazon",
            "publishedAt": "2025-05-15T00:44:00Z",
            "urlToImage": "https://cst.brightspotcdn.com/dims4/default/3bcb50f/2147483647/strip/true/crop/5199x2968+0+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fc2%2F46%2Fe2a5ba4b46fbb6ea0980abfc688c%2Fwilliams-vikes.jpg",
            "source": "Suntimes.com",
            "description": "The Bears will face former head coach Matt Eberflus, now the Cowboys’ defensive coordinator, and go on to tangle with the defending champion Eagles, the surging Commanders and the ever-dominant Ravens and Roquan Smith. They'll close out the season at Soldier …",
            "content": "New coach Ben Johnsons overhaul of the Bears will be tested immediately this season with games against the top two teams in the NFC North from last season.\r\nThey open on ''Monday Night Football again… [+3424 chars]",
            "full_content": "New coach Ben Johnson’s overhaul of the Bears will be tested immediately this season with games against the top two teams in the NFC North from last season.\n\nThey open on ''Monday Night Football’’ against the Vikings on Sept. 8 at Soldier Field as part of the prime-time package for kickoff week, then visit Johnson’s former team, the Lions, in Week 2. The NFL revealed those matchups and the rest of the 2025 schedule Wednesday.\n\nThe Bears will face former head coach Matt Eberflus, now the Cowboys’ defensive coordinator, in Week 3 and go on to tangle with the defending champion Eagles, the surging Commanders and the ever-dominant Ravens and Roquan Smith. They’ll close out the season at Soldier Field against the Lions.\n\nHere’s the schedule:\n\nWeek 1: vs. Vikings, Sept. 8 (Monday) at 7:15 p.m. (ABC 7)\n\nThis could launch a rivalry between Bears quarterback Caleb Williams and the Vikings’ J.J. McCarthy, who will be making his NFL debut.\n\nWeek 2: at Lions, Sept. 14 at noon (Fox 32)\n\nNo game looms larger for Johnson than his return to Ford Field. The symbolism is enormous because that’s where Eberflus fell apart.\n\nWeek 3: vs. Cowboys, Sept. 21 at 3:25 p.m. (Fox 32)\n\nSpeaking of Eberflus, here he is. Lighting up his predecessor’s defense would be an emphatic statement for Johnson.\n\nWeek 4: at Raiders, Sept. 28 at 3:25 p.m. (CBS 2)\n\nThe Raiders have a long way to go, but Pete Carroll is always in win-now mode.\n\nWeek 5: Bye\n\nThe Bears have their off week in the first half of the season for the second year in a row.\n\nWeek 6: at Commanders, Oct. 13 (Monday) at 7:15 p.m. (ABC 7)\n\nThe entire season fell apart on the Bears’ Fail Mary last October. Williams vs. Jayden Daniels makes this one of the NFL’s best games.\n\nWeek 7: vs. Saints, Oct. 19 at noon (Fox 32)\n\nThe Saints likely will be among the worst teams in the league.\n\nWeek 8: at Ravens, Oct. 26 at noon (CBS 2)\n\nRoquan Smith has waited for payback against general manager Ryan Poles, who traded him in 2022.\n\nWeek 9: at Bengals, Nov. 2 at noon (CBS 2)\n\nThe Bears haven’t played in Cincinnati since 2017, when they pummeled Andy Dalton in a 33-7 win.\n\nWeek 10: vs. Giants, Nov. 9 at noon (Fox 32)\n\nThe Giants are 9-25 over the last two seasons, though rookie quarterback Jaxson Dart could be a spark.\n\nWeek 11: at Vikings, Nov. 16 at noon (Fox 32)\n\nThis deep into the season, it’ll be clear if the Bears are serious about making a playoff push.\n\nWeek 12: vs. Steelers, Nov. 23 at noon (CBS 2)\n\nThe Bears will get a shot at the coach they wanted to pry away with a trade: Mike Tomlin.\n\nWeek 13: at Eagles, Nov. 28 (Friday) at 2 p.m. (Amazon Prime Video)\n\nThe Bears have lost six straight to the Eagles, and their last win was in 2011, when Jay Cutler outdueled Michael Vick.\n\nWeek 14: at Packers, Dec. 7 at noon (Fox 32)\n\nThe Bears haven’t waited this long to face the Packers for the first time in a season since 1998, when they met in Weeks 15 and 17.\n\nWeek 15: vs. Browns, Dec. 14 at noon (Fox 32)\n\nIt’s debatable whether the Browns, Saints or Giants at home will be the Bears’ easiest game.\n\nWeek 16: vs. Packers, Dec. 20 (Saturday) at 3:30 or 6 p.m. (Fox 32)\n\nThe national audience would love high stakes for both teams — a rarity lately — in this game.\n\nWeek 17: at 49ers, Dec. 28 at 7:20 p.m. (NBC 5)\n\nThe 49ers were a wreck last season — and still thumped the Bears 38-13.\n\nWeek 18: vs Lions, Jan. 3 or 4 (TV TBD)\n\nThe NFL waits to set these games and wants meaningful matchups for two stand-alone spots Saturday and one Sunday.\n\nPreseason schedule\n\nDate, time TBD: vs Dolphins (Fox 32)\n\nAug. 17: vs. Bills, 7 p.m. (Fox 32)\n\nAug. 22 (Friday): at Chiefs, 7:20 p.m. (Fox 32)"
        },
        {
            "id": "e6a985c4ae70b48183479ed626897f1f",
            "title": "Commanders scheduled for eight standalone games in 2025 - NBC Sports",
            "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/commanders-scheduled-for-eight-standalone-games-in-2025",
            "publishedAt": "2025-05-15T00:41:35Z",
            "urlToImage": "https://nbcsports.brightspotcdn.com/dims4/default/1b9fed8/2147483647/strip/true/crop/6747x3795+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ffe%2F35%2Fa98b2f014c41991ee23291e4d8f1%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2195703054",
            "source": "NBCSports.com",
            "description": "Get ready to watch plenty of the Commanders in 2025.",
            "content": "Get ready to watch plenty of the Commanders in 2025. \r\nAfter quarterback Jayden Daniels sensational rookie season that culminated in a deep postseason run, Washington is scheduled for a whopping eigh… [+1492 chars]",
            "full_content": "Get ready to watch plenty of the Commanders in 2025.\n\nAfter quarterback Jayden Daniels’ sensational rookie season that culminated in a deep postseason run, Washington is scheduled for a whopping eight standalone games in the coming season.\n\nWhile the Commanders will start the season with a 1 p.m. Sunday home matchup against the Giants, they’ll have their first primetime game in Week 2 when they travel to Green Bay to play the Packers on Thursday night.\n\nWashington will be heavily featured from Week 5 through Week 11, as the club will play the Chargers in Southern California for a 4:25 p.m. start time on FOX. Then in Week 6, Daniels will have his second matchup against 2024 No. 1 overall pick Caleb Williams on Monday Night Football.\n\nIn Week 7, the Commanders will host the Cowboys for another 4:25 p.m. start on FOX. Then it’s two primetime games in a row, with a Week 8 Monday night game at Kansas City followed by a Week 9 matchup on Sunday Night Football against the Seahawks.\n\nThe Lions come to town for a rematch of the divisional round in Week 10, slated for 4:25 on FOX. Then the Commanders go international, facing the Dolphins in Madrid for 9:30 a.m. start.\n\nAfter a Week 12 bye, the Commanders will face the Broncos on Sunday Night Football for another primetime matchup.\n\nThe franchise will have a pair of 1 p.m. Sunday starts for road games against the Vikings and Giants before a special standalone Saturday matchup against the Eagles in Week 16.\n\nFinally, the Week 17, Christmas Day game against the Cowboys is scheduled for a standalone slot at 1 p.m.\n\nThat makes eight standalone games with three more late-afternoon featured time slots for Washington’s 2025 schedule."
        },
        {
            "id": "793686eebe4594a128b4e277ef93456d",
            "title": "Chargers Roast Steelers In Schedule Release Video - Steelers Depot",
            "url": "https://steelersdepot.com/2025/05/chargers-roast-steelers-in-schedule-release-video/",
            "publishedAt": "2025-05-15T00:39:46Z",
            "urlToImage": "https://steelersdepot.com/wp-content/uploads/2025/05/ChargersVid3-1.jpg",
            "source": "Steelers Depot",
            "description": "When it comes to NFL schedule release videos, no one does it better than the Los Angeles Chargers. Unafraid to poke fun at every opponent, the Pittsburgh Steelers certainly weren’t spared. The Chargers’ 2025 schedule theme was made in Minecraft, and it has pl…",
            "content": "When it comes to NFL schedule release videos, no one does it better than the Los Angeles Chargers. Unafraid to poke fun at every opponent, the Pittsburgh Steelers certainly weren’t spared. The Charge… [+2220 chars]",
            "full_content": "When it comes to NFL schedule release videos, no one does it better than the Los Angeles Chargers. Unafraid to poke fun at every opponent, the Pittsburgh Steelers certainly weren’t spared. The Chargers’ 2025 schedule theme was made in Minecraft, and it has plenty of subtle jabs at Pittsburgh, which they will play in Week 10 during Sunday Night Football.\n\nFeaturing an old mine, the beginning of the clip features a sign that says “No Children Allowed.” Is that commitment to the bit or a subtle jab at WR George Pickens, whose drama and antics frustrated the Steelers enough to trade him away like so many difficult receivers in recent team history?\n\nEntering the mine shaft, signs point in two directions: “Contender” and “rebuild.” Pittsburgh finds itself awkwardly in between, wanting to win and break an eight-year playoff victory drought but clearly far away from true Super Bowl contenders. It’s football purgatory.\n\nThere’s even an Aaron Rodgers Easter Egg tucked away in the final frame, watching the Steelers fall off the end of the track. Left side of the screen.\n\nFinally, the most explicit joke of them all. A red sign that reads, “Warning Track Ends In 9’8,” a clear nod to a Steelers’ team always hovering in the 9-10 win range. Good enough for Wild Card contention, not great enough for a top seed, and never bad enough to land a blue-chip draft prospect capable of resetting and transforming the franchise.\n\nThe Steelers and Chargers met early last season, with Pittsburgh exiting with a victory. Los Angeles will look for revenge this year. Their roster features former ex-Steelers, including RB Najee Harris, CB Donte Jackson, and WR Mike Williams, who spent most of his career with the Chargers before being traded from the New York Jets to the Steelers midway through 2024.\n\nThe Chargers have certainly gone after players and teams harder than the Steelers in the past and overall, Pittsburgh got off fairly easy. Still, as far as the NFL goes, it’s as biting critiques as you’ll see from team-to-team. Compare that to Pittsburgh’s direction, a “Catching Bigfoot” theme that didn’t reveal the schedule until the very end. Not the team’s strongest showing."
        },
        {
            "id": "725738c2249264d0d478d4929fa0463d",
            "title": "Breaking down the Raiders' 2025 schedule game by game - Las Vegas Raiders",
            "url": "https://www.raiders.com/news/raiders-2025-schedule-release-game-by-game-breakdown-afc-west-nfc-east-afc-south",
            "publishedAt": "2025-05-15T00:38:44Z",
            "urlToImage": "https://static.clubs.nfl.com/image/upload/t_editorial_landscape_12_desktop/raiders/qkd8cfaqqr0hgywgdfhi",
            "source": "Raiders.com",
            "description": "Take a closer look at the 2025 slate.",
            "content": null,
            "full_content": null
        }
    ]
}