{
    "status": "ok",
    "totalResults": 69,
    "category": "science",
    "country": "us",
    "timestamp": "2025-05-16 14:32:17",
    "articles": [
        {
            "id": "0f1bf35f6c07e74872778fd0eb9453e5",
            "title": "Webb Spots Mysterious Lightshow on Jupiter That Baffles Scientists - SciTechDaily",
            "url": "https://scitechdaily.com/webb-spots-mysterious-lightshow-on-jupiter-that-baffles-scientists/",
            "publishedAt": "2025-05-15T03:29:47Z",
            "urlToImage": "https://scitechdaily.com/images/Pullout-of-Aurora-Observations-on-Jupiter-Webb-NIRCam-Image-scaled.jpg",
            "source": "SciTechDaily",
            "description": "Jupiter’s auroras sparkle with mystery — and Webb just uncovered a cosmic riddle scientists didn’t see coming.",
            "content": "These observations of Jupiter’s auroras (shown on the left of the above image) at 3.36 microns (F335M) were captured with NASA’s James Webb Space Telescope’s NIRCam (Near-Infrared Camera) on December… [+6489 chars]",
            "full_content": "Webb sees the aurora flickering, fluctuating, and undulating at Jupiter ’s north pole.\n\nAuroras on Earth, better known as the Northern and Southern Lights, create glowing, shifting curtains of color in the night sky. These dazzling displays happen when high-energy particles from the Sun are steered by Earth’s magnetic field and crash into the atmosphere near the poles. Even astronauts aboard the International Space Station can see them from above.\n\nNow imagine that light show cranked up to an extreme. On Jupiter, auroras are not only much larger but also hundreds of times brighter than those on Earth. When astronomers pointed NASA’s powerful James Webb Space Telescope at the giant planet, they discovered something surprising: Jupiter’s auroras don’t just glow, they burst and flicker like cosmic fireworks, sometimes changing in just seconds.\n\nWebb Space Telescope Reveals New Details, Mysteries in Jupiter’s Aurora\n\nNASA’s James Webb Space Telescope has revealed stunning new details about the brilliant auroras shining over Jupiter, the largest planet in our solar system. These glowing light shows are not only massive but also hundreds of times brighter than Earth’s auroras. Thanks to Webb’s incredible sensitivity, astronomers are now able to study these lights in greater detail to better understand Jupiter’s powerful magnetic environment.\n\nAuroras occur when streams of high-energy particles crash into a planet’s atmosphere near its magnetic poles, causing gases to glow. On Earth, we know them as the Northern and Southern Lights—shimmering displays that appear when particles from the Sun interact with the upper atmosphere, producing colorful waves of red, green, and purple light. Jupiter’s auroras are far more intense and energetic, fueled by additional cosmic forces.\n\nVolcanic Moons and a Magnetic Juggernaut\n\nOne major difference is that Jupiter doesn’t just rely on the Sun for its auroras. Its massive magnetic field also pulls in charged particles from its surroundings, including material thrown into space by its moon Io. Known for its explosive volcanoes, Io blasts out particles that escape the moon’s gravity and form a ring around Jupiter. When these and other solar particles are swept up by Jupiter’s magnetic field, they’re accelerated to extreme speeds and collide with the planet’s atmosphere, creating bursts of glowing light.\n\nWebb is now offering an unprecedented look at these events. Using its Near-Infrared Camera (NIRCam), the telescope captured new data on December 25, 2023. Led by Jonathan Nichols at the University of Leicester in the UK, the research team discovered rapidly changing features in Jupiter’s auroras, revealing a level of activity that’s far more dynamic than scientists expected.\n\nNASA’s James Webb Space Telescope has captured new details of the auroras on our solar system’s largest planet. The dancing lights observed on Jupiter are hundreds of times brighter than those seen on Earth.\n\nFlickering in Seconds: A Shocking Discovery\n\n“What a Christmas present it was – it just blew me away!” shared Nichols. “We wanted to see how quickly the auroras change, expecting them to fade in and out ponderously, perhaps over a quarter of an hour or so. Instead, we observed the whole auroral region fizzing and popping with light, sometimes varying by the second.”\n\nIn particular, the team studied emission from the trihydrogen cation (H 3 +), which can be created in auroras. They found that this emission is far more variable than previously believed. The observations will help develop scientists’ understanding of how Jupiter’s upper atmosphere is heated and cooled.\n\nThe team also uncovered some unexplained observations in their data.\n\nA Tale of Two Telescopes\n\n“What made these observations even more special is that we also took pictures simultaneously in the ultraviolet with NASA’s Hubble Space Telescope,” added Nichols. “Bizarrely, the brightest light observed by Webb had no real counterpart in Hubble’s pictures. This has left us scratching our heads. In order to cause the combination of brightness seen by both Webb and Hubble, we need to have a combination of high quantities of very low-energy particles hitting the atmosphere, which was previously thought to be impossible. We still don’t understand how this happens.”\n\nThese observations of Jupiter’s auroras at a wavelength of 3.36 microns (F335M) were captured with Webb’s NIRCam (Near-Infrared Camera) on December 25, 2023.\n\nWhat Comes Next for Jovian Auroras\n\nThe team now plans to study this discrepancy between the Hubble and Webb data and to explore the wider implications for Jupiter’s atmosphere and space environment. They also intend to follow up this research with more Webb observations, which they can compare with data from NASA’s Juno spacecraft to better explore the cause of the enigmatic bright emission.\n\nThese results were published today in the journal Nature Communications.\n\nReference: “Dynamic infrared aurora on Jupiter” by J. D. Nichols, O. R. T. King, J. T. Clarke, I. de Pater, L. N. Fletcher, H. Melin, L. Moore, C. Tao and T. K. Yeoman, 12 May 2025, Nature Communications.\n\nDOI: 10.1038/s41467-025-58984-z\n\nThe James Webb Space Telescope is the most advanced space science observatory ever built. Designed to explore the universe in unprecedented detail, Webb is helping scientists unravel mysteries within our own solar system, study planets orbiting distant stars, and investigate the origins of galaxies, stars, and cosmic structures. As a global collaboration between NASA, the European Space Agency (ESA), and the Canadian Space Agency (CSA), Webb is transforming our understanding of the universe and our place within it.\n\nNever miss a breakthrough: Join the SciTechDaily newsletter."
        },
        {
            "id": "e1a96427bc0ef3130ad0bd42a103bbaf",
            "title": "Zombie star baffles astronomers because it \"should not exist\" - Earth.com",
            "url": "https://www.earth.com/news/zombie-star-baffles-astronomers-because-it-should-not-exist-askap-j1839-0756/",
            "publishedAt": "2025-05-15T02:32:23Z",
            "urlToImage": "https://cff2.earth.com/uploads/2025/01/14202951/zombie-star_ASKAP-J1839-0756_should-not-exist_1m.jpg",
            "source": "Earth.com",
            "description": "ASKAP J1839-0756 appears as a steady radio source during parts of its rotation and suddenly dims at other times, like a lighthouse beam",
            "content": "It began as a curious blip in radio data, something that looked a lot like a known pulsar yet behaved in ways that seemed counterintuitive. Researchers were intrigued by the odd timing of its signals… [+5755 chars]",
            "full_content": "It began as a curious blip in radio data, something that looked a lot like a known pulsar yet behaved in ways that seemed counterintuitive. Researchers were intrigued by the odd timing of its signals, which suggested there might be more to this star than simple cosmic flashes.\n\nDr. Manisha Caleb from the University of Sydney soon uncovered an eye-opening detail. The signals repeated at intervals far longer than standard theory would anticipate, hinting at a discovery that could push scientists to rethink core ideas about how dense stellar remnants function.\n\nShocking detail in a cosmic search\n\nA supernova occurs when certain massive stars run out of nuclear fuel and collapse in on themselves, often blowing off their outer layers in a brilliant explosion.\n\nThe leftover core is known as a neutron star, a compact object packed with matter so dense that a teaspoon of it would outweigh a mountain.\n\nSome neutron stars emit strong radio signals. These blasts line up with Earth each time the star rotates, creating a pattern that scientists use to identify and study them.\n\nASKAP J1839-0756 is the source\n\nThe newly identified cosmic source, called ASKAP J1839-0756, was found to spin once every 6.45 hours.\n\nThat is surprisingly slow for a neutron star that still sends out bright signals, since they usually stop shining in radio if their rotation lags too much.\n\nAn even bigger puzzle emerged after closer inspection of its signal pattern. Instead of just one radio flash per rotation, it showed evidence suggesting two distinct pulses that might come from opposite magnetic poles.\n\nMagnetars and magnetic fields\n\nA magnetar is a type of neutron star known for its extremely strong magnetic field. That powerful field can trigger bursts of energy in various forms, sometimes including radio signals.\n\nUnlike standard pulsars, magnetars can keep generating energy even at lower spin rates. Scientists suspect ASKAP J1839-0756 could fall into this unusual category, though it still poses theoretical dilemmas.\n\nThe fact that ASKAP J1839-0756 emits two separate pulses during a single spin is no small detail. It suggests the pulsar axis and magnetic axis might be oriented in a way that points both magnetic poles toward our planet at different times.\n\nThe scenario is rarely observed. Standard pulsars typically show one dominant signal, so spotting two flashes is a treat for anyone studying these powerful objects.\n\n“Here is the real surprise: according to what we know about neutron stars, ASKAP J1839-0756 shouldn’t even exist,” said Dr. Caleb, an astrophysicist leading the investigation. His short but direct comment captured the surprise of this finding.\n\nOlder, theories suggest that neutron stars slow down with age, eventually crossing a threshold where they no longer radiate in radio frequencies. This object defies that logic, and has sparked lively debate about what drives its persistent energy output.\n\nWhat makes ASKAP J1839-0756 special?\n\nASKAP J1839-0756 appears as a steady radio source during parts of its rotation and suddenly dims at other times. That pattern is reminiscent of a lighthouse beam, but the timing is on a scale astronomers rarely see.\n\nIts energy also drops dramatically within minutes during some observations, pointing to a phenomenon that is not fully understood.\n\nResearchers are brainstorming new models that might clarify how certain stars can sustain such emissions.\n\nIdeas about neutron star evolution may need tweaking to account for oddball behaviors. Some scientists believe these strange signals could come from objects that began life as typical, fast-spinning stars but took a different path as they aged.\n\nOthers wonder whether there are more hidden sources that orbit in deep space, pulsing too slowly for our current methods to detect.\n\nThis discovery may ignite more wide-field surveys to hunt for faint signals lurking between well-known radio pulses.\n\nPhysics behind ASKAP J1839-0756\n\nResearchers are fascinated by the possibility that ASKAP J1839-0756 proves a new energy mechanism. Magnetic fields in neutron stars can twist and release energy in highly complex ways, but the details remain murky.\n\nEven a small shift in field alignment can yield significant differences in how and when a star pulses.\n\nThese mini-laboratories in space offer a chance to investigate physics under extremes that are impossible to recreate on Earth.\n\nOne alternate explanation involves a white dwarf, which is a stellar remnant formed from less massive stars. White dwarfs have much lower density and generally do not produce intense radio pulses.\n\nYet some scientists propose that if a white dwarf had a peculiar magnetic structure, it might mimic this object’s behavior.\n\nHowever, no confirmed evidence supports that scenario so far, leaving the neutron star theory on more solid ground.\n\nAny other J1839-0756s out there?\n\nAstronomers are keeping an eye on any other signals that might echo ASKAP J1839-0756.\n\nSensitive instruments can scan the sky and compare subtle differences in the timing and strength of signals to spot emerging mysteries.\n\nTechnological advances will also help confirm whether more of these slow-burn sources are out there. If additional examples appear, experts will have fresh clues to refine their equations and rethink standard models.\n\nWhy does any of this matter?\n\nThis finding tests the limits of our knowledge about extreme objects in the cosmos. It also shows that bold assumptions about star lifecycles can be turned upside down by a single outlier.\n\nNew technologies and bigger telescopes may reveal more slow-spinning neutron stars that we never realized existed. The possibilities for discovery seem endless whenever data from large-scale surveys are analyzed with a fresh perspective.\n\nSpace surprises are often reminders that every theory has exceptions. When astronomers spot signals that disrupt established thinking, it sparks new approaches to understanding how the universe evolves.\n\n—–\n\nLike what you read? Subscribe to our newsletter for engaging articles, exclusive content, and the latest updates.\n\nCheck us out on EarthSnap, a free app brought to you by Eric Ralls and Earth.com.\n\n—–"
        },
        {
            "id": "82632339086dc9a72aa95f86ecd29663",
            "title": "New species of 'tiger swallowtail' butterfly discovered in the U.S. had gone unnoticed by scientists - Earth.com",
            "url": "https://www.earth.com/news/new-species-of-tiger-swallowtail-butterfly-discovered-in-the-u-s-had-gone-unnoticed-by-scientists/",
            "publishedAt": "2025-05-14T23:37:22Z",
            "urlToImage": "https://cff2.earth.com/uploads/2025/05/13023238/new-tiger-butterfly-species-discovered-us.jpg",
            "source": "Earth.com",
            "description": "Entomologists have discovered Papilio solstitius, a new tiger swallowtail butterfly that appears in summer in eastern North America.",
            "content": "Scientists working in eastern North America have announced an unexpected find that has stirred wide interest among insect enthusiasts. A previously unrecognized butterfly, known as Papilio solstitius… [+5551 chars]",
            "full_content": "Scientists working in eastern North America have announced an unexpected find that has stirred wide interest among insect enthusiasts. A previously unrecognized butterfly, known as Papilio solstitius, has been described as the newest member of the iconic tiger swallowtail group.\n\nAccording to preliminary observations, this tiger swallowtail butterfly group stands out for its late-summer emergence. It shows traits that set it apart from its close relatives, which include the widely known Papilio glaucus, Papilio canadensis, and Papilio appalachiensis.\n\nDr. B. Christian Schmidt from the Canadian National Collection of Insects, Arachnids, and Nematodes contributed significantly to this work, and noted that “the Papilio glaucus group is a model study system in insect evolutionary biology.”\n\nTiger swallowtail butterfly behavior\n\nEntomologists realized early on that Papilio solstitius behaves differently from other tiger swallowtails. They found that it has a unique seasonal timing, which separates it from its spring-flying neighbors.\n\nResearchers stated that “the most significant differences are apparent in developmental biology and phenology” .\n\nA key point is its late post-diapause schedule, which results in adults appearing around early July.\n\nOne group member remarked that Papilio solstitius is unique in its long post-diapause emergence delay, with adult eclosion beginning in late June to early July, compared to May for all other species.\n\nExamining the butterfly’s neighborhood\n\nThis new discovery occupies a broad section of eastern North America. Specialists tracking its distribution report that the geographic range stretches across southeastern Canada and parts of the northeastern United States.\n\n“The core range of Papilio solstitius includes eastern and south-central Ontario, northern and central New York and adjacent Vermont, New Hampshire, and Pennsylvania, encompassing a minimum land area of approximately 174,000 km2,” noted the investigators.\n\nThat covers about 67,212 square miles (174,000 square kilometers).\n\nPapilio solstitius thrives in forested landscapes, and it appears to favor habitats where host plants, such as certain ashes and cherries, flourish. Its presence in a variety of woods suggests it has adapted to multiple microclimates within its range.\n\nWhy the new butterfly matters\n\n“Papilio solstitius is closely related to these three species, but differs from all in a suite of characters,” wrote the authors who first described it.\n\nThe tiger swallowtail butterfly family often draw attention because of their impressive colors and important role in local ecosystems.\n\nThe discovery of an overlooked species invites curiosity about what else might be hidden in seemingly well-studied areas.\n\nIt took time for this insect to get recognized because it blends features of its close cousins yet follows its own schedule.\n\nMany observers likely confused it with spring-flying species that can look quite similar, especially at a quick glance.\n\nConnections to everyday science\n\nScientists describe this research effort as a reminder that our planet still holds surprises, even in places where people have long kept an eye on wildlife.\n\nThey also believe it highlights how shifts in climate or local environments may influence species boundaries in ways that remain poorly documented.\n\nThese evolving landscapes give researchers new incentives to keep testing assumptions about distribution.\n\nSome entomologists hope that the formal naming of this butterfly will help pinpoint trends in temperature and habitat that might be guiding its spread.\n\nButterfly species of interest\n\n“The recognition and delimitation of Papilio glaucus and Papilio canadensis as a classic sibling species pair led to three decades of study in speciation, host plant adaptation, hybridization, and molecular evolution,” explained the researchers.\n\nThe larger Papilio glaucus group includes various swallowtails long studied for their vivid appearance and ecological variety.\n\nTheir different preferences for temperature and region have served as a window into how insects evolve in response to changing conditions.\n\nPapilio solstitius adds another layer to that puzzle. By clearly marking the features that define it, specialists open new discussions on how similar species might have emerged in tandem or split off over time. The research team emphasized their hope that others will explore these patterns further.\n\nFuture of the Tiger swallowtail butterfly\n\nQuestions remain about what triggered the emergence of Papilio solstitius as a separate species and how far it might expand its distribution.\n\nMore fieldwork could clarify whether there are additional undiscovered pockets of “late-flight” tiger swallowtails or if these insects mix with other populations in regions farther south.\n\nThe authors are confident that this novel species will energize further study.\n\n“It is our hope that recognizing and defining the taxonomic identity of this unique evolutionary lineage provides a staging point in the fertile grounds for future research,” one of them said.\n\nAn important finding\n\nPapilio solstitius stands out not only for its timing in the summer but also for its combination of physical characteristics.\n\nExperts believe these differences, combined with modern genetics, will yield clues about how hybrids and local adaptations fuel biodiversity.\n\nStill, many mysteries remain unresolved. Insect watchers are now encouraged to record when and where they see midseason tiger swallowtails, because such sightings could fine-tune scientific understanding of this butterfly’s behavior.\n\nPeople across the Northeast might find it fascinating to learn that a seemingly familiar “tiger” can carry fresh significance.\n\nThe study is published in ZooKeys.\n\n—–\n\nLike what you read? Subscribe to our newsletter for engaging articles, exclusive content, and the latest updates.\n\nCheck us out on EarthSnap, a free app brought to you by Eric Ralls and Earth.com.\n\n—–"
        },
        {
            "id": "ccc43ac4f0806139e9bceb6916209582",
            "title": "Here's why the private Athena lunar lander toppled over on the moon - Space",
            "url": "https://www.space.com/astronomy/moon/heres-why-the-private-athena-lunar-lander-toppled-over-on-the-moon",
            "publishedAt": "2025-05-14T22:00:00Z",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/j7QwcPF5zyknJpTRwR8XrB.jpg",
            "source": "Space.com",
            "description": "Several issues conspired to bring Athena down, including tough lighting conditions near the moon's south pole.",
            "content": "We now know why the private Athena lander toppled over on the moon earlier this year.\r\nAthena, the second lunar lander built and operated by Houston company Intuitive Machines, fell onto its side sho… [+4109 chars]",
            "full_content": "A selfie captured by Intuitive Machines' Athena lander shortly after it touched down near the moon's south pole on March 6, 2025.\n\nWe now know why the private Athena lander toppled over on the moon earlier this year.\n\nAthena, the second lunar lander built and operated by Houston company Intuitive Machines, fell onto its side shortly after touching down near the lunar south pole on March 6. Athena's solar panels couldn't harvest enough sunlight in this orientation, and the probe was declared dead the next day.\n\nMore than two months later, Intuitive Machines has completed an autopsy, pinning the anomaly on three issues that worked together to bring Athena down.\n\nThe first was interference with the readings from Athena's laser altimeter, the instrument that helped the lander gauge its distance from the lunar surface.\n\n\"In the final phase of descent, we saw signal noise and distortion that did not allow for accurate altitude readings,\" Intuitive Machines CEO Steve Altemus said on Tuesday (May 13) during an earnings call that also provided an update on Athena's mission, which was known as IM-2.\n\nThe second issue was the challenging lighting conditions in Athena's landing zone, which was just 100 miles (160 kilometers) or so from the south pole of the moon.\n\n\"South Pole topography and low-angle sunlight created long shadows and dim lighting conditions that challenged the precision capability of our landing system,\" Altemus said.\n\nGet the Space.com Newsletter Breaking space news, the latest updates on rocket launches, skywatching events and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nThe third factor was Athena's compromised ability to recognize craters in the landing area. The lander's optical navigation system used photos collected by NASA's Lunar Reconnaissance Orbiter (LRO) at an altitude of 62 miles (100 kilometers).\n\nThis LRO imagery \"could not accurately account for how craters appear at lower altitudes with south pole lighting conditions as you approach the landing site,\" Altemus said.\n\nIntuitive Machines' Athena moon lander as photographed by NASA's Lunar Reconnaissance Orbiter on March 10, 2025. The lander is inside a crater at the center bottom of the frame; the inset shows a 4x enlargement of that area. (Image credit: NASA/GSFC/Arizona State University)\n\nIM-2 was supported by NASA's Commercial Lunar Payload Services (CLPS) program, which puts agency science gear on private robotic moon landers. The goal is to gather cost-efficient data that will aid NASA's Artemis program of crewed lunar exploration.\n\nAthena carried a suite of NASA science instruments and several other payloads, including Intuitive Machines' hopping spacecraft \"Grace\" and the MAPP rover, from the Colorado company Lunar Outpost. Athena's fall prevented those two other spacecraft from deploying onto the lunar surface.\n\nIM-2 followed on the heels of IM-1, a CLPS mission that put Intuitive Machines' Odysseus spacecraft on the moon in February 2024. Like Athena, Odysseus failed to remain upright, tipping over after breaking one or more of its landing legs during touchdown. But Odysseus — the first private spacecraft ever to soft-land on the moon — managed to operate on the lunar surface for seven Earth days before going dark.\n\nIntuitive Machines is working hard to ensure that its next moon lander — the vehicle that will launch on the IM-3 mission in 2026 — can stay on its feet. The company is implementing fixes based on the knowledge gained during IM-1 and IM-2, Altemus said.\n\n\"We've added dissimilar and redundant altimeters to the sensor suite, and they're going through more rigorous and extreme flight-like testing than we've done before,\" he said in Tuesday's call.\n\n\"We've incorporated an additional lighting-independent sensor for surface velocity measurements,\" he added. \"We've expanded onboard terrain crater database for enhanced navigation across the surface of the moon.\"\n\nThe team is also feeding the detailed south pole imagery captured during IM-2 into machine-learning algorithms to improve future missions' navigation and crater-tracking abilities.\n\n\"Moving forward, we will succeed,\" Altemus said. \"Land softly, land upright, land ready to operate.\""
        },
        {
            "id": "91d2cf9a1d33bddfc347cb63733c62ad",
            "title": "Voyager 1 revives backup thrusters before command pause - Phys.org",
            "url": "https://phys.org/news/2025-05-voyager-revives-backup-thrusters.html",
            "publishedAt": "2025-05-14T21:24:04Z",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/voyager-1-revives-back.jpg",
            "source": "Phys.Org",
            "description": "Engineers at NASA's Jet Propulsion Laboratory in Southern California have revived a set of thrusters aboard the Voyager 1 spacecraft that had been considered inoperable since 2004. Fixing the thrusters required creativity and risk, but the team wants to have …",
            "content": "Engineers at NASA's Jet Propulsion Laboratory in Southern California have revived a set of thrusters aboard the Voyager 1 spacecraft that had been considered inoperable since 2004. Fixing the thruste… [+6064 chars]",
            "full_content": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nNASA’s twin Voyager spacecraft, launched in 1977, are now traveling through interstellar space at around 35,000 mph (56,000 kph). This artist’s concept depicts one of the probes speeding away. Credit: NASA/JPL-Caltech\n\nEngineers at NASA's Jet Propulsion Laboratory in Southern California have revived a set of thrusters aboard the Voyager 1 spacecraft that had been considered inoperable since 2004. Fixing the thrusters required creativity and risk, but the team wants to have them available as a backup to a set of active thrusters whose fuel tubes are experiencing a buildup of residue that could cause them to stop working as early as this fall.\n\nIn addition, the mission needed to ensure the availability of the long-dormant thrusters before May 4, when the Earth-bound antenna that sends commands to Voyager 1 and its twin Voyager 2 went offline for months of upgrades.\n\nThruster clogging\n\nThe Voyagers launched in 1977 and are hurtling through interstellar space at around 35,000 mph (56,000 kph). Both spacecraft rely on a set of primary thrusters to gently pivot them up and down as well as to the right and left in order to keep their antennas pointed at Earth so they can send back data and receive commands.\n\nWithin the primary set of thrusters are other thrusters that control the spacecraft's roll motion. Seen from Earth, the roll motion rotates the antenna like a vinyl record to keep each Voyager pointed at a guide star it uses to orient itself. Both spacecraft have a primary and backup set for these roll movements.\n\n(Another set of thrusters, intended to change the spacecrafts' trajectory during the flybys of the outer planets, were revived on the spacecraft in 2018 and 2019, but they can't induce roll motion.)\n\nTo manage the clogging tubes in the thrusters, engineers switch between the sets of primary, backup, and trajectory thrusters of both Voyagers. But on Voyager 1, the primary roll thrusters stopped working in 2004 after losing power in two small internal heaters. Engineers determined the broken heaters were likely unfixable and opted to rely solely on Voyager 1's backup roll thrusters to orient the star tracker.\n\n\"I think at that time, the team was OK with accepting that the primary roll thrusters didn't work, because they had a perfectly good backup,\" said Kareem Badaruddin, Voyager mission manager at JPL, which manages the mission for NASA. \"And, frankly, they probably didn't think the Voyagers were going to keep going for another 20 years.\"\n\nBut without the ability to control the spacecraft's roll motion, a variety of issues would arise that might threaten the mission, so the engineering team decided to reexamine the 2004 thruster failure. They began to suspect that an unexpected change or disturbance in the circuits that control the heaters' power supply had effectively flipped a switch to the wrong position.\n\nIf they could turn the switch back to its original position, the heaters might work again, enabling them to reactivate the primary roll thrusters and use them if the backup roll thrusters that have been used since 2004 become completely clogged.\n\nCommunications pause\n\nThe solution required some puzzle-solving. The team would have to turn on the dormant roll thrusters, then try fixing and restarting the heaters. If, during that time, the spacecraft's star tracker drifted too far from the guide star, the long-dormant roll thrusters would automatically fire (thanks to the spacecraft's programming). And if the heaters were still off when they fired, it could trigger a small explosion, so the team needed to get the star tracker pointed as precisely as possible.\n\nIt would be a race, and the team faced additional time pressure: From May 4, 2025, through February 2026, Deep Space Station 43 (DSS-43), a 230-foot-wide (70-meter-wide) antenna in Canberra, Australia, that's part of NASA's Deep Space Network, would be undergoing upgrades. It would be offline for most of that time, with brief periods of operation in August and December.\n\nAlthough the Deep Space Network has three complexes equally spaced around the globe (in Goldstone, California, and Madrid, in addition to Australia) to ensure constant contact with spacecraft as Earth rotates, DSS-43 is the only dish with enough signal power to send commands to the Voyagers.\n\n\"These antenna upgrades are important for future crewed lunar landings, and they also increase communications capacity for our science missions in deep space, some of which are building on the discoveries Voyager made,\" said Suzanne Dodd, Voyager project manager and director of the Interplanetary Network at JPL, which manages the Deep Space Network for NASA. \"We've been through downtime like this before, so we're just preparing as much as we can.\"\n\nDiscover the latest in science, tech, and space with over 100,000 subscribers who rely on Phys.org for daily insights. Sign up for our free newsletter and get updates on breakthroughs, innovations, and research that matter—daily or weekly.\n\nThe team wanted to make sure the long-dormant thrusters would be available when the dish is back online briefly in August, by which time the thrusters currently in use on Voyager 1 might be completely clogged.\n\nThe advance work paid off: On March 20, the team watched as the spacecraft executed their commands. Because of Voyager's distance, the radio signal takes over 23 hours to travel from the spacecraft to Earth, meaning everything the team saw happening had occurred almost a day earlier. If the test had failed, Voyager might already have been in danger. But within 20 minutes, the team saw the temperature of the thruster heaters rise dramatically and knew they had succeeded.\n\n\"It was such a glorious moment. Team morale was very high that day,\" said Todd Barber, the mission's propulsion lead at JPL. \"These thrusters were considered dead. And that was a legitimate conclusion. It's just that one of our engineers had this insight that maybe there was this other possible cause and it was fixable. It was yet another miracle save for Voyager.\"\n\nProvided by NASA"
        },
        {
            "id": "3c708262b682b721859a331883e0bbb8",
            "title": "Blackouts Around The World As X Class Solar Flare Hits Earth - IFLScience",
            "url": "https://www.iflscience.com/blackouts-around-the-world-as-x-class-solar-flare-hits-earth-79207",
            "publishedAt": "2025-05-14T21:09:28Z",
            "urlToImage": "https://assets.iflscience.com/assets/articleNo/79207/aImg/83875/may-13-solar-flare-meta.png",
            "source": "IFLScience",
            "description": "Three solar flares have erupted from sunspot region 4087 since yesterday. The latest was the largest of the year so far.",
            "content": "The strongest solar flare of 2025 so far has been unleashed by the Sun, causing radio blackouts over southeast Asia, Europe, and the Middle East.The Sun had quite an active year in 2024, sending plen… [+3446 chars]",
            "full_content": "The strongest solar flare of 2025 so far has been unleashed by the Sun, causing radio blackouts over southeast Asia, Europe, and the Middle East.\n\nThe Sun had quite an active year in 2024, sending plenty of solar storms our way as we headed to the peak of the Solar Cycle. But our star is not done quite yet, and has hurled another strong solar flare into the Solar System from sunspot region 4087.\n\nIn terms of magnitude, the solar flare was classed as an X2.7 flare. The smallest of flares are B-class, followed by C, M, and the strongest category, X, while the numbers following the letter also denote strength within that category.\n\n\"Similar to the Richter scale for earthquakes, each letter represents a ten-fold increase in energy output. So an X is 10 times an M and 100 times a C,\" NASA's Scientific Visualization Studio explains.\n\n\"C-class flares are too weak to noticeably affect Earth. M-class flares can cause brief radio blackouts at the poles and minor radiation storms that might endanger astronauts. Although X is the last letter, there are flares more than 10 times the power of an X1, so X-class flares can go higher than 9.\"\n\nSunspot region 4087 unleashed a smaller flare yesterday, though it was still notably large at category X1.2, causing a brief shortwave radio blackout in the Americas, according to SpaceWeather.com. That flare was associated with a coronal mass ejection (CME), large expulsions of plasma and magnetic field from the Sun's corona. It is also responsible for accelerating energetic protons to rain down on Earth's atmosphere, triggering a low S1-class radiation storm warning. At this level, there is no risk to biological life, though radio can be affected.\n\nThe coronal material from that ejection is unlikely to hit Earth, with NASA models expecting it to hit Mercury and graze Venus. However, an M-class solar flare occurred shortly afterwards, and part of this could collide with Earth, potentially bringing aurora with it.\n\nThe X2.7 flare, released at 08:25 AM UTC on May 14, is not expected to have produced a CME that will collide with Earth, according to the NOAA Space Weather Prediction Center.\n\n\"Flares of this magnitude are not frequent,\" they note, adding \"users of high frequency (HF) radio signals may experience temporary degradation or complete loss of signal on much of the sunlit side of Earth.\"\n\nWhile astronomers can provide a warning for CMEs, as the material can take a few hours to several days to make its way to our planet, flares travel at the speed of light, and so we only observe them as their effects hit the Earth. This can include interference with radio waves.\n\n\"The increased level of X-ray and extreme ultraviolet (EUV) radiation results in ionization in the lower layers of the ionosphere on the sunlit side of Earth,\" the Space Weather Prediction Center explains.\n\n\"Under normal conditions, high frequency (HF) radio waves are able to support communication over long distances by refraction via the upper layers of the ionosphere. When a strong enough solar flare occurs, ionization is produced in the lower, more dense layers of the ionosphere (the D-layer), and radio waves that interact with electrons in layers lose energy due to the more frequent collisions that occur in the higher density environment of the D-layer. This can cause HF radio signals to become degraded or completely absorbed. This results in a radio blackout – the absence of HF communication, primarily impacting the 3 to 30 MHz band.\"\n\nAR4087 may release more solar flares and CMEs over the coming days, with a chance that the Earth could be caught in the firing line as it rotates into view."
        },
        {
            "id": "2c6b638f46e7587ba9a5aeb4cf6faf1b",
            "title": "'Hot Schrödinger's cat' states created in the lab proving that quantum effects don't require extreme cold - Earth.com",
            "url": "https://www.earth.com/news/physicists-create-schrodingers-cat-with-stable-quantum-state-at-higher-temperature/",
            "publishedAt": "2025-05-14T21:05:42Z",
            "urlToImage": "https://cff2.earth.com/uploads/2025/05/14150624/hot-chrodingers-cat-state_quantum-effects-without-extreme-cold_1m.jpg",
            "source": "Earth.com",
            "description": "Quantum superposition states created at warmer temperatures, questioning the need for extreme cold in order to work with Schrödinger's cat.",
            "content": "Scientists recently found a way to see quantum superposition effects in a system, a Schrödinger’s cat state, that is not cooled to near-absolute zero. Their result challenges the long-held assumption… [+5407 chars]",
            "full_content": "Scientists recently found a way to see quantum superposition effects in a system, a Schrödinger’s cat state, that is not cooled to near-absolute zero. Their result challenges the long-held assumption that extreme cold is the only way to maintain fragile quantum states.\n\nThey achieved this feat under less rigid conditions, demonstrating that even warm surroundings can show these elusive behaviors.\n\nThe lead scientist, Dr. Gerhard Kirchmair, from the University of Innsbruck, said this was a big step in exploring quantum experiments beyond traditional cryogenic setups.\n\nUnderstanding Schrödinger’s cat – the basics\n\nSchrödinger’s cat is one of the most famous thought experiments in physics. Erwin Schrödinger came up with it in 1935 to illustrate the strange nature of quantum mechanics.\n\nHe imagined a cat locked in a sealed box with a radioactive atom, a Geiger counter, a vial of poison, and a hammer.\n\nIf the atom decayed, the Geiger counter would detect it, trigger the hammer, and shatter the vial, killing the cat. If the atom didn’t decay, the cat would live.\n\nBut quantum theory says the atom exists in a superposition – both decayed and not – until someone observes it. So, in theory, the cat is both alive and dead at the same time until someone opens the box.\n\nThe idea sounds absurd, and that’s exactly the point. Schrödinger wasn’t trying to say cats can be undead zombies. He was highlighting the disconnect between how quantum physics behaves on the smallest scales and what we observe in everyday life.\n\nThe experiment forces us to question how measurement and observation affect reality. It’s less about the cat and more about the weirdness at the heart of quantum mechanics.\n\nQuantum states at higher temperatures\n\nMany quantum studies rely on cooling systems to very low temperatures to keep external disturbances in check. Researchers often believed thermal energy would scramble any delicate state.\n\nThese new experiments highlight that quantum interference can survive at around 1.8 Kelvin, which is much warmer than the ultra-cold temperatures typically used in similar tests. This idea turns the usual cooling requirements upside down.\n\nOne way to see if a quantum state remains intact is by measuring the Wigner function, which helps visualize the unique properties of superposition.\n\nDetecting negative regions in this function is an indicator that a system truly behaves in a quantum manner.\n\nThe fact that the experiment worked at temperatures 60 times higher than previous norms for the cavity shows a surprising robustness. It suggests that future devices may not need such intense cooling, which would reduce costs and engineering hurdles.\n\nEngineering a “hot Schrödinger’s cat”\n\nCentral to this demonstration was a transmon qubit coupled to a microwave resonator, y8ding fine control over the quantum state.\n\nBy applying carefully designed pulses, the team produced interference patterns associated with the Schrödinger’s cat concept.\n\nThey also used specially adapted protocols to counteract extra thermal noise. Despite starting from a thermally excited background, the interference stood out clearly in their measurements.\n\nThe result shows that quantum superposition might persist under conditions once thought too hot for such effects.\n\n“If we can create the necessary interactions in a system, the temperature ultimately doesn’t matter,” said Dr. Kirchmair.\n\nPractically speaking, making quantum states at higher temperatures could open doors for more compact hardware. It might also lead to new methods of integrating quantum circuitry into everyday technologies without the hassle of bulky cooling machines.\n\nWhy does any of this matter?\n\nThe idea that quantum states can survive at higher temperatures, in less demanding thermal environments, could also reshape how students and smaller research groups approach quantum experiments.\n\nWithout the high cost and complexity of ultra-low-temperature systems, more institutions may be able to replicate and build on these findings.\n\nThis shift could decentralize access to quantum research, leading to faster innovation and a wider talent pool that contributes to the field.\n\nAffordable platforms that demonstrate real superposition effects could become the new standard in university labs worldwide.\n\nOne field that stands to gain from this discovery is the development of nanomechanical oscillators, where ground-state cooling can be especially tricky.\n\nIf quantum states can remain intact without heavy refrigeration, manufacturing more accessible devices becomes a realistic goal.\n\nPowerful sensors, ultra-secure communication channels, and advanced computing modules could all benefit from these findings. Such applications would not have to rely solely on cryogenic labs.\n\nQuantum state temperature and the future\n\nBy looking beyond the typical notion that heat kills quantum effects, researchers are rethinking strategies for stable quantum platforms.\n\nThe outcome hints that temperature alone may not be the biggest obstacle, as long as the system’s interactions are well-designed.\n\nAdditional work is needed to understand how large these “hot” quantum states can get. Every success story in warmer conditions adds more confidence that a broader range of environments can still reveal weird quantum phenomena.\n\nAlthough this experiment centered on a specific setup, the principle behind it could apply to other platforms.\n\nMany scientists hope to refine these protocols and expand them to more complex systems in both university and industrial labs.\n\nThe study is published in Science Advances.\n\n—–\n\nLike what you read? Subscribe to our newsletter for engaging articles, exclusive content, and the latest updates.\n\nCheck us out on EarthSnap, a free app brought to you by Eric Ralls and Earth.com.\n\n—–"
        },
        {
            "id": "95767472ab99040e8fbd8a722254d698",
            "title": "Humans give off visible light that vanishes when we die, new study shows - Boy Genius Report",
            "url": "https://bgr.com/science/humans-give-off-visible-light-that-vanishes-when-we-die-new-study-shows/",
            "publishedAt": "2025-05-14T20:57:00Z",
            "urlToImage": "https://bgr.com/wp-content/uploads/2023/07/AdobeStock_118631093.jpeg?quality=82&strip=all",
            "source": "BGR",
            "description": "New research has proven that humans glow with a distinct and visible light that eventually fades after we die.",
            "content": null,
            "full_content": "It turns out the idea that humans glow might not just be poetic. A new study from the University of Calgary and the National Research Council of Canada has captured physical evidence showing that living organisms, including mice and plants, emit a faint visible light that vanishes upon death.\n\nThis barely-there glow, known as ultraweak photon emission (UPE), is produced by chemical reactions inside cells. While these biophotons are far too dim for our eyes to see, they’re very real, and scientists have now observed the glow flicker out in real time.\n\nBiophotons aren’t a new concept, though they’ve often been treated as fringe science. They differ from more familiar forms of bioluminescence (like glowing jellyfish or even barrelfish) and are emitted as cells deal with stress or damage. However, this is one of the first times science has posited that humans themselves glow.\n\nThe source of the glow is believed to be byproducts of metabolism that sometimes create high-energy reactions capable of releasing light.\n\nTech. Entertainment. Science. Your inbox. Sign up for the most interesting tech & entertainment news out there. Email: SIGN UP By signing up, I agree to the Terms of Use and have reviewed the Privacy Notice.\n\nA new study focused on whether this phenomenon could be seen across an entire living subject, not just in isolated cells or tissues. To test this, researchers placed live mice into completely dark imaging chambers and used high-sensitivity cameras to record their biophoton emissions.\n\nAfter about an hour, the mice were euthanized, but kept warm to rule out temperature effects. Imaging continued for another hour. According to a study published with their findings, the researchers observed a dramatic decrease in photon emissions after death.\n\nThe same was observed in plant leaves from thale cress and umbrella trees. Injured parts glowed more brightly than healthy ones, which the researchers say is clear evidence that living stress responses drive the emission.\n\nThe idea that humans glow may seem silly, but this research suggests it’s a measurable biological fact. If these emissions reflect cellular stress and health, they could one day become tools for medical diagnostics, offering a non-invasive way to monitor health, detect injury, or even study the aging process."
        },
        {
            "id": "ee9dcb25136a817b1d7f057a110f1199",
            "title": "Beyond qubits: Meet the qutrit (and ququart) - Ars Technica",
            "url": "https://arstechnica.com/science/2025/05/beyond-qubits-meet-the-qutrit-and-ququart/",
            "publishedAt": "2025-05-14T20:29:12Z",
            "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2195702706-1152x648.jpg",
            "source": "Ars Technica",
            "description": "It’s relatively easy to store multiple quantum values in one piece of hardware.",
            "content": null,
            "full_content": "The world of computers is dominated by binary. Silicon transistors are either conducting or they're not, and so we've developed a whole world of math and logical operations around those binary capabilities. And, for the most part, quantum computing has been developing along similar lines, using qubits that, when measured, will be found in one of two states.\n\nIn some cases, the use of binary values is a feature of the object being used to hold the qubit. For example, a technology called dual-rail qubits takes its value from which of two linked resonators holds a photon. But there are many other quantum objects that have access to far more than two states—think of something like all the possible energy states an electron could occupy when orbiting an atom. We can use things like this as qubits by only relying on the lowest two energy levels. But there's nothing stopping us from using more than two.\n\nIn Wednesday's issue of Nature, researchers describe creating qudits, the generic term for systems that hold quantum information—it's short for quantum digits. Using a system that can be in three or four possible states (qutrits and ququarts, respectively), they demonstrate the first error correction of higher-order quantum memory.\n\nMaking ququarts\n\nMore complex qudits haven't been as popular with the people who are developing quantum computing hardware for a number of reasons; one of them is simply that some hardware only has access to two possible states. In other cases, the energy differences between additional states become small and difficult to distinguish. Finally, some operations can be challenging to execute when you're working with qudits that can hold multiple values—a completely different programming model than qubit operations might be required.\n\nStill, there's a strong case to be made that moving beyond qubits could be valuable: it lets us do a lot more with less hardware. Right now, all the major quantum computing efforts are hardware-constrained—we can't build enough qubits and link them together for error correction to let us do useful calculations. But if we could fit more information in less hardware, it should, in theory, let us get to useful calculations sooner."
        },
        {
            "id": "e37a131668972df2ee70c718d4abdc6f",
            "title": "What paleontologists learned from fossils of a 3-eyed predator that lived 500 million years ago - ABC News",
            "url": "https://abcnews.go.com/US/paleontologists-learned-fossils-3-eyed-predator-lived-500/story?id\\\\u003d121792677",
            "publishedAt": "2025-05-14T19:30:00Z",
            "urlToImage": null,
            "source": "ABC News",
            "description": null,
            "content": null,
            "full_content": null
        }
    ]
}