{
    "status": "ok",
    "totalResults": 26,
    "category": "entertainment",
    "country": "us",
    "timestamp": "2025-05-19 14:30:32",
    "articles": [
        {
            "id": "99cc48c5571ddfd39cdd07167aa27cfb",
            "title": "Scarlett Johansson brings 50th season of ‘SNL’ to a low-key close - AP News",
            "url": "https://apnews.com/article/snl-season-50-final-episode-johansson-jost-b21ae98c1cdc429907bb988dd516221b",
            "publishedAt": "2025-05-18T06:17:00Z",
            "urlToImage": "https://dims.apnews.com/dims4/default/5312106/2147483647/strip/true/crop/2512x1413+0+131/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2Fb5%2Fbcc0ad856a06ac81d4cbdb3f0eeb%2F762c75d0087b4329812ee77612bbac04",
            "source": "Associated Press",
            "description": "Scarlett Johansson has hosted “Saturday Night Live” and set a record in a reflective end to the NBC sketch show's 50th season. She was joined by most of the show's cast during her monologue for a song in the tune of Billy Joel's “Piano Man,” in which they say…",
            "content": "Saturday Night Live was more reflective than festive in the final episode of its 50th season. \r\nScarlett Johansson, who set a record for a woman with her seventh appearance as host, used her monologu… [+3062 chars]",
            "full_content": "“Saturday Night Live” was more reflective than festive in the final episode of its 50th season.\n\nScarlett Johansson, who set a record for a woman with her seventh appearance as host, used her monologue to lead most of the current cast of the NBC sketch institution in a song sung to the tune of Billy Joel’s “Piano Man.”\n\nThe performance looked back on an eventful year that included an election, an epic anniversary special and a star-studded concert.\n\n“Sing us a song, it’s your monologue, the 50th season is through,” Johansson sang, along with Bowen Yang, Ego Nwodim, Mikey Day, Heidi Gardner and others. “It’s lasting forever, we did it together, and we got to spend it with you.”\n\nJohansson teased, then took back, a guest appearance that would have been in keeping with the season’s excess of guest stars.\n\n“Ladies and gentlemen, Billy Joel!” she shouted, before adding, “wrote this song.”\n\nNo post-season cast departures have been announced, so no emotional farewells were necessary, but Johansson and the cast joked in the song that Sarah Sherman would be gone.\n\n“It’s been a great season and Sarah is leaving, we’re all gonna miss you next year!” they sang. A stunned Sherman replied, “Wait, what? Did you guys hear something?”\n\nJohansson’s husband, Colin Jost, is a writer on the show and anchor of the “Weekend Update” segment.\n\nJost and co-anchor Michael Che returned to their annual season-finale tradition of writing and being forced to deliver wildly inappropriate jokes for each other.\n\nJohansson is the subject of many of the Che-written jokes, so this year Jost compelled Che to bring her out and apologize for once comparing part of her body to “Costco roast beef.”\n\nThe 50th season brought much media discussion of who might run the show should 80-year-old creator Lorne Michaels ever step down.\n\nSome have suggested Jost might replace Michaels and Che forced Jost to address the issue with one of the jokes written for him.\n\n“It’s SNL’s 50th season, so I want to take a moment to say something to our boss,” Jost said. “Lorne, retire, bitch! let me run the show.”\n\nJost also appeared in a pre-recorded, behind-the-scenes bit where Johansson has torrid sex with Yang after she confesses to Nwodim and Gardner that she has a crush on him, and learns he has only been publicly pretending to be gay “for the clout.”\n\nJohansson has her heart broken when she learns Yang also has been hooking up with Nwodim, Gardner and guest star Emily Ratajkowski.\n\nIn another behind-the-scenes digital short made by the three members of comedy group Please Don’t Destroy, Johansson treats the trio to a first-class flight that becomes a luxe hip-hop video until the men panic when they learn they are landing at the troubled airport of Newark, New Jersey.\n\nMusical guest Bad Bunny appears as an air traffic controller, working alone on his first day.\n\nAs in nearly every episode of this season, James Austin Johnson did his impression of President Donald Trump in the cold open segment, which had him “finding love” with Saudi Arabia’s Crown Prince Mohammed bin Salman.\n\nJohnson’s Trump broke the fourth wall and walked into the audience at the end of the bit.\n\n“It’s the ‘SNL’ finale, season 50 — worst one yet!” he said. “See you again in the fall if we still have a country. It’s a coin toss.”"
        },
        {
            "id": "8f9a0d1d5212bbb98fe8465d3fe53b95",
            "title": "Michael Che Apologizes to Scarlett Johansson for Infamous Roast Beef Joke: “I Was Jealous” - The Hollywood Reporter",
            "url": "http://www.hollywoodreporter.com/tv/tv-news/michael-che-scarlett-johansson-apologizes-roast-beef-joke-1236220532/",
            "publishedAt": "2025-05-18T05:37:25Z",
            "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2025/05/1-2.jpg?w=1296&h=730&crop=1",
            "source": "Hollywood Reporter",
            "description": "The comedian brought the actress and director out during 'SNL's' \"Weekend Update\" segment to say, during yet another joke swap with Johansson's husband Colin Jost, that he was \"just lashing out because I'm jealous.\"",
            "content": "Michael Che brought Scarlett Johansson out during “Weekend Update” to jokingly apologize for his infamous roast beef joke during the final episode of Saturday Night Live‘s 50th season.\r\n“Before I tel… [+1968 chars]",
            "full_content": "Michael Che brought Scarlett Johansson out during “Weekend Update” to jokingly apologize for his infamous roast beef joke during the final episode of Saturday Night Live‘s 50th season.\n\n“Before I tell another joke, I wanna take this opportunity to apologize to someone I hurt, Scarlett, can you come out here?” Che said at the top of the bit, with a humorous tone, which took place during yet another joke-swap with his “Weekend Update” co-host and Johansson’s husband Colin Jost. “Y’know, last time we did joke-swap, I made Colin do some tasteless jokes comparing your vagina to Costco roast beef.”\n\nThe joke in question saw Johansson’s husband warn of Costco removing “the roast beef sandwich from its menu” during a “Weekend Update” segment last December. “But I ain’t trippin’, I’ve been eating roast beef every night since my wife had the kid,” Jost said in a joke written by Che as Johansson looked on, shocked.\n\n“The fact is I was just lashing out because I’m jealous. I’ve never even seen a human vagina,” he said, seemingly continuing to read lines penned by Jost. “And notice I said ‘human,’ because I once spent the summer on a farm.”\n\nBefore Johansson returned to host Saturday Night Live, she promised to “burn” Che “back” for the roast beef joke.\n\n“I had all these cameras on me. I didn’t expect the setup to be like that,” she said in a profile with Vanity Fair. “I was like, ‘Wow, you really are seventh-, eighth-grade boys…’ I feel like it’s almost my responsibility to come up with some way to burn Michael back. Retaliation, I’d say, should be expected.”\n\nDuring the episode, Che joked that he was also “sorry” to Jost “because I owe you everything,” another line seemingly written by his co-host.\n\n“When Colin discovered me, I was selling crack outside ,” Che said in jest. “I’ve told thousands of jokes on ‘Update’ that have gotten dozen of laughs, but I’ve never said the three most important words of all: I love you.”\n\nSaturday night marked Johansson’s seventh time hosting the NBC sketch comedy show, setting a record for the most hosting stints by a woman. She was joined by Bad Bunny, the night’s musical guest, for his third SNL appearance."
        },
        {
            "id": "422cdfb6dc6b2bfa55caab9ba6eb676e",
            "title": "Austria’s JJ wins Eurovision 2025 with ‘Wasted Love’ - CNN",
            "url": "https://www.cnn.com/2025/05/17/entertainment/eurovision-song-contest-winner-austria-jj-latam-intl",
            "publishedAt": "2025-05-18T04:36:00Z",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap25137838937604.jpg?c=16x9&q=w_800,c_fill",
            "source": "CNN",
            "description": "Austria won its third Eurovision Song Contest after a glittering grand final in neighboring Switzerland, with singer JJ earning the continent’s votes for the operatic pop anthem “Wasted Love.”",
            "content": "Austria won its third Eurovision Song Contest after a glittering grand final in neighboring Switzerland, with singer JJ earning the continents votes for the operatic pop anthem Wasted Love.\r\nThe song… [+2411 chars]",
            "full_content": "London CNN —\n\nAustria won its third Eurovision Song Contest after a glittering grand final in neighboring Switzerland, with singer JJ earning the continent’s votes for the operatic pop anthem “Wasted Love.”\n\nThe song, which showcases the classically trained Austrian-Filipino singer’s remarkable vocals and was staged in a dramatic style that evoked a shipwreck, dazzled the crowd in Basel and saw Austria triumph for the first time since Conchita Wurst’s victory in 2014.\n\nIsrael came second in the leaderboard, with Yuval Raphael – a survivor of Hamas’ October 7 attacks – winning support for her performance of “New Day Will Rise.” Estonia was placed third, while San Marino earned the last-place spot.\n\nBefore the final, JJ told CNN: “I feel very, very humbled and honored that the artwork that I’m putting out there is being so well accepted. This is the kind of music that I want to continue making.”\n\nJJ, representing Austria, performs on stage during the Grand Final of the 69th Eurovision Song Contest Opening Ceremony in Basel, Switzerland. Sebastian Reuter/Getty Images\n\n“I had a pretty tough year, and I wanted to write about my personal experience with wasted, unreciprocated love,” he said, adding that if he won Saturday’s final, he would “probably break down, start crying and then call my family.”\n\nThe Eurovision grand final is a defining event on the LGBTQ+ calendar and attracts interest across the continent, showcasing some of Europe’s most talented, eccentric and varied performers.\n\nTaking to the stage on Saturday were a Latvian ethno-pop six-piece, whose bewitching track melded a folk chant with fairytale imagery; a Ukrainian glam rock-inspired group; a gimmicky Estonian artist who caricatured Italian coffee culture; and an Albanian double act whose haunting track “Zjerm” became a fan favorite.\n\nA rumored appearance by Celine Dion, who won Eurovision for Switzerland in 1988 and who, along with ABBA, is the contest’s most celebrated alumni, failed to materialize.\n\nThough organizers insist Eurovision is an apolitical event, the contest has long been embroiled in the continent’s tensions. Russia and Belarus were banned following Moscow’s invasion of Ukraine, and the participation of Israel has been opposed by segments of the fanbase due to the country’s ongoing war in Gaza.\n\nThe Israeli contestant Raphael — who was attending the Nova music festival when Hamas launched its cross-border attacks in October 2023 — sang to an arena where Palestinian flags were flying, following a rule change by the European Broadcasting Union (EBU).\n\nAt the end of her performance on Saturday, a man and a woman attempted to storm the stage, according to the EBU. “One of the two agitators threw paint, and a crew member was hit. The crew member is fine and nobody was injured,” the EBU told CNN in a statement."
        },
        {
            "id": "7232b1687c5eec8bc3f57fb5b359791e",
            "title": "‘Lilo & Stitch’ First Reactions Praise Film as ‘Heartfelt’ and ‘Easily the Best Disney Live-Action Remake Yet’ - variety.com",
            "url": "https://variety.com/2025/film/news/lilo-and-stitch-first-reactions-live-action-remake-1236399452/",
            "publishedAt": "2025-05-18T01:25:00Z",
            "urlToImage": "https://variety.com/wp-content/uploads/2025/05/Lilo-and-Stitch.jpg?w=1000&h=563&crop=1",
            "source": "Variety",
            "description": "The first reactions to Disney's live-action 'Lilo and Stitch' are in, and they are raving about the live-action remake.",
            "content": "“Lilo &amp; Stitch,” Disney‘s latest live-action remake, has been screened for select members of the press, and the first reactions to the film are overwhelmingly positive.\r\nCritic Wendy Lee Szany wr… [+3907 chars]",
            "full_content": "“Lilo & Stitch,” Disney‘s latest live-action remake, has been screened for select members of the press, and the first reactions to the film are overwhelmingly positive.\n\nCritic Wendy Lee Szany wrote on X, “Lilo and Stitch is the best Disney live-action to date. Seeing Stitch in his live-action form on the big screen brings on a huge wave of nostalgia. Tons of laughter and heartwarming moments. The film hits similar beats to the original, as well added something new flavors.”\n\nJournalist Laura Sirikul wrote on X, “Lilo and Stitch was heartwarming & really gave the official film more depth to Lilo & Nani. Maia Kealoha is a STAR! The Stitch was so well made. I never imagined in 23 years they’d be able to merge animation w/ live action this well. It was magical. Very sweet.”\n\nPopular on Variety\n\nThe original “Lilo & Stitch” was released in 2002, making this the most recent animated movie that Disney has turned into live-action, and the first from the 2000s. Both movies follow a young, lonely Hawaiian girl named Lilo who finds an adorable, blue and chaotic alien she names Stitch. With her big sister Nani, Lilo raises Stitch and teaches him the meaning of family, or “ohana.”\n\nThe cast includes Maia Kealoha as Lilo; Sydney Elizebeth Agudong as Nani; Zach Galifianakis as Dr. Jumba Jookiba, Stitch’s alien creator who comes looking for him; Billy Magnussen as Agent Pleakley; Courtney B. Vance as Cobra Bubbles; Hannah Waddingham as the Grand Councilwoman; and the original movie’s co-director and co-writer Chris Sanders returning as the voice of Stitch. Tia Carrere, who was the original voice of Nani, is also back playing a social worker this time around.\n\nThe first “Lilo & Stitch” was a box office success and grossed $273 million worldwide from an $80 million budget. It was nominated for best animated feature at the Academy Awards, but lost to “Spirited Away.” It went on to spawn several sequels, TV shows and video games, thanks to Stitch’s popularity with kids.\n\nRead some of the first reactions below:\n\n#LiloandStitch is a cute reimagining that mostly captures the original’s spirit through a modern-day lens. Lilo and Nani’s relationship feels even more heartfelt. It’s still raw, real, and central to the story’s emotional core. Of course Stitch brings hilarious chaos. pic.twitter.com/lYh5POQ5As — iammichaeljlee.bsky.social (@IamMichaelJLee) May 18, 2025\n\n#LiloAndStitch is PURE DISNEY MAGIC! It’s a story about loss, friendship, & ohana, told in a way that’s both fun and deeply touching. You’ll laugh, you’ll cry & Stitch will completely steal your heart. Newcomer Maia Kealoha is a breakout star in a story that delivers HEARTWARMING… pic.twitter.com/xNxvSyqjJn — Anthony Gagliardi (@AJGaliardi) May 18, 2025\n\n#LiloAndStitch is the BIGGEST SURPRISE of the year and easily the BEST Disney live action remake yet. Dean Fleischer Camp crafts a joyous family adventure that captures the chaos and charm of the original. It’s also OUT OF THIS WORLD HILARIOUS and HEARTWARMING with a star-making… pic.twitter.com/zA3i722bx1 — Daniel Baptista • The Movie Podcast (@dbapz) May 18, 2025\n\n#LiloandStitch is the best Disney live-action to date. Seeing Stitch in his live-action form on the big screen brings on a huge wave of nostalgia. Tons of laughter and heartwarming moments. The film hits similar beats to the original, as well added something new flavors. pic.twitter.com/llyEvFBNfM — Wendy Lee Szany (@WendyLeeSzany) May 18, 2025\n\n#LiloandStitch is the best live-action remake of a Disney animated film by far! The casting features returning and new actors, and they were all solid. The story is very close to the original and will for sure make fans happy. Elvis music and the classic songs are back. pic.twitter.com/Sr4ZzOeMvC — John Nguyen (@JohnSpartan300) May 18, 2025"
        },
        {
            "id": "e648394f28711187499698975d0eee7a",
            "title": "Kid Rock, President Trump both blast Bruce Springsteen for ‘punk move’ - MLive.com",
            "url": "https://www.mlive.com/news/2025/05/kid-rock-president-trump-both-blast-bruce-springsteen-for-punk-move.html",
            "publishedAt": "2025-05-17T23:23:00Z",
            "urlToImage": "https://www.mlive.com/resizer/v2/W6TNVN5WFBFMZIVIWMVCXE6EW4.jpg?auth=6a12aa5eaac14b499db2dcebf44ade96b8e0380cc8edc52cecdadd6d33fa0a2e&width=1280&quality=90",
            "source": "mlive.com",
            "description": "Their reactions come after \"The Boss\" had some choice words for the President while on tour.",
            "content": "Both Kid Rock and President Trump are blasting Bruce Springsteen after The Boss slammed the President while on tour in Europe.\r\nSpeaking to \"Fox and Friends\" ahead of his performance at the Professio… [+2486 chars]",
            "full_content": "Both Kid Rock and President Trump are blasting Bruce Springsteen after “The Boss” slammed the President while on tour in Europe.\n\nSpeaking to \"Fox and Friends\" ahead of his performance at the Professional Bull Riders World Finals this weekend, Kid Rock says Springsteen has “Trump derangement syndrome” and called his criticism of the President a “punk move.”\n\n“Just another person with ‘TDS’ at the highest levels,” Rock told Fox’s Steve Doocy. ”To be in Europe, talking junk about our President who gets up and works his a$$ off for this country everyday and this administration is doing such great things. And thank God for him. To do that in Europe. What a punk move.\"\n\nRock’s comments come after Springsteen said this at his May 14th concert in Manchester, England, which has been seen all over YouTube.\n\n“In my home, the America I love, the America I’ve written about that has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent, and treasonous administration,”\n\nHe went on to say: “Tonight, we ask all who believe in democracy and the best of our American spirit to rise with us, raise your voices against authoritarianism and let freedom ring.”\n\nPresident Trump also responded to Springsteen’s comments on Truth Social, writing on May 16:\n\n“I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States. Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country.\n\nPresident Trump added: “Springsteen is ‘dumb as a rock,’ and couldn’t see what was going on, or could he (which is even worse!)? This dried out “prune” of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just “standard fare.” Then we’ll all see how it goes for him!\"\n\nRock added that he thinks Springsteen just wants to be in good standings in Hollywood.\n\n“This guy has, what $500 million, and he’s out there playing like he’s a working class hero? And really to me, just wants to be in good standings with the Hollywood elite. I’m proud to say that I’m more of Hollywood’s Kryptonite.”\n\nSpringsteen’s tour continues tonight in Manchester. He heads to France next weekend and will also perform in France, the Czech Republic, Germany, Spain and Italy.\n\nKid Rock is bringing his “Rock the Country” tour to 10 small towns. His next show is May 31 in York, PA with Nickelback, Hank Williams Jr. and more. The tour will be in Hastings, Michigan on June 14."
        },
        {
            "id": "42f8fd499e9800db81150033434bfda2",
            "title": "Justin and Hailey Bieber Step Out Separately Amid News of Financial Woes - TMZ",
            "url": "https://www.tmz.com/2025/05/17/justin-hailey-bieber-step-out-separately-amid-news-financial-woes/",
            "publishedAt": "2025-05-17T22:30:02Z",
            "urlToImage": "https://imagez.tmz.com/image/dd/16by9/2025/05/17/dd6e3647b1f24d65a75e4703004f19db_xl.jpg",
            "source": "TMZ",
            "description": "Justin and Hailey Bieber are each spending some time on their... don't worry, they're not breaking up -- they're just doing their own things in L.A.",
            "content": "Justin and Hailey Bieber are each spending some time on their... don't worry, they're not breaking up -- they're just doing their own things in L.A.\r\nThe two stars were both spotted in the City of An… [+1299 chars]",
            "full_content": "Justin and Hailey Bieber are each spending some time on their... don't worry, they're not breaking up -- they're just doing their own things in L.A.\n\nThe two stars were both spotted in the City of Angels Friday ... with Justin hitting up a West Hollywood café with a friend early on in the day -- looking relaxed in a red hoodie and not even hiding his face from the cameras.\n\nBieber threw on a pair of baggy black sweats, too ... a pretty comfy ensemble for his afternoon out.\n\nMeanwhile, Hailey decided to enjoy an evening out instead of a morning stroll ... going to a Beverly Hills hot spot with her pal, Lori Harvey.\n\nWhile Bieber didn't even throw on a hood to cover his mug, Hailey tried to keep a lower profile ... holding her phone up to obscure her features while heading for the car.\n\nUnclear if she just didn't want her picture taken or if she's trying to stay out of the public eye given the recent publicity surrounding her fam ... but, either way, she's not letting anyone take a clean shot of her face.\n\nWe touch on his financial issues, mental health and way more in the new doc ... so, head on over to Hulu and check it out!"
        },
        {
            "id": "5d27d9bc67c6db4de5a465d22f8f9615",
            "title": "‘Fight back’: Pedro Pascal urges Cannes to resist US political pressure - Al Jazeera",
            "url": "https://www.aljazeera.com/news/2025/5/17/fight-back-pedro-pascal-urges-cannes-to-resist-trump-policies",
            "publishedAt": "2025-05-17T22:06:09Z",
            "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2025/05/2025-05-17T140120Z_888123495_UP1EL5H12Y7JC_RTRMADP_3_FILMFESTIVAL-CANNES-EDDINGTON-1747511977.jpg?resize=1920%2C1440",
            "source": "Al Jazeera English",
            "description": "Actor calls on filmmakers to ‘keep telling the stories, keep expressing yourself and keep fighting to be who you are’.",
            "content": "Chilean-American actor Pedro Pascal has called on members of the film industry to fight back and keep expressing themselves amid what he appeared to describe as a political climate of fear in the Uni… [+1776 chars]",
            "full_content": "Actor calls on filmmakers to ‘keep telling the stories, keep expressing yourself and keep fighting to be who you are’.\n\nChilean-American actor Pedro Pascal has called on members of the film industry to “fight back” and keep expressing themselves amid what he appeared to describe as a political climate of fear in the United States.\n\n“F*** the people that try to make you scared. And fight back. This is the perfect way to do so in telling stories. Don’t let them win,” said 50-year-old Pascal, who was at the Cannes film festival for the premiere of “Eddington”.\n\n“Fear is the way that they win, for one. And so keep telling the stories and keep expressing yourself and keep fighting to be who you are,” he said.\n\n“Eddington” stars Pascal as a small-town mayor campaigning against a down-on-his-luck sheriff played by Joaquin Phoenix in a New Mexico town where tensions are simmering over COVID-19 mask policies and the Black Lives Matter protests.\n\nPascal, known for his role in dystopian video-game adaptation “The Last of Us”, added that it was “far too intimidating” for him to address a question about US President Donald Trump’s immigration policy.\n\nAdvertisement\n\n“It’s very scary for an actor participating in a movie to sort of speak to issues like this,” he said.\n\n“I’m an immigrant. My parents are refugees from Chile. We fled a dictatorship, and I was privileged enough to grow up in the US after asylum in Denmark … I stand by those protections,” the 50-year-old told a news conference in Cannes.\n\nTrump has launched a crackdown on irregular immigration and has also detained and moved to deport a number of legal permanent US residents, his policies triggering a rash of lawsuits and protests.\n\nTrump has made himself one of the main talking points in Cannes this week after announcing on May 5 that he wanted 100 percent tariffs on movies “produced in foreign lands“.\n\nActing legend Robert de Niro, who accepted a Cannes lifetime achievement award on Tuesday, also urged an audience of A-list directors and actors to resist “America’s philistine president”."
        },
        {
            "id": "234dea9b4871ae261b3f5e0da608c14d",
            "title": "Mariska Hargitay Tears Up at Cannes Premiere of 'My Mom Jayne' - variety.com",
            "url": "https://variety.com/2025/film/markets-festivals/mariska-hargitay-cannes-premiere-my-mom-jayne-secret-biological-father-1236401882/",
            "publishedAt": "2025-05-17T21:47:00Z",
            "urlToImage": "https://variety.com/wp-content/uploads/2024/05/Mariska-Hargitay.jpg?w=1000&h=563&crop=1",
            "source": "Variety",
            "description": "Mariska Hargitay also shares a bombshell secret about the identity of her real father in the documentary 'My Mom Jayne.'",
            "content": "Mariska Hargitay fought back tears while basking in a four-minute standing ovation at Saturday’s Cannes Film Festival premiere of “My Mom Jayne,” a new HBO documentary about her mother, Jayne Mansfie… [+1374 chars]",
            "full_content": "Mariska Hargitay fought back tears while basking in a four-minute standing ovation at Saturday’s Cannes Film Festival premiere of “My Mom Jayne,” a new HBO documentary about her mother, Jayne Mansfield.\n\nThe film is Hargitay’s feature directorial debut, and marks the first time she publicly dives into Mansfield’s story and legacy, nearly sixty years after her death. It’s also the first time that Hargitay shares the truth about her rumored parentage. Her biological father is an Italian singer named Nelson Sardelli, not Mickey Hargitay, the Hungarian bodybuilder who was her mother’s second husband.\n\nMansfield died in a car accident when Hargitay, who was a passenger in the vehicle with her brothers, was three years old.\n\nPopular on Variety\n\n”Tonight I’m celebrating the power that film has for me to remember somebody I didn’t have the good fortune to know or grow up with,” an emotional Hargitay said while introducing the film.\n\nHargitay was raised by Mickey Hargitay and, in the film, continues to refer to him as her “father.” Sardelli is also interviewed in the film about his love affair with Mansfield, which came when her relationship with Hargitay was having a rough patch — they would briefly get back together.\n\nMansfield was a Hollywood pin-up who rose to fame in ’50s Hollywood, appearing in the likes of “Will Success Spoil Rock Hunter?,” “The Girl Can’t Help It,” “The Wayward Bus,” and “The Loves of Hercules.” At times, her sex symbol status overshadowed her intellect and talent. After her film career cooled, Mansfield tried to reinvent herself as a nightclub performer. But she struggled with substance abuse and depression.\n\nBefore bringing Hargitay to the stage, Cannes Film Festival chief Thierry Fremaux, called the documentary “extraordinary,” and went on to say, “It’s not about the past. It’s about who we are now, and it’s a way to bring the past to the present and even to the future.”\n\nHargitay is the Emmy-winning star of NBC’s “Law & Order: Special Victims Unit.” She has played the role of Olivia Benson for over 550 episodes of “Law & Order,” and has become an advocate for sexual assault, rape and domestic abuse survivors.\n\nGrowing up, Hargitay acknowledged she had few memories of her mother and initially felt embarrassed about her sex kitten persona. As she got older, she began tLooking out at an audience that included her family, friends and producing team, an emotional Hargitay said, “It’s a very personal film, and truly a dream come true.”"
        },
        {
            "id": "fcf031281ec5061843556bfb77432f4c",
            "title": "'Die My Love' Gets 9-Minute Ovation At Cannes Premiere: Jennifer Lawrence Stars - Deadline",
            "url": "http://deadline.com/2025/05/die-my-love-cannes-ovation-jennifer-lawrence-robert-pattinson-1236402112/",
            "publishedAt": "2025-05-17T21:10:00Z",
            "urlToImage": "https://deadline.com/wp-content/uploads/2024/11/Die-My-Love.jpeg?w=1024",
            "source": "Deadline",
            "description": "Lynne Ramsay's 'Die My Love' starring Jennifer Lawrence and Robert Pattinson gets nine-ovation after its world premiere at the Cannes Film Festival.",
            "content": "One of the starrier titles to hit the Croisette this week, Lynne Ramsay’s Die My Love just had its debut at the Palais, earning a nine-minute ovation.\r\nLed by Jennifer Lawrence and Robert Pattinson, … [+1449 chars]",
            "full_content": "One of the starrier titles to hit the Croisette this week, Lynne Ramsay’s Die My Love just had its debut at the Palais, earning a nine-minute ovation.\n\nLed by Jennifer Lawrence and Robert Pattinson, the Competition entry is based on the 2017 novel by Ariana Harwicz and also stars LaKeith Stanfield, Sissy Spacek and Nick Nolte.\n\nJennifer Lawrence and co bask in 9-minutes worth of applause at ‘Die, My Love’ premiere #Cannes2025 pic.twitter.com/1FBMEa2kwG — Deadline (@DEADLINE) May 17, 2025\n\nSet in rural America, Die My Love is the portrait of a woman engulfed by love and madness. Pattinson plays her husband, and Stanfield her lover.\n\nKnown for her Cannes drama Ratcatcher, as well as films like We Need to Talk About Kevin and Morvern Callar, Ramsay’s last movie, thriller You Were Never Really Here, starred Joaquin Phoenix and won her the Cannes Best Screenplay award in 2017.\n\nRELATED: Cannes Film Festival 2025 in Photos: Richard Linklater, Zoey Deutch, Jennifer Lawrence, Robert Pattinson, ‘New Wave’ & ‘Die My Love’ Premieres\n\nWatch on Deadline\n\nRamsay directed Die My Love from her script written with Enda Walsh and Alice Burch. Producers include Justine Ciarrocchi and Lawrence on behalf of Excellent Cadaver, as well as Martin Scorsese, Andrea Calderwood, and Black Label Media’s Molly Smith, Trent Luckinbill and Thad Luckinbill.\n\nLBI’s Rick Yorn is handling domestic sales; Patrick Wachsberger’s new international sales outfit 193 has offshore.\n\nErik Pedersen and Anthony D’Alessandro contributed to this report.\n\nRELATED: Cannes Film Festival 2025: Read All Of Deadline’s Movie Reviews\n\nRELATED: Standing Ovations At Cannes: How We Clock Those Claps, Which Movie Holds The Record and Why The Industry Loves To Hate The Ritual\n\nRELATED: Full List Of Cannes Palme d’Or Winners Through The Years: Photo Gallery"
        }
    ]
}