{
    "status": "ok",
    "totalResults": 45,
    "category": "sports",
    "country": "us",
    "timestamp": "2025-05-19 14:31:30",
    "articles": [
        {
            "id": "3ff4e5de1c6533f80ef7d000a3ffc3b6",
            "title": "Scottie Scheffler bulldozes Quail Hollow to grab PGA Championship lead - The Washington Post",
            "url": "https://www.washingtonpost.com/sports/2025/05/17/scottie-scheffler-pga-championship-leader/",
            "publishedAt": "2025-05-18T04:09:00Z",
            "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M5FUP24LKUEPCJ4BUOJPEM6JE4.jpg&w=1440",
            "source": "The Washington Post",
            "description": "The world’s top-ranked golfer posted a 65 to reach 11 under and carry a three-shot lead to Sunday, when he will seek his third major title.",
            "content": "CHARLOTTE On Saturday morning of the 107th PGA Championship, the leader in the clubhouse was dullness. The course, an annual tour stop, was rendered unremarkable through familiarity. The leader board… [+6521 chars]",
            "full_content": "CHARLOTTE — On Saturday morning of the 107th PGA Championship, the leader in the clubhouse was dullness. The course, an annual tour stop, was rendered unremarkable through familiarity. The leader board, unless you happened to be related to Ryan Fox or Matthieu Pavon, felt like a sleepy cross between the John Deere Classic and a random name generator. Many of golf’s biggest stars had slammed trunks on the wrong side of the cut line. The sky above Quail Hollow spewed lightning, bringing the whole sluggish thing to a three-hour halt.\n\nLet’s hope Quail Hollow and the PGA accept apologies. A tournament derided for two days burst into a full-fledged major championship Saturday afternoon. An electric third round raised the promise of a Sunday battle royal between three of the game’s most captivating players, and then it concluded with the best golfer in the world playing at a level few can fathom, springing loose from a condensed leader board, one hand wrapped around the Wanamaker Trophy.\n\nSkip to end of carousel The Sports Moment newsletter (The Washington Post) Reporter Ava Wallace takes you through the buzziest, most engaging sports stories of the week. Sign up for the weekly newsletter End of carousel\n\nScottie Scheffler bulldozed Quail Hollow’s diabolical final stretch and seized the tournament by the throat. His 6-under-par 65, the low round of the day, vaulted him from three shots behind 36-hole leader Jhonattan Vegas into a three-shot lead at 11 under. Briefly challenged by heavyweights Bryson DeChambeau and Jon Rahm, Scheffler dusted the field in the final stretch. He made a kick-in eagle after a peerless tee shot on the drivable par-4 14th hole, then made two of three birdie chances on Nos. 16, 17 and 18, the so-called Green Mile that derailed the weekend of so many others — particularly DeChambeau.\n\nAdvertisement\n\nAt one point on the back nine, a three-way tie at 7 under among Rahm, DeChambeau and Scheffler provided the possibility of an epic Sunday. Instead it will be the No. 1 player in the world starting the day hovering above the field, the third major title — and first outside the Masters — of his career in his grasp.\n\n“There’s a lot of leader boards, so you see where guys are at at times,” Scheffler said. “But that doesn’t have an effect on how I’m going to play or what shots I’m going to hit.”\n\nScheffler surged into contention without fireworks, instead using his usual relentless dominion of fairways (13 of 14 hit) and greens (14 of 18 in regulation). Consistency is Scheffler’s superpower, but he used the spectacular to separate. His drive on the 14th hole may end up the shot of the tournament, a 3-wood drawing into the breeze that landed on the apron, bounded on to the green and rolled to inside a yard. The eagle putt pushed him into sole possession of the lead at 8 under, and he would not relinquish it.\n\nScottie being Scottie. pic.twitter.com/OWU78iGG03 — Golf on CBS ⛳ (@GolfonCBS) May 17, 2025\n\n“Did I execute it thinking I hit it to two feet or whatever it was?” Scheffler said. “There’s a little bit of luck involved when it’s over 300 yards. But I executed the shot I wanted to.”\n\nAdvertisement\n\nScheffler birdied the par-5 15th, which was normal. Then he laid waste to Nos. 16, 17 and 18, which was not. His approach shots on the course’s toughest holes settled to 12, 18 and nine feet. He missed the first, which Scheffler said was set up with his best shot of the day — a 198-yard 7-iron off a sidehill lie with wind whipping straight across. But he made the last two, pumping his fist on the 18th green as the crowd chanted: “Scot-tie! Scot-tie!”\n\n“You could hit two good shots and not end up with birdie chances,” Scheffler said.\n\nScheffler leads by three over ball-striking Swedish maestro Alex Noren, who had coached his daughter’s softball team while nursing a torn tendon in his right hamstring before playing his first tournament since October last week.\n\nBut the names below Noren could most challenge Scheffler if he stumbles. Rahm, the titan who disappeared from major contention after defecting for LIV Golf at the outset of 2024, tied for the lead at one point and finished at 6 under, five back of Scheffler and tied for fifth. DeChambeau, ever golf’s main character, led alone at 8 under after consecutive birdies on Nos. 14 and 15, only for a bogey and a double to undo him. He’s at 5 under and tied for eighth.\n\nAdvertisement\n\nIt could be a Sunday with historic stakes. All three will attempt to bag the third major title of their careers, a milestone that would vault them from a club of 89 men to one with just 46. Rahm, already a Masters and U.S. Open champion, is one great round away from playing for the career Grand Slam at the British Open at Royal Portrush this summer.\n\nStarting with the coronavirus-delayed 2020 Masters, Rahm banked eight top-10s over a span of 13 majors, winning the 2021 U.S. Open and 2023 Masters. Since he left for LIV, he had been a nonfactor. He finished tied for 45th at last year’s Masters, missed the cut at the PGA and withdrew from the U.S. Open with a foot injury. He recovered by tying for seventh at the British Open and 14th at April’s Masters, but he never threatened to win either.\n\n“I’m very happy. It’s hard to express how hungry I am for a major — about as hungry as anybody can be,” Rahm said. “I’m very happy to be in position again. This golf course is tricky, and one shot is nothing.”\n\nNobody could attest to Quail Hollow’s treachery, particularly in the final three-hole stretch, more than DeChambeau. After he made a second straight birdie on No. 15, DeChambeau raised his arms and exhorted the crowd. “I’m thinking, ‘Let’s go!’” he said. He bogeyed No. 16. Then he pulled a 9-iron on the 187-yard 17th hole and struck it “exactly how I wanted to,” he said. But the wind flipped, DeChambeau said, from neutral off the right to straight into him. The shot fell woefully short into the pond, and DeChambeau proceeded to make a double bogey.\n\nAdvertisement\n\n“That’s why golf is the worst four-letter word in the world,” DeChambeau said.\n\nThere’s one big name far out of the picture. Rory McIlroy gathered no momentum after making the cut on the number and is tied for 49th at 2 over, 13 shots behind Scheffler. His potential run at a Grand Slam was all but snuffed out.\n\nSiriusXM PGA Tour Radio reported Friday that McIlroy’s driver was tested at random by the U.S. Golf Association — as is standard before many PGA Tour events — on Tuesday and deemed nonconforming for the springiness of its face. There was no suspected malfeasance. Driver faces grow imperceptibly thinner with use, and equipment manufacturers push the limits of the rules. For the third straight day, McIlroy declined to speak with reporters after his round.\n\nBehind the 11th green, McIlroy’s second of the day, one fan, perhaps after one too many Wicked Weed IPAs, shouted upon seeing McIlroy approach the ropes, “Scottie Scheffler!”\n\n“I get mistaken for a lot of people,” McIlroy said, chuckling along with the gallery. “But not him.”"
        },
        {
            "id": "d7adc539d8b49349ec3016457c52c6c5",
            "title": "Five thoughts from Stars-Jets Game 6: Thomas Harley’s OT goal sends Dallas to next round - Dallas News",
            "url": "https://www.dallasnews.com/sports/stars/2025/05/17/five-thoughts-from-stars-jets-game-6-dallas-advances-after-winning-ot-thriller/",
            "publishedAt": "2025-05-18T03:55:11Z",
            "urlToImage": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/TOSQFPVRBNBLDHKEKJQ3WNFSSQ.jpg?auth=10083a5fa82d476e66e14a65fb11219c3cef17f6dc238d48937ac6514fea1c4d&height=630&width=1200&smart=true&quality=80",
            "source": "The Dallas Morning News",
            "description": "The Dallas Stars defeat the Winnipeg Jets in six games to reach the Western Conference finals for the third consecutive season.",
            "content": "For the third consecutive year, the Dallas Stars are going to the Western Conference finals.\r\nThe Stars outlasted the Winnipeg Jets in Game 6 on home ice, winning 2-1 in overtime to secure the series… [+4807 chars]",
            "full_content": "For the third consecutive year, the Dallas Stars are going to the Western Conference finals.\r\nThe Stars outlasted the Winnipeg Jets in Game 6 on home ice, winning 2-1 in overtime to secure the series… [+4807 chars]"
        },
        {
            "id": "15a2f7ea9eb1a345ebf230ecd26e8d16",
            "title": "Live lineup updates, results from 2025 All-Star Race Weekend - NASCAR.com",
            "url": "https://www.nascar.com/news-media/2025/05/17/live-lineup-updates-results-from-2025-all-star-race-weekend/",
            "publishedAt": "2025-05-18T03:21:53Z",
            "urlToImage": "https://www.nascar.com/wp-content/uploads/sites/7/2025/05/17/2025-may17-all-star-wilkesboro-heat-green-672x372.jpg",
            "source": "NASCAR",
            "description": "View how the 2025 NASCAR All-Star Race Weekend at North Wilkesboro Speedway works, including lineups being established in real time.",
            "content": "For the third consecutive season, NASCAR All-Star Race Weekend takes place in North Carolina at North Wilkesboro Speedway, culminating with Sunday’s All-Star Race (8 p.m. ET, FS1, MRN Radio, SiriusXM… [+7664 chars]",
            "full_content": "For the third consecutive season, NASCAR All-Star Race Weekend takes place in North Carolina at North Wilkesboro Speedway, culminating with Sunday’s All-Star Race (8 p.m. ET, FS1, MRN Radio, SiriusXM NASCAR Radio).\n\nRELATED: North Wilkesboro schedule | 2025 NASCAR All-Star Race format\n\nThe 2025 rendition at the 0.625-mile track includes several noteworthy changes. Twenty-three drivers will compete in the main event, divvied between 20 automatic qualifiers, the top two finishers in the All-Star Open and the All-Star Fan Vote winner, awarded to the highest vote-getter who did not already race their way into the show.\n\nHere is a breakdown of how the 23-car lineup in the main event is determined:\n\n– Open and All-Star drivers will begin with a combined qualifying session, with the Pit Crew Challenge taking place during qualifying. Each car will have a three-lap qualifying effort, with a mandatory pit stop on the second lap acting as the Pit Crew Challenge. The fastest pit stop — measured by the elapsed time from timing lines one pit stall before a designated pit box — will determine the Pit Crew Challenge winner. The Pit Crew Challenge results determines the order of pit-stall selection, with the winning team electing its stall for the race first.\n\n– The Qualifying speeds will determine the Open starting lineup and the lineup for each of the two All-Star heat races. The polesitter will start first in both the opening heat race and the All-Star Race itself.\n\n– Each heat race is 75 laps. All laps count, and there will be a competition break at or around Lap 30. There will be one attempt at NASCAR Overtime if necessary. Heat 1 results will determine the inside row for the All-Star Race, while Heat 2 results will determine the outside row.\n\n– The All-Star Open is 100 laps. All laps count, and there will be a competition break at or around Lap 50. There will be one attempt at NASCAR Overtime if necessary. The top two finishers plus the All-Star Fan Vote winner will transfer to the All-Star Race and start in the rear of the field.\n\n– The All-Star Race is 250 laps, a 50-circuit increase from last year. All laps count, and there will be a competition break at or around the 100-lap mark. An additional promoter’s caution could also take effect. This must occur before Lap 220 and cannot be used if a naturally occurring caution happens after Lap 200. Overtime rules apply.\n\nThis page will continuously update to track lineups and results for the Heat races, All-Star Open and the All-Star Race. Be sure to bookmark this page for updates throughout All-Star Weekend.\n\nHeat Race 1 Results\n\n*Editor’s Note: Justin Allgaier qualified the No. 5 for Kyle Larson. The No. 5 car did not run the All-Star Heat Race.\n\nFINISH START CAR DRIVER 1 1 No. 6 Ford Brad Keselowski 2 9 No. 1 Chevrolet Ross Chastain 3 3 No. 24 Chevrolet William Byron 4 10 No. 12 Ford Ryan Blaney 5 2 No. 48 Chevrolet Alex Bowman 6 7 No. 21 Ford Josh Berry 7 5 No. 45 Toyota Tyler Reddick 8 4 No. 3 Chevrolet Austin Dillon 9 6 No. 47 Chevrolet Ricky Stenhouse Jr. 10 8 No. 5 Chevrolet Kyle Larson (Did not start)\n\nHeat Race 2 Results\n\nFINISH START CAR DRIVER 1 1 No. 20 Toyota Christopher Bell 2 3 No. 22 Ford Joey Logano 3 5 No. 9 Chevrolet Chase Elliott 4 6 No. 8 Chevrolet Kyle Busch 5 8 No. 17 Ford Chris Buescher 6 10 No. 99 Chevrolet Daniel Suárez 7 2 No. 19 Toyota Chase Briscoe 8 9 No. 2 Ford Austin Cindric 9 7 No. 51 Ford Harrison Burton 10 4 No. 11 Toyota Denny Hamlin\n\nAll-Star Open Results\n\nFINISH START CAR DRIVER 1 2 No. 77 Chevrolet Carson Hocevar 2 8 No. 42 Toyota John Hunter Nemechek 3 10 No. 10 Chevrolet Ty Dillon 4 12 No. 43 Toyota Erik Jones 5 4 No. 71 Chevrolet Michael McDowell 6 6 No. 38 Ford Zane Smith 7 16 No. 16 Chevrolet AJ Allmendinger 8 14 No. 23 Toyota Bubba Wallace 9 11 No. 41 Ford Cole Custer 10 13 No. 35 Toyota Riley Herbst 11 5 No. 60 Ford Ryan Preece 12 17 No. 34 Ford Todd Gilliland 13 1 No. 88 Chevrolet Shane van Gisbergen 14 7 No. 7 Chevrolet Justin Haley 15 9 No. 54 Toyota Ty Gibbs 16 15 No. 15 Ford Cody Ware 17 3 No. 4 Ford Noah Gragson 18 18 No. 66 Ford Chad Finchum\n\nAll-Star Race Lineup: (Sun., 8 p.m. ET, FS1, MRN Radio, SiriusXM NASCAR Radio):\n\nSTART CAR DRIVER HOW DETERMINED 1 No. 6 Ford Brad Keselowski Fastest in qualifying 2 No. 20 Toyota Christopher Bell Heat Race No. 2 winner 3 No. 1 Chevrolet Ross Chastain Heat Race No. 1 second place 4 No. 22 Ford Joey Logano Heat Race No. 2 second place 5 No. 24 Chevrolet William Byron Heat Race No. 1 third place 6 No. 9 Chevrolet Chase Elliott Heat Race No. 2 third place 7 No. 12 Ford Ryan Blaney Heat Race No. 1 fourth place 8 No. 8 Chevrolet Kyle Busch Heat Race No. 2 fourth place 9 No. 48 Chevrolet Alex Bowman Heat Race No. 1 fifth place 10 No. 17 Ford Chris Buescher Heat Race No. 2 fifth place 11 No. 21 Ford Josh Berry Heat Race No. 1 sixth place 12 No. 99 Chevrolet Daniel Suárez Heat Race No. 2 sixth place 13 No. 45 Toyota Tyler Reddick Heat Race No. 1 seventh place 14 No. 19 Toyota Chase Briscoe Heat Race No. 2 seventh place 15 No. 3 Chevrolet Austin Dillon Heat Race No. 1 eighth place 16 No. 2 Ford Austin Cindric Heat Race No. 2 eighth place 17 No. 47 Chevrolet Ricky Stenhouse Jr. Heat Race No. 1 ninth place 18 No. 51 Ford Harrison Burton Heat Race No. 2 ninth place 19 No. 5 Chevrolet Kyle Larson Heat Race No. 1 tenth place 20 No. 11 Toyota Denny Hamlin Heat Race No. 2 tenth place 21 No. 77 Chevrolet Carson Hocevar All-Star Open winner 22 No. 42 Toyota John H. Nemechek All-Star Open second place 23 No. 4 Ford Noah Gragson Fan Vote winner"
        },
        {
            "id": "d0c30d3027797fe59b3d0913aab0d62b",
            "title": "Jets' Mark Scheifele Plays Game 6 vs. Stars After Father's Death, Scores Opening Goal - Bleacher Report",
            "url": "https://bleacherreport.com/articles/25197214-jets-mark-scheifele-plays-game-6-vs-stars-after-fathers-death-scores-opening-goal",
            "publishedAt": "2025-05-18T03:00:00Z",
            "urlToImage": "https://gsp-image-cdn.wmsports.io/cms/prod/bleacher-report/getty_images/2215336553_large_image_0.jpg?w=3800&h=2000",
            "source": "Bleacher Report",
            "description": "The Winnipeg Jets had star center Mark Scheifele in the lineup for Game 6 of the team's second-round series against the Dallas Stars following the death of his father, and he scored the game-opening goal in an eventual 2-1 overtime loss.",
            "content": "The Winnipeg Jets had star center Mark Scheifele in the lineup for Game 6 of the team's second-round series against the Dallas Stars following the death of his father, and he scored the game-opening … [+798 chars]",
            "full_content": "The Winnipeg Jets had star center Mark Scheifele in the lineup for Game 6 of the team's second-round series against the Dallas Stars following the death of his father, and he scored the game-opening … [+798 chars]"
        },
        {
            "id": "415f6d64b8226705912e8f8ed7854b71",
            "title": "2025 PGA Championship picks, odds: Jon Rahm, Bryson DeChambeau among 6 who can catch leader Scottie Scheffler - CBS Sports",
            "url": "https://www.cbssports.com/golf/news/2025-pga-championship-picks-odds-jon-rahm-bryson-dechambeau-among-6-who-can-catch-leader-scottie-scheffler/",
            "publishedAt": "2025-05-18T01:58:00Z",
            "urlToImage": "https://sportshub.cbsistatic.com/i/r/2025/05/18/412c95e0-b2f6-4ad6-91fa-a621950c2a8b/thumbnail/1200x675/cf719efd9c727b7e6ddab476b65a701d/jon-rahm-stare-pga-r3-g.png",
            "source": "CBS Sports",
            "description": "Will anyone catch the 54-hole leader at Quail Hollow? A come-from-behind champion could emerge from this group",
            "content": "CHARLOTTE -- There is a presence about him. There is weight to his name. There is meaning when he crosses the finish line and finds the winner's circle. Fans and players know, when he makes his move … [+10844 chars]",
            "full_content": "CHARLOTTE -- There is a presence about him. There is weight to his name. There is meaning when he crosses the finish line and finds the winner's circle. Fans and players know, when he makes his move … [+10844 chars]"
        },
        {
            "id": "5c0bd019441fd9ed2e74b2f0fc33183c",
            "title": "Dodgers Notes: Kershaw, Edman, Hernandez, Ohtani - MLB Trade Rumors",
            "url": "https://www.mlbtraderumors.com/2025/05/dodgers-notes-kershaw-edman-hernandez-ohtani.html",
            "publishedAt": "2025-05-18T01:18:09Z",
            "urlToImage": "https://cdn.mlbtraderumors.com/files/2025/05/USATSI_25990607-1024x682.jpg",
            "source": "MLB Trade Rumors",
            "description": "The latest Dodgers news includes comments from Clayton Kershaw ahead of his 2025 debut plus injury updates in the lineup. Read more at MLBTR.",
            "content": "Longtime face of the Dodgers’ franchise and future Hall of Famer Clayton Kershaw is making his 2025 season debut against the Angels this evening, and ahead of the start of his 18th season in the majo… [+3708 chars]",
            "full_content": "Longtime face of the Dodgers’ franchise and future Hall of Famer Clayton Kershaw is making his 2025 season debut against the Angels this evening, and ahead of the start of his 18th season in the majors the veteran spoke to Fabian Ardaya of The Athletic about his drive to continue his playing career.\n\n“I don’t really understand that question,” Kershaw said, as relayed by Ardaya, when asked why he’s continuing his career. “People ask me that. Why not just ride off into the sunset? I’m 37. I have a long time ahead of me. Baseball is fun. So why not? As of today, that’s my answer, yeah.”\n\nKershaw, of course, has flirted with the possibility of retirement from time to time over the years. After winning a second World Series championship with the Dodgers last year and being forced to end his season in August due to injuries that eventually required surgery on his left plantar plate and to repair a torn left meniscus over the winter. He’s been rehabbing ever since, and enters this year playing on a one-year deal that guarantees him just $7.5MM, although incentives based on starts made and time on the active roster could bring that total up to $15MM by the end of the season depending on his health.\n\nThe southpaw is already a slam-dunk Hall of Famer and one of the greatest pitchers of the 21st century, but there are some career milestones left for him to conquer. For one thing, he’s 32 strikeouts away from being the 20th pitcher in MLB history to reach 3,000 for his career. The 257 1/3 innings he’d still need in order to join the 3,000 innings club isn’t a goal he can reach this season, but after pitching 258 innings total in 2022 and ’23 it’s not hard to imagine him reaching that milestone before his 40th birthday should he decide to continue his career for that long.\n\nOne other motivator for Kershaw could be that neither of his World Series rings have come with the full experience: the Dodgers couldn’t hold a parade in 2020 due to the COVID-19 pandemic, and Kershaw was not on the field with his teammates for their championship last year due to injuries. Kershaw confirmed that his inability to participate down the stretch last year was a source of frustration.\n\n“Nobody wants to just sit around,” Kershaw said, as relayed by Ardaya. “I want to pitch, and contribute, and be a part of it. Last year was difficult. Obviously, fun to at least be a part of it and see us win and things like that. You always want to be a part of a great team. That’s what I’m trying to do.”\n\nMore from around the Dodgers…"
        },
        {
            "id": "705d802043cc0293ef99a61a418aace7",
            "title": "2025 PGA Championship TV schedule, coverage, channel, where to watch online, golf live stream, tee times - CBS Sports",
            "url": "https://www.cbssports.com/golf/news/2025-pga-championship-tv-schedule-coverage-channel-where-to-watch-online-golf-live-stream-tee-times/",
            "publishedAt": "2025-05-18T00:56:00Z",
            "urlToImage": "https://sportshub.cbsistatic.com/i/r/2025/05/13/a6db7fe0-ad09-4963-9268-f6733c6a7f85/thumbnail/1200x675/ee7c68ceac6e6d97388a59260e304afd/pga-championship-flag-2025-g.png",
            "source": "CBS Sports",
            "description": "How to watch every memorable moment of the 2025 PGA Championship on TV or streaming live online",
            "content": "The second major of the 2025 golf season enters the weekend with plenty of players looking to set a tone for the remainder of the campaign on Moving Day in Charlotte. The 2025 PGA Championship contin… [+3471 chars]",
            "full_content": "The second major of the 2025 golf season enters the weekend with plenty of players looking to set a tone for the remainder of the campaign on Moving Day in Charlotte. The 2025 PGA Championship contin… [+3471 chars]"
        },
        {
            "id": "a920b05531ceecd253aa56a8469dc78f",
            "title": "Caitlin Clark says no ‘malicious’ intent behind flagrant foul on Angel Reese: ‘Not the type of player I am’ - New York Post",
            "url": "https://nypost.com/2025/05/17/sports/caitlin-clark-no-malicious-intent-on-angel-reese-foul/",
            "publishedAt": "2025-05-18T00:50:00Z",
            "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-p7l7ohc5m-1747527501134.jpg?quality=75&strip=all&1747513126&w=1024",
            "source": "New York Post",
            "description": "If one thing is clear, it is that Caitlin Clark does not like the drama around her and fellow WNBA star Angel Reese.",
            "content": "If one thing is clear, it’s that Caitlin Clark does not like the drama around her and fellow WNBA star Angel Reese.\r\nWhen Clark was asked about the flagrant foul she committed against Reese during th… [+2469 chars]",
            "full_content": "If one thing is clear, it’s that Caitlin Clark does not like the drama around her and fellow WNBA star Angel Reese.\n\nWhen Clark was asked about the flagrant foul she committed against Reese during the Fever’s 93-58 blowout win over the Sky in Saturday’s season-opener, the 23-year-old insisted that it was a smart play.\n\n“Let’s not make it something that it’s not,” Clark said after posting the third triple-double of her career. “It was just a good play on the basketball. I’m not sure what the ref saw to upgrade it, and that’s up to their discretion. It’s a take foul to put them at the free-throw line. I’ve watched a lot of basketball in my life, that’s exactly what it was. I wasn’t trying to do anything malicious. That’s not the type of player I am.”\n\n3 Angel Reese takes a hard foul from Caitlin Clark in the second half of the Fever’s 93-58 home-opening win over the Sky on May 17, 2025. Getty Images\n\nReese said it was simply a “basketball play” when asked about it after the game.\n\nClark committed the foul during the third quarter, shoving Reese to the floor under the basket to prevent her from taking a shot.\n\nAfter review, Clark was hit with a flagrant 1, with both her and Reese being issued technicals as the two had to be separated by players from each team.\n\n3 Angel Reese looks on during the Sky’s blowout loss to the Fever in Indianapolis. Getty Images\n\nClark finished the game with a 20-points, 10 rebounds and 10 assists as the Fever won in a blowout. Reese had a strong night, too, scoring 12 points to go along with 17 rebounds.\n\nClark’s performance even grabbed the attention of LeBron James.\n\n“TRIPLE DUB CC!! Great way to kick off the season!” James posted on X.\n\nEarlier this week, Clark opened up to ESPN about how she feels more adjusted to the WNBA in her second season compared to last year’s opener when she was a rookie coming off a long season at the University of Iowa.\n\n“Honestly, I don’t even really remember last year’s [opener],” Clark told ESPN this week. “Maybe that’s a good thing. I think [this year] it’s just going out there and having fun and being confident. I’ve been in this league for a year now. I know I belong. I know I can perform, and I can make my teammates better every single night. And that’s my job.\n\n3 Caitlin Clark celebrates in the second half during the Fever’s blowout win over the Sky. Getty Images\n\n“Not everything’s going to be perfect. Give yourself grace. There’s going to be really good moments. There’s going to be moments where you struggle. So just trying to stay as neutral as I can and stay positive. But … I’ve been in these moments before, and I’m ready for them.”\n\nThe Fever next play the Dream on Tuesday night."
        },
        {
            "id": "0a42cba64022685026c60a6abb9bb935",
            "title": "The reason Bill Belichick says Jordon Hudson was copied on all North Carolina football emails - New York Post",
            "url": "https://nypost.com/2025/05/17/sports/bill-belichick-reveals-why-jordon-hudson-was-copied-on-all-unc-emails/",
            "publishedAt": "2025-05-18T00:37:00Z",
            "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-phsk2i7av-1747523830660.jpg?quality=75&strip=all&1747509447&w=1024",
            "source": "New York Post",
            "description": "It’s clear that Bill Belichick wants to put an end to all of the drama concerning Jordon Hudson.",
            "content": "It’s clear that Bill Belichick wants to put an end to all of the drama concerning girlfriend Jordon Hudson.\r\nDuring an appearance on NFL analyst Ryan Clark’s “The Pivot” podcast Friday, Belichick, 73… [+2296 chars]",
            "full_content": "It’s clear that Bill Belichick wants to put an end to all of the drama concerning girlfriend Jordon Hudson.\n\nDuring an appearance on NFL analyst Ryan Clark’s “The Pivot” podcast Friday, Belichick, 73, further clarified what exactly Hudson’s role is with North Carolina and gave the reason why she was copied on emails from the football program.\n\nBelichick said that since there was no one running the sports information department for the team, he requested Hudson, 24, to be copied on the emails.\n\n“It would be personal opportunities. It could be a speaking thing, it could be an appearance on this, or talk about this, or somebody wants whatever it happens to be an autograph, or that type of thing,” Belichick told Clark on the podcast. “And so, she’d kind of help organize that for me.\n\n“One of the first things that came out when North Carolina sent me emails saying, ‘These people want to talk to you…’ I sent back an email, ‘Can you please copy Jordon on these requests?’ so she could at least filter through them because there was nobody.\n\n“We didn’t have a sports information guy. Because all emails are shared publicly, that was taken as Jordon’s running the sports information department. And that also led to a narrative, which is just totally — she’s not doing it. I mean, there was nobody to help me sort it out, so I was asking her to do it.”\n\nBill Belichick and Jordon Hudson on the red carpet before Super Bowl LIX NFL Honors at Saenger Theatre. USA TODAY Sports via Reuters Con\n\nDuring the podcast, Belichick also broke down the reasons behind why UNC decided to forego being this year’s subject on “Hard Knocks,” saying that it was simply not a “good fit.”\n\n“The ‘Hard Knocks’ thing, just for the record, ‘Hard Knocks’ is training camp. And we’re not training camp,” Belichick said. “That’s not what we are, the drama of training camp, and who’s going to get cut and all that. We’re a season, and they don’t want that.\n\n“There’s film issues, too. But forget about the film issues. Just say you could straighten all those out. The Hard Knocks just didn’t fit for us. That’s the bottom line.”\n\nBill Belichick claimed that UNC being featured on “Hard Knocks”\n\nwas not a “good fit.” ZUMAPRESS.com\n\nBelichick’s comments come just days after he claimed that Hudson had nothing to do with UNC’s football team during a brief interview on ESPN’s “SportsCenter.”\n\n“That’s really off to the side, it’s a personal relationship. She doesn’t have anything to do with UNC football,” Belichick said during the broadcast on Tuesday."
        },
        {
            "id": "22ff38912f268c64482bd2ffb5d2eebb",
            "title": "PGA Championship 2025: Final-round tee times, pairings at Quail Hollow - NBC Sports",
            "url": "https://www.nbcsports.com/golf/news/pga-championship-2025-final-round-tee-times-pairings-at-quail-hollow",
            "publishedAt": "2025-05-18T00:35:33Z",
            "urlToImage": "https://nbcsports.brightspotcdn.com/dims4/default/a9f4015/2147483647/strip/true/crop/5400x3038+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fb2%2F2e%2F274b6d344ea6a2487a7979ca7eb4%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2214721843",
            "source": "NBCSports.com",
            "description": "Tee times and pairings for the final round of the 107th PGA Championship at Quail Hollow Club.",
            "content": "The 107th PGA Championship concludes Sunday at Quail Hollow Club.\r\nScottie Scheffler leads by three shots thanks to a brilliant finish to Round 3, where he played his final five holes in 5 under for … [+3040 chars]",
            "full_content": "The 107th PGA Championship concludes Sunday at Quail Hollow Club.\n\nScottie Scheffler leads by three shots thanks to a brilliant finish to Round 3, where he played his final five holes in 5 under for a 65.\n\nHere’s a look at the full tee times and pairings for the final round in Charlotte, North Carolina (Click here for how to watch)."
        }
    ]
}