{
    "status": "ok",
    "totalResults": 31,
    "category": "technology",
    "country": "us",
    "timestamp": "2025-05-16 14:32:44",
    "articles": [
        {
            "id": "60e171c4f7fcb2d54b8704b85fa2dfce",
            "title": "Material 3 Expressive is already making its way to Wear OS Tiles - 9to5Google",
            "url": "http://9to5google.com/2025/05/14/material-3-expressive-wear-os-tiles/",
            "publishedAt": "2025-05-15T02:53:00Z",
            "urlToImage": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2025/05/Material-3-Expressive-Wear-OS-buttons.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
            "source": "9to5google.com",
            "description": "While Material 3 Expressive is not coming to Wear OS 6 until later this year, Google is already updating Tiles with the new design language.",
            "content": "While Material 3 Expressive is not coming to Wear OS 6 until later this year, Google is already beginning to update apps and Tiles with the new design language. \r\nOne hallmark of M3 Expressive on wat… [+998 chars]",
            "full_content": "While Material 3 Expressive is not coming to Wear OS 6 until later this year, Google is already beginning to update apps and Tiles with the new design language.\n\nOne hallmark of M3 Expressive on watches is embracing the round screen with UI elements that “hug the display.” Arc-shaped buttons placed on the perimeter are an example of that.\n\nOne Pixel Watch user has already noticed them on the two Google Calendar Wear OS Tiles: Next event (“Calendar”) and Next tasks (“More”). In comparison, the previous design makes use of pill-shaped buttons that are much smaller. The new approach gives users a larger touch target to hit.\n\nOld vs. new (Credit: u/TurningTablesAgain)\n\nAdvertisement - scroll for more content\n\nGoogle Calendar for Wear OS was updated to version 2025.18.1 today, though we’re not seeing the Material 3 Expressive buttons live on watches we checked today. There’s presumably a server-side component to this rollout.\n\nMaterial 3 Expressive will debut on the Pixel Watch later this year, but app updates are already underway. More broadly, Wear OS Tiles with M3E will get much denser with new layouts that show and offer much more.\n\nMore on Material 3 Expressive:"
        },
        {
            "id": "69ad0248c874492cb80d4109ee0ad4fb",
            "title": "The latest Apple Maps update will bring out your bougie side - TechCrunch",
            "url": "https://techcrunch.com/2025/05/14/the-latest-apple-maps-update-will-bring-out-your-bougie-side/",
            "publishedAt": "2025-05-14T20:55:40Z",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-1224111372_9d6ea2.jpg?resize=1200,777",
            "source": "TechCrunch",
            "description": "Apple Maps announced a collaboration with the MICHELIN Guide, The Infatuation, and Golf Digest to help users find recommended restaurants and golf courses",
            "content": "Apple Maps announced a collaboration with the MICHELIN Guide, The Infatuation, and Golf Digest to help users find recommended restaurants and golf courses in their area.\r\nStarting in the U.S., users … [+848 chars]",
            "full_content": "Apple Maps announced a collaboration with the MICHELIN Guide, The Infatuation, and Golf Digest to help users find recommended restaurants and golf courses in their area.\n\nStarting in the U.S., users will be able to filter their Maps searches to see restaurants with MICHELIN ratings, which denote exceptional dining experiences. But if you’re on the go, you’re probably not making a last-minute MICHELIN booking — but options from The Infatuation, a restaurant recommendation website, can help fill in the gaps.\n\nThough the MICHELIN Guide is most well-known for its dining expertise, it also offers hotel recommendations and booking services, which will also be available on Apple Maps.\n\nThe Golf Digest integration on Maps will function similarly, allowing users to filter their searches to find recommended golf courses — but we imagine more users will be looking for places to eat, rather than to tee off.\n\nThese partners will also contribute to Apple Maps’ curated guides, which can help travelers find their way to top destinations on a visit."
        },
        {
            "id": "59efda8ed5ea74d070e11f3416fb0132",
            "title": "New 2025 iPad Now Costs Less Than AirPods Pro, Amazon Clears Out Stock - Gizmodo",
            "url": "https://gizmodo.com/new-2025-ipad-now-costs-less-than-airpods-pro-amazon-clears-out-stock-2000602403",
            "publishedAt": "2025-05-14T20:05:54Z",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/12/ipad-.jpg",
            "source": "Gizmodo.com",
            "description": "You can finally treat yourself to an Apple product that no longer costs a fortune.",
            "content": "It’s incredible to receive a brand-new 2025 iPad (which is powered by Apple’s advanced A16 chip) at an all-time low price on Amazon. Originally listed for $349 for the 128GB WiFi model, this 11-inch … [+2188 chars]",
            "full_content": "It’s incredible to receive a brand-new 2025 iPad (which is powered by Apple’s advanced A16 chip) at an all-time low price on Amazon. Originally listed for $349 for the 128GB WiFi model, this 11-inch iPad had been selling for $319 just hours ago but has now dipped below the $300 threshold to an unbeatable price of $299. For a machine that can easily transform into a laptop alternative for most individuals, this price is truly mindblowing.\n\nSee at Amazon\n\nIt Can Replace Your Laptop\n\nThe 2025 iPad 11-inch is a real monster and it changes everything you know a tablet can be: It features the A16 chip which is the same high-end processor that powers Apple’s top-of-the-line devices (iPhone 16) for massive performance on everything from creative tasks to multitasking and graphics-intensive gaming. This kind of performance is coupled with all-day battery life and means you can rely on your iPad from morning meetings to late nights of streaming.\n\nThis base model has a ample 128GB so there’s more than enough space for your favorite apps, creative pursuits, documents, and high-definition video. With Wi-Fi 6 turned on, you’ll experience scorchingly quick downloads, seamless streaming and fast file transfers, which makes it perfect for work and play.\n\nThe 11-inch Liquid Retina display is simply breathtaking, and this is why we love Apple: Colors pop, details are crystal clear and the True Tone feature adjusts the display’s color temperature automatically to match your surroundings. The responsiveness of the screen is also a note-taker’s and artist’s dream especially when paired with the Apple Pencil (USB-C), to turn the iPad into a digital canvas.\n\nApple’s iPadOS introduces a new standard of productivity and flexibility to the device: Multitasking is seamless with the capability to run multiple apps side by side, utilize drag-and-drop between windows and leverage a massive ecosystem of more than a million apps created exclusively for iPad. Pre-installed apps such as Safari, Messages and Keynote are simple to get started with, while the App Store provides unlimited possibilities for creativity.\n\nWith its all-but-unanimous praise (an average review score of 4.7 out of 5 from over 1,200 reviews), the 2025 iPad 11-inch is a productivity monster. For under $300, this is an opportunity to own a device that can literally do it all, for a price that feels like too good to be true.\n\nSee at Amazon"
        },
        {
            "id": "a948a40a80a2fa35499c71bdf4d00706",
            "title": "Microsoft starts testing ‘Hey, Copilot!’ in Windows - The Verge",
            "url": "https://www.theverge.com/news/667167/windows-hey-copilot-ai-wake-word-voice-activation",
            "publishedAt": "2025-05-14T19:48:22Z",
            "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/Hey-Copilot-approved.jpg?quality=90&strip=all&crop=4%2C17.701315824692%2C88.4%2C82.298684175308&w=1200",
            "source": "The Verge",
            "description": "Microsoft’s AI assistant is getting support for a wake word in Windows 11, “Hey, Copilot.”",
            "content": "Beta testers can try hands-free access to the AI app in Windows 11.\r\nBeta testers can try hands-free access to the AI app in Windows 11.\r\nMicrosoft is testing a feature for Copilot Voice that will le… [+1400 chars]",
            "full_content": "is a senior editor following news across tech, culture, policy, and entertainment. He joined The Verge in 2021 after several years covering news at Engadget.\n\nMicrosoft is testing a feature for Copilot Voice that will let Windows 11 users start a conversation with the app by saying “Hey Copilot!” Windows Insiders who have the updated app can try it out once they opt in and activate the feature.\n\nAccording to a blog post, you’ll need to enable the feature for it to be able to respond to the wake word. Also, the update isn’t available to all Insiders right away, but it is rolling out to testers worldwide who have English set as their display language. To find out if you have it, check your Copilot app version to see if it’s 1.25051.10.0 or higher.\n\nImage: Microsoft\n\nOnce it’s activated, you’ll see the Copilot microphone floating UI on the bottom of your screen and get a chime notification that shows it’s listening in.\n\nThe FAQ also says that it’s using an on-device wake word spotter with a 10-second audio buffer, and isn’t sending clips to the cloud or saving them locally. It can recognize the wake word even if you’re offline, but for the Copilot Voice feature to actually do anything, you will need internet access so that it can access cloud processing capabilities."
        },
        {
            "id": "6b12ce99befb37e936921c9ce4a18a9d",
            "title": "The frontier: A trading algorithm that writes itself and evolves - Forexlive",
            "url": "https://www.forexlive.com/news/the-frontier-a-trading-algorithm-that-writes-itself-and-evolves-20250514/",
            "publishedAt": "2025-05-14T19:17:00Z",
            "urlToImage": "https://images.forexlive.com/images/quant%20models_id_38f21aa8-4dbf-4d47-ab88-a0960f4ff00e_size975.jpg",
            "source": "ForexLive",
            "description": "For at least the past 25 years, human traders have been anxious about being replaced by machines and yet -- today -- there are more people trading than ever.",
            "content": "High risk warning:\r\nForeign exchange trading carries a high level of risk that may not be suitable for all investors. Leverage creates additional risk and loss exposure. Before you decide to trade fo… [+2129 chars]",
            "full_content": "For at least the past 25 years, human traders have been anxious about being replaced by machines and yet -- today -- there are more people trading than ever. I'd argue that many of them shouldn't be trading and note that many of the human tasks in markets have been replaced but the future is hard to predict.\n\nThere is a cottage industry around writing and (mostly) selling trading algos. Their success has been mixed at best and it's mostly been an avenue for grift in the retail space but Jim Simons made ungodly amounts of money quant trading and relatively simplistic methods (though we don't know the details).\n\nIn any case, could this be the next frontier in trading technology?\n\nGoogle DeepMind today pulled the curtain back on AlphaEvolve, an artificial-intelligence agent that can invent brand-new computer algorithms — then put them straight to work inside the company’s vast computing empire.\n\nAlphaEvolve pairs Google’s Gemini large language models with an evolutionary approach that tests, refines, and improves algorithms automatically. The system has already been deployed across Google’s data centers, chip designs, and AI training systems — boosting efficiency and solving mathematical problems that have stumped researchers for decades.\n\nThat description comes from a Venturebeat report on the DeepMind announcement today.\n\nThe idea is that the model combines the creativity of a large language model with algorithms that can scrutinize the model’s suggestions to filter and improve solutions.\n\nI can almost guarantee that there are people pouring money into this idea in markets. Unfortunately, the same technology is going to be put to military use and we'll be lucky to survive it."
        },
        {
            "id": "374d4c432c676e48418612fbbc56b9b4",
            "title": "89 Million Steam Accounts Allegedly Compromised in a Data Breach. Our Advice: Change Your Password Now - CNET",
            "url": "https://www.cnet.com/tech/services-and-software/89-million-steam-accounts-allegedly-compromised-in-a-data-breach-our-advice-change-your-password-now/",
            "publishedAt": "2025-05-14T18:19:00Z",
            "urlToImage": "https://www.cnet.com/a/img/resize/c9034b8a2d8895cbc2776457d8f72a3703ad4437/hub/2025/05/14/8843feac-f094-4fb6-9622-7a943db60da7/gettyimages-1234720850.jpg?auto=webp&fit=crop&height=675&width=1200",
            "source": "CNET",
            "description": "Changing your password is a good start, but there are other steps you should take to protect yourself.",
            "content": "A recent data breach has reportedly affected users of Steam, Valve's wildly popular online gaming store and distribution platform.  \r\nThe origin of the breach has not yet been confirmed, and Valve di… [+1667 chars]",
            "full_content": "Steam has denied that a reported data breach endangered its users' personal information.\n\nFirst reported by Underdark, a cybersecurity company, on LinkedIn, information for 89 million Steam accounts popped up for sale on the dark web, including text messages with validation codes and the phone numbers they were sent to.\n\nSteam, Valve's popular online gaming store and distribution platform, responded to the news last night with a statement saying, \"We have examined the leak sample and have determined this was NOT a breach of Steam systems.\"\n\nThe company said that the leaked data did not link the phone numbers with Steam accounts, passwords, payment information or other personal data.\n\n\"Old text messages cannot be used to breach the security of your Steam account,\" the statement said. \"Whenever a code is used to change your Steam email or password using SMS, you will receive a confirmation via email and/or Steam secure messages.\"\n\nYou do not need to change your passwords or phone numbers as a result of this event, but it's a good reminder to treat any account security messages that you haven't explicitly requested as suspicious.\n\nThe origin of the breach has not yet been confirmed, and Valve did not immediately respond to CNET's request for comment. The data allegedly includes users' one-time passwords and phone numbers. The threat actor says it's auctioning off this information for $5,000.\n\nSteam said that users don't need to update their passwords, which CNET recommended in a previous version of this story. But it did recommend regularly checking your Steam account security.\n\nHowever, whenever you're worried about a security breach, changing your password is a smart move. If you have a Steam account, it doesn't hurt to change your password now to keep your game library -- and financial information -- secure. Here are some additional ways to protect your account.\n\nHow to protect your Steam account\n\nEven if it may not be necessary, it doesn't hurt for Steam account holders to change their passwords. At the very least, this will help secure your account.\n\nIf you want to take it a step further, you can use a password manager to create complex passwords and store them for you.\n\nSteam also recommended setting up the Steam Mobile Authenticator, which enables two-factor authentication with your phone number and email. 2FA is an easy step that will make it much more difficult for unauthorized users to access your account. Steam doesn't support the use of hardware security keys, which can offer another level of protection, so its in-house 2FA is going to be your best bet to protect your account.\n\nIf you already have 2FA enabled, be sure to check your email for any suspicious activity linked to your Steam account.\n\nIf you've recently received any one-time password text messages that you did not request, ignore them and change your password again. In the coming weeks, keep an eye out for any phishing attempts disguised as game product offers or other Steam-related content."
        },
        {
            "id": "65c4fc6165b7b265d91e859f8ad94deb",
            "title": "12 Games Are Coming To PS Plus Game Catalog Next Week - Kotaku",
            "url": "https://kotaku.com/ps-plus-extra-free-games-may-2025-catalog-stalker-ps5-1851780673",
            "publishedAt": "2025-05-14T17:45:00Z",
            "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/957f2bbd5d3a7e85548176fda70b54b3.jpg",
            "source": "Kotaku",
            "description": "Technically, the STALKER trilogy is three games so that's why its 12 and not 10",
            "content": "Summer doesnt officially start until later in June, but around where I live the days are getting hotter and the nights arent as cool as before. Thats fine. I dont need the outdoors. Ive got new PS Pl… [+1626 chars]",
            "full_content": "Summer doesn’t officially start until later in June, but around where I live the days are getting hotter and the nights aren’t as cool as before. That’s fine. I don’t need the outdoors. I’ve got new PS Plus games to download and play, like Sand Land, Battlefield V, and a whole trilogy of classic STALKER games.\n\nThis Cool New Retro Console Is A Great Gift For Atari Fans CC Share Subtitles Off\n\nEnglish view video This Cool New Retro Console Is A Great Gift For Atari Fans\n\nThis Cool New Retro Console Is A Great Gift For Atari Fans CC Share Subtitles Off\n\nEnglish This Cool New Retro Console Is A Great Gift For Atari Fans\n\nOn May 14, PlayStation officially announced the next round of PS Plus Extra and Premium games that will be added to the subscription service’s game catalog. All of these newly revealed games will be available to start downloading and playing on May 20.\n\nAdvertisement\n\nPerhaps I’ll give Battlefield V another chance. I wasn’t a big fan of the game when it first launched, but maybe returning to it after all the updates and with a ton of new players might win me over. It’s also great to see the classic STALKER games being added to the PS Plus catalog. I imagine some survival shooter sickos are about to discover some new favorites.\n\nAdvertisement\n\nRemember, to access, download, and play these games you’ll need to be an active PS Plus Extra or Premium tier subscriber. Essential tier subscribers don’t get access to the game catalog. And if your subscription runs out in the future, you’ll no longer be able to play these games.\n\nAdvertisement\n\nAnyway, here’s the full list of games being added to PS Plus and its various tiers next week:\n\nPlayStation Plus Extra And Premium\n\nSoul Hackers 2 | PS5\n\n\n\nPS5 Sand Land | PS4, PS5\n\nPS4, PS5 Five Nights at Freddy’s: Help Wanted – Full Time Edition | PS4, PS5\n\n\n\nPS4, PS5 Battlefield V | PS4\n\n\n\n| PS4 S.T.A.L.K.E.R.: Legends of the Zone Trilogy | PS4, PS5\n\n\n\n| PS4, PS5 Granblue Fantasy Versus: Rising | PS4, PS5\n\n\n\n| PS4, PS5 Humankind | PS4, PS5\n\n\n\n| PS4, PS5 Story of Seasons: A Wonderful Life | PS5\n\n| PS5 Gloomhaven Mercenaries Edition | PS4, PS5\n\nPlayStation Plus Premium"
        },
        {
            "id": "26f9f0d5f4259ddbc9a2703abf50b7c8",
            "title": "New Switch 2 specs show large performance dip in undocked mode - Ars Technica",
            "url": "https://arstechnica.com/gaming/2025/05/new-switch-2-specs-show-large-performance-dip-in-undocked-mode/",
            "publishedAt": "2025-05-14T16:40:43Z",
            "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/Screenshot-2025-04-02-at-9.17.48 AM-1152x648.png",
            "source": "Ars Technica",
            "description": "Digital Foundry also says Game Chat “has a significant impact on system resources.”…",
            "content": null,
            "full_content": "While Nintendo offered an official spec sheet for the Switch 2 last month, neither it nor an accompanying blog post from chip-making partner Nvidia provided many specific numbers for the upcoming console's raw CPU and GPU horsepower. Today, though, Digital Foundry is offering what it calls \"rock-solid confirmation\" of the system's final tech specs, adding detail and clarity to years-old leaks and educated speculation on the system's internals (which turned out to be largely reliable in the end).\n\nUnlike the Switch—which basically used an off-the-shelf Nvidia Tegra T1 chip—Digital Foundry says the Switch 2 is using \"very much custom silicon designed specifically for Nintendo and for mobile gaming.\" You can see what that means in terms of raw hardware performance in the tables below.\n\nSwitch 2 Switch Docked\n\n(Quality) Undocked\n\n(Performance) Docked\n\n(Quality) Undocked\n\n(Performance) CPU clock 998 Mhz 1101 Mhz 1020 Mhz 1020 Mhz GPU clock 1007 Mhz 561 Mhz 768 Mhz 460 Mhz Ray-tracing 20 gigarays/sec 10 gigarays/sec N/A N/A Memory bandwidth 102GB/s 68GB/s 25.6GB/s 21.3GB/s\n\nSwitch 2 Switch Total System\n\n(reserved) Total System\n\n(reserved) CPU cores 8 2 4 1 Memory 12GB (LPDDR5X) 3GB 4GB 0.8GB\n\nSwitch 2 Switch CPU architecture 8x ARM Cortex A78C 4x ARM Cortex A57 GPU architecture Ampere Maxwell CUDA Cores 1536 256 Memory interface 128-bit/LPDDR5 64-bit/LPDDR4\n\nGlancing at those numbers, it's easy to pick out a large difference between the system's performance in docked and undocked modes; its GPU clock and memory bandwidth both increase substantially when plugged into a TV. Those differences could help explain why the Switch 2 dock uses an active cooling fan, unlike the much simpler TV-connection dock on the original Switch.\n\nTo put the gap in a bit more context, the Switch 2's miniaturized Ampere GPU is rated for 3.072 TFLOPs when docked, versus just 1.71 TFLOPs while undocked. While those kinds of numbers aren't great for direct comparisons to other gaming devices, they do highlight just how much potential graphics horsepower Switch 2 players will be giving up when playing away from a TV.\n\nOddly enough, the Switch 2 CPU clock speed actually increases when the console is played outside the dock. While there's no official explanation for this oddity, Digital Foundry theorizes it could be an attempt to partially make up for the system's lower memory bandwidth when undocked."
        },
        {
            "id": "0cad756235de72154090782971eadea2",
            "title": "Square Enix cancels Kingdom Hearts mobile game - The Verge",
            "url": "https://www.theverge.com/news/666867/kingdom-hearts-missing-link-canceled",
            "publishedAt": "2025-05-14T15:22:03Z",
            "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/KHML02.png?quality=90&strip=all&crop=0%2C3.4613147178592%2C100%2C93.077370564282&w=1200",
            "source": "The Verge",
            "description": "Square Enix has announced that it is cancelling its mobile game Kingdom Hearts Missing Link while assuring players Kingdom Hearts 4 development is going well.",
            "content": "But Squares hard at work on KH4 and a new project too.\r\nBut Squares hard at work on KH4 and a new project too.\r\nSquare Enix has announced that it is cancelling the mobile spinoff Kingdom Hearts Missi… [+2035 chars]",
            "full_content": "Square Enix has announced that it is cancelling the mobile spinoff Kingdom Hearts Missing-Link. In a statement on the game’s website, Square Enix apologized to fans who were anticipating the game. The announcement also mentioned that Square was still hard at work on Kingdom Hearts IV perhaps to allay fears that this cancellation might indicate problems for other games in the sprawling Disney video game series.\n\nKingdom Hearts: Missing-Link was announced in 2022 alongside Kingdom Hearts IV. It was billed as a mobile action game that made use of GPS technology to give players the ability to “travel the world without stepping outside,” according to one trailer. However, apparently that goal was a bit too lofty as Square Enix wrote, “We determined that it would be difficult for us to offer a service that players would find satisfactory over a long period of time, leading us to the decision to cancel development.”\n\nSquare Enix’s statement provided insight as to the reason for a game’s cancellation – something most game studios do not often offer. And while making any game is a miracle, making a successful live-service game is like asking for lightning to strike the head of a pin in a forest. After all, how many live-service games (some of them even made by Square Enix itself) were released only to die shortly thereafter while the concurrent player counts for Fortnite, Roblox, and Call of Duty remain largely unmoved. So it’s a rare and refreshing bit of honesty, especially in an industry as opaque as game development, that Square Enix was willing to name the reason for cancelling Missing-Link and I hope more studios follow suit in the future.\n\nBut it’s not all bad news for Square Enix. As reported by Gematsu, Square has also started a new partnership with the Tokyo Broadcasting System Television. Known as TBS, it’s a Japanese TV and media company which produced Takeshi’s Castle – an internationally popular physical competition show known in the US as Most Extreme Elimination Challenge or MXC. TBS started its own games division in 2023 and with Square Enix, the two companies will work on a new gaming property."
        }
    ]
}