{
    "status": "ok",
    "totalResults": 9,
    "category": "entertainment",
    "country": "us",
    "timestamp": "2025-05-16 14:32:01",
    "articles": [
        {
            "id": "330dd98f4d722ebee5f611cc18edfefc",
            "title": "Cassie testifies on Kid Cudi relationship and alleged violence during Diddy trial - The Washington Post",
            "url": "https://www.washingtonpost.com/entertainment/music/2025/05/14/cassie-ventura-testimony-diddy-trial-day-3/",
            "publishedAt": "2025-05-15T01:51:40Z",
            "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TBLYHE4XUGLJANHL3RT2L25XPM.jpg&w=1440",
            "source": "The Washington Post",
            "description": "During testimony in Sean “Diddy” Combs’s sex-trafficking trial, Cassie Ventura shared details about Combs’s alleged abuse and her relationship with rapper Kid Cudi.",
            "content": "NEW YORK Star witness Casandra Cassie Ventura continued bombshell testimony in her former partner Sean Diddy Combss sex-trafficking trial on Wednesday, revealing more details about the music moguls a… [+5752 chars]",
            "full_content": "NEW YORK — Star witness Casandra “Cassie” Ventura continued bombshell testimony in her former partner Sean “Diddy” Combs’s sex-trafficking trial on Wednesday, revealing more details about the music mogul’s alleged abuse with accusations of rape, arson and blackmail. During the singer’s second day of testimony at the Daniel Patrick Moynihan U.S. Courthouse in Manhattan, Ventura shared the $20 million settlement amount she received in her explosive 2023 lawsuit against Combs.\n\nVentura said her litigation against Combs is over and that she is testifying against him “to do the right thing.”\n\nplay Play now NaN min Follow on Podcast episode Spotify Apple Google Amazon\n\nJurors were also shown explicit photos of freak-offs — the drug- and sex-fueled parties at the center of the prosecution’s case against Combs, who is charged with five criminal counts of racketeering conspiracy, sex trafficking and transportation to engage in prostitution. He has pleaded not guilty to all charges and faces 15 years to life in prison if convicted on all counts.\n\nAdvertisement\n\nAhead of the defense team’s plans to cross-examine Ventura on Thursday, here’s what we learned during her second day of testimony:\n\nVentura recounts alleged rape by Combs\n\nOn the stand, Ventura was asked to describe Combs’s alleged rape of her, which she said took place at her home in 2018 after they had broken up.\n\nEarlier that day, the singer said she and Combs had a pleasant lunch together, describing their conversation as “closure,” since she had begun a relationship with Alex Fine, who is now her husband. Later, when the two returned to Ventura’s home, she says that Combs raped her.\n\nThe incident was first mentioned in the 35-page lawsuit Ventura brought against Combs in November 2023. During Wednesday’s testimony, she revealed that the lawsuit was settled for $20 million. She added that she had been writing a book about her experiences when he paid her.\n\nAdvertisement\n\n“I wanted to be compensated for the time and the pain and the many, many years of having to try to fix my life,” Ventura said. It is unclear if the terms of her settlement barred her from releasing a book.\n\nVentura identified an alleged victim who is expected to testify\n\nProsecution showed Ventura an image of “Mia,” an alleged victim who will be testifying under a pseudonym, and asked the singer if she recognized her. Ventura said she did.\n\nIn the prosecution’s opening statements on Monday, Assistant U.S. Attorney Emily Johnson referred to Mia as a former Combs employee who was sexually assaulted multiple times by Combs. Johnson also described a girlfriend of Combs’s using the pseudonym “Jane,” who began dating Combs in 2020.\n\nJohnson alleged that Combs also forced Jane to perform in freak-offs, videotaping the events and then blackmailing her with the videos. They were still in a relationship as recently as last year, Johnson added.\n\nAccusations of blackmail using freak-off videos\n\nVentura said she felt “trapped” on a commercial flight home to New York from the Cannes film festival — the year was unclear from testimony — as Sean Combs played freak-off videos for her on the plane and threatened to release them.\n\nAdvertisement\n\nVentura described being terrified of the embarrassment that would ensue if he leaked those videos. “I didn’t want to feel scared anymore,” she said. “He could put these videos out and ruin everything.” The footage, Ventura added, would “make me out to be somebody that I’m not in an unfair way.”\n\nAfter their flight landed, they had dinner in New York. That same night, they had another freak-off.\n\nVentura admits to being violent\n\nCombs’s defense attorneys are expected to argue that Ventura and Combs had a mutually toxic relationship and that she was also violent toward him. Prosecutors asked Ventura to volunteer some of these episodes before she is cross-examined.\n\nVentura testified that she once became enraged when she learned a woman took a photo of her while she was drunk at a birthday party in a bar. She found the woman at her car, she said, “pulled her out and … I was punching her in the head.”\n\nAdvertisement\n\nWhen asked by the government if she ever initiated a physical fight with Combs, Ventura said yes.\n\nIn one such incident, Ventura said she punched Combs in the face as hard as she could as they were riding in a Cadillac Escalade in Los Angeles. Afterward, she said Combs’s “whole demeanor” changed. “His eyes went black” and he attacked her, she alleged. Later, she said her face was “just knots and bleeding. Swollen everything.”\n\nFreak-offs lead Ventura to opiate abuse\n\nVentura said she had an “ongoing, off-and-on addiction to opiates,” which she used to “come down” from the drugs she had taken earlier during freak-offs. “Opiates made me feel numb, which is why I relied on them so heavily,” Ventura said.\n\nVentura testified that Combs would procure drugs like Vicodin, oxycodone and Percocet for her, sometimes using his employees to fill prescriptions. She would take opiates with or without him present, she said, until at one point she was using them daily. Ventura said she went to rehab in 2020.\n\nVentura talks about her relationship with Kid Cudi\n\nWhile on the stand, Ventura was asked about her previous relationship with rapper Kid Cudi, whose legal name is Scott Mescudi. The singer said she dated him for a brief period in 2011 during a break in her on-and-off relationship with Combs. According to her testimony, the producer found out about the pair after going through her phone during a freak-off in Los Angeles and lunged at her with a wine bottle opener.\n\nAdvertisement\n\nUpon arriving to her family’s home in Connecticut for the Christmas holidays that year, pictures were taken, showing bruises on her buttocks and upper right thigh — the result of a previous visit to Combs’s home to try to “resolve” the Mescudi issue, she said. Ventura said she told her mom about Combs’s physical violence — but not the freak-offs. She said she “couldn’t hurt her like that … I was also just terrified. It’s not normal.”\n\nVentura also discussed an alleged arson incident that she claimed Combs orchestrated against Mescudi. Her settled lawsuit accused Combs of threatening to blow up the rapper’s car during Paris Fashion Week in 2012. Around that time, Mescudi’s car exploded in his driveway, her lawsuit claimed. A spokeswoman for Mescudi told The New York Times, “This is all true.”"
        },
        {
            "id": "3811027f35b500157760057b0153afa5",
            "title": "Diddy Sued for Alleged Rape by Woman Who Says His Penis Was Tootsie Roll-Sized - TMZ",
            "url": "https://www.tmz.com/2025/05/14/diddy-sued-alleged-rape-woman-penis-tootsie-roll-size/",
            "publishedAt": "2025-05-14T23:48:04Z",
            "urlToImage": "https://imagez.tmz.com/image/04/16by9/2025/05/14/04f8bdbca760441da84b7358f578ccad_xl.jpg",
            "source": "TMZ",
            "description": "Diddy raped a woman at his Manhattan apartment, but the woman said she was actually relieved when he whipped out his penis ... because she knew it wouldn't hurt that much due to a lack of length and girth -- at least according to a new lawsuit.",
            "content": "Diddyraped a woman at his Manhattan apartment, but the woman said she was actually relieved when he whipped out his penis ... because she knew it wouldn't hurt that much due to a lack of length and g… [+2409 chars]",
            "full_content": "Diddy raped a woman at his Manhattan apartment, but the woman said she was actually relieved when he whipped out his penis ... because she knew it wouldn't hurt that much due to a lack of length and girth -- at least according to a new lawsuit.\n\nThe Bad Boy Records founder is being sued by a Jane Doe who claims they met in May 2001 ... she says they hung out a few times without incident at his Manhattan recording studio, night clubs and a restaurant -- but things went south in July 2001 on their fourth meeting.\n\nShe claims after a night out at the club, Diddy took her back to his apartment ... leading her to his bedroom, where he locked the door and pushed her down onto the bed on her back, placing his hand around her throat and telling her, \"I'm going to suck the life out of you.\"\n\nThe woman claims Diddy released his grip on her neck and then held her arm down, using his other hand to unbuckle his belt and pants, before \"pulling out his erect bare-skinned penis which appeared to be the length and girth of a large Tootsie Roll.\"\n\nIn her suit, she recalls feeling \"relieved\" by the size of Diddy's penis ... claiming she knew it wouldn't hurt as much when he raped her due to a lack of length and girth ... saying she thought his penis was \"an itty-bitty Diddy.\"\n\nThe woman claims she screamed for Diddy to get off of her and stop and told him she didn't want to have sex ... but she says he overpowered her and did not stop penetrating her until he was close to climaxing.\n\nShe claims he pulled out and ejaculated on her body. She says he then backed away from her, and she slid off the bed and went to a bathroom to wipe his semen off her.\n\nThe woman claims when she exited the bathroom Diddy was naked on the bed, and she ran for the door and unlocked it. She says a bodyguard was standing outside the room and she asked him where the exit was, and he gestured downstairs. She says she left the place and Diddy's staff drove her and her friend home.\n\nShe claims Diddy called her a few times after the alleged rape and even invited her to one of his white parties ... but she says she did not respond to his calls.\n\nSince the alleged rape, the woman claims she's found it hard to be vulnerable and alone with men and has withdrawn and become a shell of herself. She also claims she needed psychotherapy to confront and address the trauma and move on.\n\nShe says she's suffered physical abuse, emotional abuse, trauma, injury, and psychological damage as a result of Diddy's actions.\n\nThe woman is going after Diddy for damages."
        },
        {
            "id": "0df2138a22cec67df66f0c2a7235276a",
            "title": "HBO Max is mocking itself with memes as Warner Bros. Discovery rolls out yet another rebrand - Business Insider",
            "url": "https://www.businessinsider.com/hbo-social-team-knows-rebrand-is-absurd-theyre-leaning-in-2025-5",
            "publishedAt": "2025-05-14T21:09:00Z",
            "urlToImage": "https://i.insider.com/682506783fe8d3928365e205?width=1200&format=jpeg",
            "source": "Business Insider",
            "description": "The social team at HBO Max probably knew it would be made fun of for backpedaling on its name, so it joined in on the roast.",
            "content": "The internet is making fun of Max for changing its name to HBO Max (for the second time). But no one is mocking the re-rebrand with as much gusto as Max itself.\r\nThe company is poking fun at the swit… [+2212 chars]",
            "full_content": "Warner Bros. Discovery distributed this meme to the media when it announced it was changing the name of its streaming service back to HBO Max.\n\nWarner Bros. Discovery distributed this meme to the media when it announced it was changing the name of its streaming service back to HBO Max. Warner Bros. Discovery\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThe internet is making fun of Max for changing its name to HBO Max (for the second time). But no one is mocking the re-rebrand with as much gusto as Max itself.\n\nThe company is poking fun at the switch by posting conclave references on TikTok, Harry Potter memes on Instagram, and teasing X on the social platform.\n\nThe self-deprecation is not limited to Max's main accounts. An Instagram page for the HBO show, \"Curb Your Enthusiasm,\" also chimed in, for example.\n\nMax's social team is going all out with the jokes because it probably knows that backpedaling to an earlier name is silly. It's much better to laugh with the internet than be laughed at.\n\n\"This is something where they were like, 'We're just going to get totally excoriated, so at least we can be in on the joke a little bit,'\" Jeremy Goldman, a senior director of client briefings at EMARKETER, told Business Insider.\n\nFor those not acquainted with the confusing name history of the Warner Bros. Discovery streaming service, Max has bounced around from \"HBO Go,\" to \"HBO Now,\" to \"HBO Max,\" then \"Max,\" and now back to \"HBO Max.\"\n\nThere were probably business reasons for each of the name changes that made sense in a boardroom, but the frequent switches have been confusing for the average consumer (my Roku remote still has an HBO Now button).\n\nWhile WBD put out a relatively straight press release today about the rebrand, the company distributed a meme to go along with it, as my colleague Peter Kafka, who dove into the business implications of the rebrand, pointed out.\n\nOn social media, the company went all in on silliness. There, being earnest is a recipe for mockery.\n\nIf you're posting to social and you've got something slightly embarrassing to say, such as that you are backtracking on an earlier rebrand, better to lean into humor and irreverence, knowing that the internet won't shy away from pointing out you're repeating yourself. (Full disclosure: I work at a company that also flipped back to its original name after attempting a rebrand.)\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nBudget airline Ryanair is particularly adept at making jokes at its own expense on social media. The company often posts viral TikTok videos that make fun of the trade-offs of its cheap flights, such as limited legroom or additional costs for some seats.\n\nSo kudos to Max for laughing at itself. Just please don't change your name again.\n\nWBD declined to comment on the social strategy."
        },
        {
            "id": "1ef73edc40beae282696a1d01209a953",
            "title": "Tom Cruise’s Crazy, Death-Defying Stunts Land 5-Minute Cannes Standing Ovation at ‘Mission Impossible – The Final Reckoning’ Premiere - Variety",
            "url": "https://variety.com/2025/film/festivals/tom-cruise-cannes-mission-impossible-final-reckoning-premiere-1236388364/",
            "publishedAt": "2025-05-14T20:07:00Z",
            "urlToImage": "https://variety.com/wp-content/uploads/2025/05/GettyImages-2215077477.jpg?w=1000&h=563&crop=1",
            "source": "Variety",
            "description": "Tom Cruise returned to Cannes three years after \"Top Gun Maverick\" to electrify the festival all over again with his final \"Mission: Impossible\" film.",
            "content": "Tom Cruise said goodbye to the “Mission: Impossible” franchise in electrifying fashion at the Cannes Film Festival, where “Mission: Impossible – The Final Reckoning” earned a five-minute ovation than… [+4282 chars]",
            "full_content": "Tom Cruise said goodbye to the “Mission: Impossible” franchise in electrifying fashion at the Cannes Film Festival, where “Mission: Impossible – The Final Reckoning” earned a five-minute ovation thanks in part to Cruise’s commitment to putting breathless and death-defying practical stunts on the big screen. The Cannes premiere was a massive event, with a 40-piece orchestra welcoming guests into the theater with the franchise’s iconic theme before the screening.\n\nThe audience lapped up the film’s special effects but the long run-time left some theatergoers bleary-eyed and exhausted. In the final stretch of the film, featuring death-defying acrobatics from Cruise, a handful of attendees got up and fled the Palais.\n\nThough Cruise’s willingness to risk his life for “Mission: Impossible” has been covered relentlessly, what the Cannes audience did not expect was how much he was willing to bare all.\n\nPopular on Variety\n\nThe 62-year-old survived a three-minute knife fight sequence on a submarine wearing only skimpy boxer briefs. The same was true for part of the film’s mind-blowing underwater sequence. Honestly? The view wasn’t bad at all for a movie star in the fourth decade of his career.\n\nDuring the standing ovation, Cruise clutched his heart and nodded gratefully, with both he and director Christopher McQuarrie kissing and thanking guests Zoe Saldaña and Marco Perego-Saldaña. As the clapping continued, the camera panned to each member of the large cast, including Simon Pegg, Angela Bassett and Hayley Atwell.\n\n“This response is why we do it. You are why we do it. The big screen experience is why we do it,” McQuarrie then said in a speech, which ended up being longer than the ovation itself. “Thank you all for being here and for supporting us. I want to thank this extraordinary cast — when I tell you how extraordinary they are, it wasn’t just showing up to work every day. This film was made during a pandemic and two industry strikes. These two films were made over a period of seven years with a lot of uncertainty, a lot of gaps in between their faith and their hard work, their dedication, their unquestioning devotion to this. This film would not be possible without the hard work of each and every one of these people standing up here. It’s the most extraordinary cast in the world.”\n\nOf Cruise, the director continued: “As a kid, I didn’t fit in and a lot of my life was imaginative play. I got to grow up and have my very own action figure.”\n\nMcQuarrie then passed the mic to Cruise. “To be here in Cannes and have these moments — I mean as a kid when we were growing up, I really can’t even dream of something like this happening,” he said. “I think McQ said it all, I’m just very grateful for 30 years to be able to entertain you with this franchise.”\n\nAddressing McQuarrie, the movie star said, “Grateful to you, my friend. Every step of the way what you’ve done and how you’ve expanded it — it just went beyond our expectations. I look forward to making a bunch of other kind of movies with you, I can’t wait.”\n\nCruise and Paramount are surely hoping “The Final Reckoning” follows in the footsteps of “Top Gun: Maverick,” which dazzled Cannes in 2022 and earned a five-minute standing ovation on its way $1.46 billion at the worldwide box office that summer. The “Top Gun” sequel’s Cannes premiere was an extravaganza complete with eight fighter jets flying over the Palais as Cruise and the cast walked down the red carpet. Cruise was also awarded a surprise Honorary Palme d’Or before the screening.\n\nWhether or not “The Final Reckoning” can match the box office highs of “Top Gun: Maverick” remains to be seen. Cruise’s last “Mission: Impossible” outing, 2023’s “Dead Reckoning Part One,” ended its run with a disappointing $571 million worldwide, a sharp decline from the $791 million that 2018’s “Fallout” earned. But one can never doubt Cruise’s ability to deliver a blockbuster.\n\nIn addition to Cruise, “The Final Reckoning” brings back franchise stalwarts like Simon Pegg and Ving Rhames. The cast also includes Hayley Atwell, Vanessa Kirby, Pom Klementieff, Henry Czerny, Angela Bassett and Rolf Saxon, all of whom appeared in previous “Mission: Impossible” installments. Newcomers to the series include Janet McTeer, Hannah Waddingham,and Nick Offerman. The film is directed by Christopher McQuarrie, who helmed three previous “Mission: Impossible” movies.\n\n“Mission: Impossible – The Final Reckoning” opens in theaters May 23 from Paramount Pictures."
        },
        {
            "id": "280494d549c0dd7b9dc1b279e2a18029",
            "title": "‘The Hunger Games: Sunrise On The Reaping’ Casts Lili Taylor As Mags - Deadline",
            "url": "http://deadline.com/2025/05/hunger-games-sunrise-on-the-reaping-adds-lili-taylor-mags-1236397432/",
            "publishedAt": "2025-05-14T20:00:00Z",
            "urlToImage": "https://deadline.com/wp-content/uploads/2025/05/GettyImages-468238760.jpg?w=1024",
            "source": "Deadline",
            "description": "'Hunger Games: Sunrise on the Reaping' has added Lili Taylor to its cast, following news that Maya Hawke has boarded the project.",
            "content": "EXCLUSIVE: The Hunger Games: Sunrise on the Reaping has another new cast member in Emmy nominee Lili Taylor (Outer Range), who will play Mags, former Hunger Games champion-turned-District 12 mentor.\r… [+1818 chars]",
            "full_content": "EXCLUSIVE: The Hunger Games: Sunrise on the Reaping has another new cast member in Emmy nominee Lili Taylor (Outer Range), who will play Mags, former Hunger Games champion-turned-District 12 mentor.\n\nThis comes following news this morning that Maya Hawke has joined as Wiress, another former champion-turned-mentor. Joseph Zada and Whitney Peak lead the ensemble as Haymitch Abernathy and Lenore Dove Baird, respectively. Others on board include Mckenna Grace as Maysilee Donner, Jesse Plemons as Plutarch Heavensbee, and Kelvin Harrison Jr. as Beetee.\n\nBased on the bestselling novel by Suzanne Collins, published March 18, the latest installment in Lionsgate‘s dystopian YA franchise revisits the world of Panem 24 years before the events of The Hunger Games, starting on the morning of the reaping of the 50th Hunger Games, also known as the Second Quarter Quell. The story centers on 16-year-old Haymitch, a clever and resourceful boy from District 12, who’s unexpectedly chosen for this edition of the games, which will feature a deadly twist: twice the number of tributes, with 48 children sent into the arena to battle for their lives.\n\nWatch on Deadline\n\nFranchise vet Francis Lawrence is directing once again from a script by Billy Ray. Color Force’s Nina Jacobson and Brad Simpson are producing, with Cameron MacConomy exec producing. Meredith Wieck and Scott O’Brien are overseeing the project for the studio, for whom Robert Melnik negotiated deals. Slated for release on November 20, 2026, the new film comes on the heels of five installments that have grossed more than $3.3 billion worldwide.\n\nKnown for work in projects like American Crime and The Conjuring, Taylor has most recently been seen starring on Prime Video’s Outer Range opposite Josh Brolin. Tapped in March for a role in Daredevil: Born Again Season 2, she’ll appear in one of the final episodes of Poker Face Season 2 and also stars in Netflix’s Fear Street: Prom Queen, out May 23. She is represented by Independent Artist Group and Untitled Entertainment."
        },
        {
            "id": "3f09e48c95b10bdae6d495affec9d6b7",
            "title": "AP PHOTOS: A look at the second day of the Cannes Film Festival - AP News",
            "url": "https://apnews.com/article/cannes-film-festival-photos-mission-impossible-b522af22739995ed60f4ffcdeb788fae",
            "publishedAt": "2025-05-14T19:13:00Z",
            "urlToImage": "https://dims.apnews.com/dims4/default/39a0fc4/2147483647/strip/true/crop/8091x4551+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F0a%2F12188b1d60d669938957f6871712%2F6b2b6c9216e74a47b36a4000f31fd6ae",
            "source": "Associated Press",
            "description": "CANNES, France (AP) — Much of the cinema world has descended on the Cannes Film Festival as the French Riviera extravaganza kicks off its 78th edition.",
            "content": "Greg Tarzan Davis, from left, editor Eddie Hamilton, Angela Bassett, Tramell Tillman, Tom Cruise, director Christopher McQuarrie, Hannah Waddingham, Simon Pegg, Esai Morales, and Pom Klementieff take… [+221 chars]",
            "full_content": "CANNES, France (AP) — Much of the cinema world has descended on the Cannes Film Festival as the French Riviera extravaganza kicks off its 78th edition.\n\nThree years after flying into the Cannes Film Festival with “Top Gun: Maverick,” Tom Cruise returned to the Croisette on Wednesday with “Mission: Impossible — Final Reckoning.”\n\nZoe Saldana poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (AP Photo/Natacha Pisarenko) Zoe Saldana poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (AP Photo/Natacha Pisarenko) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nTramell Tillman, from left, director Christopher McQuarrie, Hannah Waddingham, and Angela Bassett take a selfie upon arrival for the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Joel C Ryan/Invision/AP) Tramell Tillman, from left, director Christopher McQuarrie, Hannah Waddingham, and Angela Bassett take a selfie upon arrival for the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Joel C Ryan/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nHalle Berry poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Halle Berry poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nAndie MacDowell poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Andie MacDowell poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nEva Longoria poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Eva Longoria poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nCuba Gooding Jr. poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Cuba Gooding Jr. poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nPom Klementieff poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Pom Klementieff poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nHayley Atwell, left, and Tom Cruise pose for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Hayley Atwell, left, and Tom Cruise pose for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nTom Cruise poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Tom Cruise poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nChloe Lecareux poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Chloe Lecareux poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nTom Cruise poses for photographers during the photo call for the film ‘Mission: Impossible – The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Tom Cruise poses for photographers during the photo call for the film ‘Mission: Impossible – The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nDirector Christopher McQuarrie poses for photographers during the photo call for the film ‘Mission: Impossible – The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Director Christopher McQuarrie poses for photographers during the photo call for the film ‘Mission: Impossible – The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nDirector Mascha Schilinski poses for photographers upon arrival at the premiere of the film ‘Sound of Falling’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Director Mascha Schilinski poses for photographers upon arrival at the premiere of the film ‘Sound of Falling’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nAissa Maiga, from left, Mohamed Grayaa, Toure Blamassi, Foued Zaazaa, Deborah Christelle Lobe Naney, Laetitia Ky and Didar Domehri pose for photographers at the photo call for the film ‘Promised Sky’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Joel C Ryan/Invision/AP) Aissa Maiga, from left, Mohamed Grayaa, Toure Blamassi, Foued Zaazaa, Deborah Christelle Lobe Naney, Laetitia Ky and Didar Domehri pose for photographers at the photo call for the film ‘Promised Sky’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Joel C Ryan/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nJury president Alice Rohrwacher poses for photographers at the photo call for the Camera d’Or jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Jury president Alice Rohrwacher poses for photographers at the photo call for the Camera d’Or jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nJury president Molly Manning Walker, centre, and jury members Nahuel Perez Biscayart, from left, Vanja Kaludjercic, Louise Courvoisier, and Roberto Minervini pose for photographers at the photo call for the Un Certain Regard jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Jury president Molly Manning Walker, centre, and jury members Nahuel Perez Biscayart, from left, Vanja Kaludjercic, Louise Courvoisier, and Roberto Minervini pose for photographers at the photo call for the Un Certain Regard jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nJury president Molly Manning Walker poses for photographers at the photo call for the Un Certain Regard jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Jury president Molly Manning Walker poses for photographers at the photo call for the Un Certain Regard jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nThis gallery features daily highlights from the festival, curated by Associated Press photo editors.\n\n___\n\nFor more coverage of the 2025 Cannes Film Festival, visit https://apnews.com/hub/cannes-film-festival."
        },
        {
            "id": "9c2ae7d77c58091de2ce98d4e8c65492",
            "title": "'It represents a seismic change': What Gérard Depardieu's conviction means for France - BBC",
            "url": "https://www.bbc.com/culture/article/20250514-what-gerard-depardieus-conviction-means-for-france",
            "publishedAt": "2025-05-14T16:00:00Z",
            "urlToImage": "https://ychef.files.bbci.co.uk/624x351/p0lb6t25.jpg",
            "source": "BBC News",
            "description": "Gérard Depardieu was found guilty of sexually assaulting two women on a film set. It's a verdict which could have a big impact on the country's film industry.",
            "content": "Yesterday, the French mega-star was found guilty of sexually assaulting two women on a film set. It's verdict which could have a big impact on the country's film industry.\r\nIt couldn't have been time… [+8846 chars]",
            "full_content": "'It represents a seismic change': What Gérard Depardieu's conviction means for France\n\n2 days ago Share Save Emma Jones Share Save\n\nGetty Images\n\nYesterday, the French mega-star was found guilty of sexually assaulting two women on a film set. It's verdict which could have a big impact on the country's film industry.\n\nIt couldn't have been timed more dramatically if it had been written into a film script. The world's most famous film festival, in Cannes, began on the same day that Gérard Depardieu, one of the biggest film stars France has ever produced, was found guilty of sexually assaulting two women on the film set of a 2021 film, The Green Shutters, who described him groping them while using obscene language. \"The giants of cinema are no longer untouchable,\" exclaimed one French news website, while another said that the news had \"shaken up\" the start of the iconic festival, from where I am currently reporting.\n\nGetty Images Cannes jury president Juliette Binoche said Depardieu was \"no longer sacred\" on the opening day of the festival (Credit: Getty Images)\n\nSeventy-six-year-old Depardieu is the veteran of around 200 films and TV productions. Famous in France since the late 1960s, he had international art house hits with films such as 1986's Jean de Florette. He became a global name as a result of a best actor Oscar nomination for a lavish French-language film production of Cyrano de Bergerac (1990), as well as the Hollywood romcom Green Card from the same year. Yesterday, Depardieu was given an 18-month suspended prison sentence, fined €29,000 (£24,430) and added to France's sex offenders register, but his lawyer said he will appeal the judgement.\n\nAround 20 women have made allegations about Depardieu's improper behaviour in the past, but this is the first to come to trial, and the significance of the verdict cannot be overstated, according to writer Agnès C Poirier. \"When a monument falls, it is always powerful and symbolic,\" she tells the BBC.\n\nShe adds that his reputation is \"profoundly tarnished\" but that \"the French film industry sentenced him a long time ago. He hasn't shot a film in three years. His career is finished. He's still one of the greatest actors of the 20th Century, though we may now feel different when we watch his films.\"\n\nThe mood at Cannes\n\nFor many years, the larger-than-life figure of Depardieu has also been linked to the Cannes Film Festival. He won the best actor prize here for Cyrano de Bergerac, launching it on its Oscar journey, and also played a part behind the scenes; its director, Thierry Frémaux, admitted that a much-derided football film from 2014, United Passions, starring Depardieu, premiered at Cannes because of pressure from the actor. He was most recently seen in 2015 at the festival with Isabelle Huppert for the film Valley of Love (and was seen staging a mock kiss at the photocall, as pictured below).\n\nChange has perhaps come later than in Hollywood and the rest of the world, but it is here now – Eve Jackson\n\nUnsurprisingly, Cannes Jury President, Juliette Binoche, who has also starred opposite Depardieu, was asked for her thoughts on the importance of his conviction at yesterday's opening press conference.\n\n\"He is no longer sacred,\" she told journalists, a reference to the scale of Depardieu's power in the French film industry.\n\nEve Jackson, the Culture Editor at French news channel France 24, tells the BBC that Depardieu \"has been revered as one of the sons of the Cannes Film Festival. And now that legacy is going to be called into question because it really was this festival that launched him into international stardom 35 years ago with Cyrano de Bergerac.\"\n\nLast year's festival, anticipating Depardieu's forthcoming trial, was full of activity from France's own #MeToo movement, with French female film-makers using international cinema's most public platform to show films dealing with the subject of sexual abuse.\n\nActress Judith Godrèche, who had recently gone public with allegations of sexual assault by two film-makers, Benoît Jacquot and Jacques Doillon, premiered a short film called Moi Aussi, (\"me too\") featuring hundreds of victims of sexual abuse standing silently in the streets of Paris. Last July, both Jacquot and Doillon were interviewed by police in connection with the accusations, which they have denied.\n\nGetty Images Depardieu's last appearance at Cannes was in 2015 alongside Isabelle Huppert for the film Valley of Love (Credit: Getty Images)\n\nCoralie Fargeat's Oscar winner, body horror The Substance, which explored, as she told the BBC at the time, her own \"rage\" about the sexual objectification of women of all ages.\n\nThis year, seven films in the main competition are by female directors. One of them, The Sound of Falling by German writer-director Mascha Schilinski, which premieres today, explores generational abuse of girls told through the story of one family. But it remains to be seen how many more films will address the topic of abuse during this festival.\n\nBeyond the films, Jackson says the atmosphere feels different at the 2025 festival, due to some high-profile cases that have sent shockwaves across France. Chief among them, in December, Dominique Pelicot and 50 other men were convicted of the rape, attempted rape and sexual assault of of Pelicot's 72-year-old wife Gisèle Pelicot. In February, director Christophe Ruggia was convicted of sexually assaulting Portrait of a Lady on Fire actor Adèle Haenel when she was a child; Haenel publicly quit the film industry in 2023, accusing it of \"general complacency\" towards sexual predators. Benoît Jacquot has been charged with raping two actors, which he denies.\n\nA wider shift in attitudes\n\n\"There's a big change that's taking place within the French film industry and you can feel it here at Cannes,\" Jackson says. \"And I think the fall of Depardieu really does represent this seismic change in France, that's perhaps come later than in Hollywood and the rest of the world, but it is here now. Young actors are calling out wrongdoing on set more and more, and someone like Ruggia received a four-year prison sentence (two years of which were suspended) for what he did to Adèle Haenel. They may not be international names in the way Depardieu is, but they're very significant to France. This idea of power play on film sets from actors and directors is no longer acceptable.\"\n\nThere's some way to go, however; last month a French Parliamentary report, led by French MP Sandrine Rousseau, found that abuse was \"endemic\" across the entire French entertainment industry, and that attitudes were \"barely evolving\" despite the #MeToo movement. The detailed report had 86 recommendations for change, including greater protections for child actors and the use of intimacy co-ordinators as standard for sex scenes in cinema, and theatre (as of December 2023, only four of them were reported as working across the whole of France, compared with 100 in the US entertainment industry).\n\nDepardieu also had some high-profile defenders; President Macron said in 2024 that the actor \"made France proud\". Seventy-six-year-old actor Fanny Ardant is one of his most steadfast supporters – Depardieu was absent from the verdict making a film with her in the Azores yesterday – and she came to court to support him, alongside his Cyrano de Bergerac co-star Vincent Perez. Brigitte Bardot, a French film star of the 1950s and 60s, also publicly defended him.\n\nGetty Images Adèle Haenel is one of the younger stars who has been vocal about sexual assault (Credit: Getty Images)\n\nBut Jackson points to a reaction to an event during the Depardieu trial, which she says is significant of a societal shift. She says there was condemnation when Depardieu's lawyer Jérémie Assous accused the actor's two female victims in the court case, a 54-year-old set dresser and a 34-year-old assistant director, of \"hysteria\", being \"liars\" and working for the cause of \"rabid feminism\".\n\n\"I think Depardieu is increasingly seen as from a different era and so are his lawyers,\" she says. \"They were called sexist in the way they spoke to the plaintiffs, calling them feminists as if it was a bad thing. And it added to his troubles, because the judge called it out and imposed an extra fine [of €2,000] because of it. It highlights the generational shift that's happening in France. His supporters are actors from the older generation such as Ardant and Bardot.\"\n\nA few days before Depardieu's conviction, the 90-year-old Bardot publicly called the actor a \"genius\" on French TV, and deplored that \"talented people who touch the bottom of a girl are consigned to the deepest dungeon\". But this kind of attitude is seen by the young as archaic, says Jackson, and they are less aware of his reputation as a great actor.\n\n\"For people over the age of perhaps 50 and 60, Depardieu evokes memories of being a great actor of a certain era, but I don't know how many younger people are interested in that story anymore,\" she says.\n\n--\n\nIf you liked this story sign up for The Essential List newsletter, a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week."
        },
        {
            "id": "b940ef7e7424df4bd5916e493c8136ff",
            "title": "Tony Gilroy on Giving ‘Andor’ a ‘Hopeful’ End, Bringing Back K-2SO, and Episode 10’s Revealing Backstory - IndieWire",
            "url": "https://www.indiewire.com/features/interviews/andor-season-2-finale-explained-1235118725/",
            "publishedAt": "2025-05-14T15:00:00Z",
            "urlToImage": "https://www.indiewire.com/wp-content/uploads/2025/05/PGM2-FF-004051.jpg?w=650",
            "source": "IndieWire",
            "description": "'Andor' Creator Tony Gilroy on giving Season 2 a 'hopeful ending' leading into 'Rogue One' and creating Luthen and Kleya's backstory in Ep 210.",
            "content": "On Tuesday, Disney+ dropped the last three episodes of “Andor,” wrapping up the series and directly setting up “Rogue One.” It’s not typical that a television show needs to pass its baton to a film m… [+4808 chars]",
            "full_content": "On Tuesday, Disney+ dropped the last three episodes of “Andor,” wrapping up the series and directly setting up “Rogue One.” It’s not typical that a television show needs to pass its baton to a film made almost a decade earlier, and “Andor” creator Tony Gilroy did not want to approach the show’s final episode in a typical way, either.\n\nWhile on this week’s episode of the Filmmaker Toolkit podcast, Gilroy talked about fighting against the need to incorporate one final big decision or turning point in wrapping up the series heading into “Rogue One.”\n\n“Episode 12 is really its own thing where we didn’t put a lot of pressure to jack anything up,” said Gilroy on the podcast. “This is kind of a ‘deliver the pizza’ episode, and the pizza is emotional, and everybody settled into it, and we took the pressure off ourselves.”\n\nGilroy specifically wanted to go out on a hopeful note. “Andor” Season 2 was about the personal sacrifices and impossible choices characters faced in taking on the cause of the nascent rebellion, and the series creator felt as if “Andor” had earned the right to end with a measured note of optimism.\n\n“We’re really putting the audience through some amazingly difficult journeys [of] what time does to people that hopefully you care about, and [what] time, under these really extreme circumstances and these extreme adventures that they’re on, does to them,” said Gilroy. “So there’s a lot of attrition at the end. There’s a lot of sadness at the end. But really, in the end, this is the beginning of ‘A New Hope.’ What’s going to come out of this is the phoenix of the Rebellion.”\n\nDiego Luna and Alan Tudyk (as K-2SO) in ‘Rogue One’ ©Walt Disney Co./courtesy Everett / Everett Collection\n\nThe last three-episode cycle “Andor” also saw K-2SO (voiced by Alan Tudyk) back into the fold, returning to the prominent supporting role that the modified KX-series security droid plays in “Rogue One.” It’s a move Gilroy purposefully delayed and left to the series end. As Gilroy explained on the podcast, his initial involvement with “Andor” was as a friend to the franchise, giving notes to Lucasfilm on its initial plans for a “Rogue One” prequel series. In addition to his advice to take a “back-to-the-studs” approach to Cassian Andor’s (Diego Luna) arc, which would become the basis of his own series, he highly recommended they abandon their ambitious plans for K-2SO.\n\n“I was saying, I don’t think you can have K-2 all the way through this show, which they kept wanting to try to do because that was the, ‘Let’s have a Butch and Sundance’ show,” said Gilroy of the initial plans to have Cassian and the droid go on 40-episodes worth of missions together — a proposal that reminded the “Rogue One” writer of his own story struggles with K-2. “He’s the worst piece of luggage in the world. He’s not a spy, you can’t take him undercover, he’s seven feet tall. KX units are so inhibiting. If you watch ‘Rogue’ with that in mind, how many times is he is not allowed to get out of the ship, or ‘I have to wait here and do something.’”\n\nIn a series which, at its core, is about supplying an emotional understanding of what brings characters of all stripes to fight a fascist Empire, Episode 10 is arguably the holy grail of “Why We Fight” Rebellion backstories: Luthen (Stellan Skarsgård) and Kleya (Elizabeth Dulau). Gilroy said very early on he knew he would explore Luthen’s backstory, and was saving it for a key storyline of the stealthy underground leader for near the end of “Andor.”\n\n“I had a variety of backstories that Stellan and I spoke about early in the first season,” said Gilory. “The one thing he didn’t want was he didn’t want revenge. He said, ‘I don’t want it to be a revenge story. I see that in some of the other characters, and I think that’s the one I don’t want.”\n\nElizabeth Dulau as Kleya in ‘Andor’ Season 2 ©Disney+/Courtesy Everett Collection\n\nThe ultimate Episode 210 storyline, and the incorporation of Kleya, as an almost adopted daughter, into Luthen’s backstory, was motivated and inspired by the talents of Dulau. Gilroy and Skarsgård had both been impressed by the previously unknown actress’s talents, and wanted to give her and the character the opportunity to spread their wings before saying goodbye.\n\n“Elizabeth Dulau, who plays Kleya, was such an incredible surprise. It’s her first job. She came right out of RADA, and we had a couple of actresses who were signed up for that part, who got offered other things along the way, and we let them go. And suddenly we have this young actress [who we don’t really know,” said Gilroy. “[Her] audition’s very good, and her scenes are very good, but how good is she? And oh my God, you start to realize what someone can do. She’s a Meryl Streep. I mean, she’s just astonishing.”\n\nTo hear Tony Gilroy’s full interview, subscribe to the Filmmaker Toolkit podcast on Apple, Spotify, or your favorite podcast platform. You can also watch the full interview at the top of the page or on IndieWire’s YouTube page."
        },
        {
            "id": "ec7ae0a47bde808dddf77902a48dcccf",
            "title": "With tears and defiance, Kim Kardashian faces the men accused of robbing her in Paris - NPR",
            "url": "https://www.npr.org/2025/05/14/g-s1-66536/kim-kardashian-jewelry-robbery-testimony-paris-trial",
            "publishedAt": "2025-05-14T13:53:13Z",
            "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe8%2F0b%2Fc36b7afd4ad6967302466a172284%2Fap25133539485223.jpg",
            "source": "NPR",
            "description": "The reality star and business mogul appeared in a courtroom Tuesday to testify about the night in 2016 when masked men tied her up at gunpoint and stole more than $6 million in jewelry.",
            "content": "Defiant in diamonds, Kim Kardashian appeared in a Paris courtroom Tuesday to testify in the trial over the 2016 armed robbery that upended her life. The reality star and business mogul gave emotional… [+4498 chars]",
            "full_content": "With tears and defiance, Kim Kardashian faces the men accused of robbing her in Paris\n\ntoggle caption Aurelien Morissard/AP\n\nDefiant in diamonds, Kim Kardashian appeared in a Paris courtroom Tuesday to testify in the trial over the 2016 armed robbery that upended her life. The reality star and business mogul gave emotional, at times harrowing, testimony about the night masked men tied her up at gunpoint and stole more than $6 million in jewelry.\n\nHere's what she revealed — and what's still to come.\n\nA night that changed everything\n\nKardashian said she was starting to doze off in bed in the early hours when she heard stomping on the stairs. She assumed it was her sister Kourtney returning from a night out. \"Hello? Hello? Who is it?\" she called.\n\nSponsor Message\n\nMoments later, two masked men burst in. They dragged the concierge in handcuffs. They were dressed as police.\n\n\"I thought it was some sort of terrorist attack,\" she said.\n\nShe grabbed her phone but froze — \"I didn't know what 911 was (in France).\" She tried to call her sister and her bodyguard, but one man grabbed her hand to stop her. They threw her on the bed, bound her hands and held a gun to her back.\n\n\"I have babies,\" she recalled telling the robbers. \"I have to make it home. They can take everything. I just have to make it home.\"\n\nHer robe fell open — she said she was naked underneath — as one man pulled her toward him. \"I was certain that was the moment that he was going to rape me,\" Kardashian said.\n\nOne attacker leaned in and told her, in English, she'd be OK if she stayed quiet. He taped her mouth shut, and took her to the bathroom.\n\nKardashian later managed to free her hands by rubbing the tape against the bathroom sink. She hopped downstairs, ankles still bound, and found her friend and stylist, Simone Harouche. Fearing the men might return, the women climbed onto the balcony and hid in bushes. While lying there, Kardashian called her mother.\n\nSponsor Message\n\nThe men took a diamond ring she'd worn that night to a Givenchy show and rifled through her jewelry box. They took items including a watch her late father had given her when she graduated high school. \"It wasn't just jewelry. It was so many memories,\" she said.\n\nA changed life and constant fear\n\nInvestigators believe the attackers followed Kardashian's digital breadcrumbs — images, timestamps, geotags — and exploited them with old-school criminal methods.\n\nThe robbery reshaped Kardashian's sense of safety and freedom. \"This experience really changed everything for us,\" she said. \"I started to get this phobia of going out.\"\n\nShe often rents adjoining hotel rooms for protection and no longer stores jewelry at home, and now has up to six security guards at home.\n\n\"I can't even sleep at night\" otherwise, she said.\n\nShe also said she no longer makes social media posts in real time unless at a public event. Her Los Angeles home was robbed shortly after the Paris heist in what she believes was a copycat attack.\n\ntoggle caption Valentin Pasquier/AP\n\nA letter and an unexpected moment of grace\n\nIn a powerful courtroom moment, the chief judge read aloud a letter from one of the accused, who is too ill to testify. The letter said he had seen Kardashian's tears on television and expressed regret. Kardashian was visibly moved.\n\n\"I'm obviously emotional,\" she said in response.\n\n\"I do appreciate the letter, for sure,\" she added. \"I forgive you for what had taken place. But it doesn't change the emotion, the trauma, and the way my life is forever changed.\"\n\nKardashian, who is studying to become a lawyer, added that she regularly visits prisons. \"I've always believed in second chances,\" she said.\n\nDiamonds, defiance and public image\n\nKardashian made a fashion statement in court, wearing a $1.5 million necklace by Samer Halimeh New York. The jeweler's press release for the necklace came out even as she was on the witness stand, a reminder that visibility remains currency, even if the rules have grown more complicated.\n\nThe choice reflected defiance and the reclaiming of the image and luxury once used against her.\n\nSponsor Message\n\nKardashian said Paris had once been a sanctuary, a place where she would walk at 3 or 4 a.m., window shopping, sometimes stopping for hot chocolate. It \"always felt really safe,\" she said. \"It was always a magical place.\"\n\nWhat's next\n\nTwelve suspects were originally charged. One has died. One was excused due to illness. The French press dubbed the group les papys braqueurs — \"the grandpa robbers\" — but prosecutors say they were no harmless retirees.\n\nThe defendants face charges including armed robbery, kidnapping and gang association. If convicted, they could face life in prison.\n\nKardashian said she was grateful for the opportunity to \"tell my truth\" in the packed Paris courtroom.\n\n\"This is my closure,\" she said. \"This is me putting this, hopefully, to rest.\"\n\nThe trial is expected to conclude May 23."
        }
    ]
}