{
    "status": "ok",
    "totalResults": 68,
    "category": "health",
    "country": "us",
    "timestamp": "2025-05-19 14:30:45",
    "articles": [
        {
            "id": "f41c1359c9b714e36bbb0676dfbb3dd3",
            "title": "U. researchers unveil AI-powered tool for disease prediction with 'unprecedented accuracy' - KSL.com",
            "url": "https://www.ksl.com/article/51314532/u-researchers-unveil-ai-powered-tool-for-disease-prediction-with-unprecedented-accuracy",
            "publishedAt": "2025-05-17T21:04:47Z",
            "urlToImage": "https://img.ksl.com/slc/3085/308581/30858186.jpeg?filter=kslv2/responsive_story_lg",
            "source": "KSL.com",
            "description": "University of Utah researchers have unveiled a new tool kit that uses AI to predict whether individuals will develop progressive and chronic diseases years before symptoms appear.",
            "content": "SALT LAKE CITY It's long been a goal in medicine to better understand the long trajectories of diseases in hopes of engaging in better prevention and early intervention.\r\n\"Collectively, they're (chro… [+4524 chars]",
            "full_content": "Estimated read time: 4-5 minutes\n\nSALT LAKE CITY — It's long been a goal in medicine to better understand the long trajectories of diseases in hopes of engaging in better prevention and early intervention.\n\n\"Collectively, they're (chronic and progressive diseases) responsible for about 90% of the health care costs in this country and the vast majority of morbidity and mortality,\" said Nina de Lacy, a professor of psychiatry and member of the One-U Responsible AI Initiative's executive committee.\n\nNow, University of Utah researchers have taken a crucial step in doing so, unveiling a new, open-source software tool kit that uses artificial intelligence to predict whether individuals will develop progressive and chronic diseases years before symptoms appear.\n\nEnter RiskPath, a new technology that analyzes patterns in health data collected over multiple years to identify at-risk individuals with \"unprecedented accuracy\" of 85% to 99%, according to National Institute of Mental Health-sponsored research published last week by the U.'s Department of Psychiatry and Huntsman Mental Health Institute.\n\nThe program harnesses explainable AI, which is designed to explain complex decisions in ways humans can understand.\n\n\"Explainability means, can I explain enough about how AI accomplished this prediction such that it becomes understandable to humans?\" de Lacy said. \"That would be things like what RiskPath does.\"\n\nDe Lacy explained something that has always been a challenge in biomedicine is building models and analyzing longitudinal data, meaning it's collected over many time periods.\n\n\"One of the major use cases in using longitudinal data is course development, understanding how people grow up and develop over time,\" de Lacy said. \"And one of the other ones is what RiskPath is aimed at, which is understanding progressive or chronic disease. There are many progressive and chronic diseases out there, and some of the big ones are things that are the major diseases that affect humans.\"\n\nThe research shows current medical prediction systems for longitudinal data often miss the mark, correctly identifying at-risk patients only about half to three-quarters of the time. Unlike existing prediction systems for longitudinal data, RiskPath uses advanced time-series AI algorithms that deliver crucial insights into how risk factors interact and change in importance throughout the disease process.\n\n\"By identifying high-risk individuals before symptoms appear or early in the disease course and pinpointing which risk factors matter most at different life stages, we can develop more targeted and effective preventive strategies. Preventative health care is perhaps the most important aspect of health care right now, rather than only treating issues after they materialize,\" de Lacy said.\n\nDe Lacy and the rest of the research team validated RiskPath across three major long-term patient cohorts involving thousands of participants to successfully predict eight different conditions, including depression, anxiety, ADHD, hypertension and metabolic syndrome.\n\nThe technology offers several key advantages:\n\nEnhanced understanding of disease progression: RiskPath can map how different risk factors change in importance over time, revealing critical windows for intervention. For example, the study showed how screen time and executive function become increasingly important risk contributors for ADHD as children approach adolescence.\n\nRiskPath can map how different risk factors change in importance over time, revealing critical windows for intervention. For example, the study showed how screen time and executive function become increasingly important risk contributors for ADHD as children approach adolescence. Streamlined risk assessment: Though RiskPath can analyze hundreds of health variables, researchers found that most conditions can be predicted with similar accuracy using just 10 key factors, making implementation more feasible in clinical settings.\n\nThough RiskPath can analyze hundreds of health variables, researchers found that most conditions can be predicted with similar accuracy using just 10 key factors, making implementation more feasible in clinical settings. Practical risk visualization: The system provides intuitive visualizations showing which time periods in a person's life contribute most to disease risk, helping researchers identify optimal times for preventive interventions.\n\nWhile RiskPath is primarily a research tool to help researchers build better risk stratification models, de Lacy hopes it will eventually be used in a health care setting to improve disease management.\n\n\"Some may be using that to build models that can be implemented in health care, and we kind of hope that they do that. But ... a big part of what my lab is interested in doing is building tools that do a better job of risk stratification. We're very interested in prevention,\" de Lacy said. \"The ultimate aim of RiskPath and tools like RiskPath is to help people build better risk stratification tools and decision support tools.\n\n\"And what those do is help clinicians, and maybe one day patients, be able to understand their risk for a chronic or progressive disease better and earlier,\" she said."
        },
        {
            "id": "daa2207b6daea7cf40bce65cf832075c",
            "title": "This commonly prescribed drug can increase the risk of Alzheimer’s by 46% - Times of India",
            "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/this-commonly-prescribed-drug-can-increase-the-risk-of-alzheimers-by-46/articleshow/121237625.cms",
            "publishedAt": "2025-05-17T20:30:00Z",
            "urlToImage": "https://static.toiimg.com/thumb/msid-121237625,width-1070,height-580,imgsize-53936,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "source": "The Times of India",
            "description": "A new study published in the Neurology and Urodynamics journal reveals that long-term use of anticholinergic drugs, commonly prescribed for various conditions, significantly raises the risk of developing Alzheimer's disease by 46%. This article delves into th…",
            "content": null,
            "full_content": "A recent meta-analysis reveals a concerning link between long-term use of anticholinergic drugs and an elevated risk of dementia, particularly Alzheimer's disease. The study indicates that individuals taking these medications, commonly prescribed for conditions like overactive bladder and depression, for at least three months face a 46% increased risk.\n\nHow does the prescription drug increase the risk of Alzheimer’s\n\nStudy Biotech & Health Tech Abroad: Top Courses at Harvard, Stanford\n\nAn estimated 57 million people were living with dementia globally in 2021, with Alzheimer’s disease accounting for 60–70% of all cases. Now, a new study warns that adults who take certain prescription drugs may face a significantly higher risk of developing dementia.According to a meta-analysis published in the Neurology and Urodynamics journal, people who take certain prescription drugs for more than three months have an increased risk of developing Alzheimer’s disease.Alzheimer’s disease is the most common form of dementia, a brain disorder that slowly destroys a person’s memory and thinking skills. This disease leads to a loss of cognitive functioning, such as thinking, remembering, and reasoning, along with behavioural abilities to such an extent that it interferes with a person’s daily life and activities. Over time, Alzheimer’s patients lose their ability to perform simple daily tasks, such as eating or walking.According to the meta-analysis, the long-term use of anticholinergic drugs , commonly prescribed for conditions like overactive bladder, allergies, and depression, can raise the risk of dementia by 46%. The study, which analyzed 21 studies and included a meta-analysis of six, looked at the impact of anticholinergic drugs taken for at least three months.These medications block acetylcholine, a neurotransmitter that is critical for memory and cognitive function. Acetylcholine transmits messages in the nervous system. In the brain, acetylcholine is linked to learning and memory. In the rest of the body, it stimulates muscle contractions. Anticholinergic drugs also include antihistamines, tricyclic antidepressants, medications to control an overactive bladder, and drugs to relieve the symptoms of Parkinson's disease.The findings revealed a clear association between prolonged anticholinergic use and dementia risk. The study found a people who took these anticholinergic drugs had a 46% increased risk of dementia compared to those who didn’t take them. The risk grew with longer exposure, with some studies noting a dose-dependent effect. “Anticholinergic use for ≥3 months increased the risk of dementia on average by an estimated 46% versus nonuse. This relationship was consistent in studies assessing overactive bladder medications. The risk of developing dementia should be carefully considered in the context of potential benefit before prescribing anticholinergics,” the authors said.Another study by researchers at the University of Nottingham found that there was nearly a 50% increased risk of dementia among patients aged 55 and over who had used strong anticholinergic medication daily for three years or more. \"This study found that there was nearly a 50% increased risk of dementia among patients aged 55 and over who had used strong anticholinergic medication daily for three years or more,\" Professor Tom Dening, Head of the Centre for Dementia at the University, and a member of the research team said. The study followed 58,769 patients with a diagnosis of dementia and 225,574 patients without a diagnosis of dementia."
        },
        {
            "id": "0d52258b61dac072fc9f7882af6a0d9b",
            "title": "Glymphatic dysfunction linked to cognitive performance deficits in adults with ADHD, study finds - PsyPost",
            "url": "https://www.psypost.org/glymphatic-dysfunction-linked-to-cognitive-performance-deficits-in-adults-with-adhd-study-finds/",
            "publishedAt": "2025-05-17T20:09:28Z",
            "urlToImage": "https://www.psypost.org/wp-content/uploads/2025/05/brain-7.jpg",
            "source": "PsyPost",
            "description": "New findings suggest that dysfunction in the brain’s glymphatic system—a key waste clearance pathway—may contribute to cognitive impairments in adults with ADHD, shedding light on a lesser-known biological mechanism behind the disorder.",
            "content": "A new study published in the Journal of Affective Disorders has found that adults with attention-deficit/hyperactivity disorder (ADHD) show signs of glymphatic system dysfunction, which may be relate… [+6728 chars]",
            "full_content": "A new study published in the Journal of Affective Disorders has found that adults with attention-deficit/hyperactivity disorder (ADHD) show signs of glymphatic system dysfunction, which may be related to their cognitive difficulties. The findings suggest that disruptions in the brain’s waste clearance system could help explain some of the persistent memory and attention problems seen in adults with the condition.\n\nADHD is a common neurodevelopmental disorder marked by symptoms of inattention, impulsivity, and hyperactivity. While it is often diagnosed in childhood, many people continue to experience symptoms well into adulthood. In adults, ADHD can interfere with work, relationships, and daily functioning, and is often accompanied by cognitive issues such as forgetfulness and difficulty sustaining focus. Although behavioral symptoms are widely studied, the biological mechanisms that underlie adult ADHD are less understood.\n\nOne area of growing interest among scientists is the glymphatic system—a network that helps clear waste products from the brain. This system operates mainly during deep sleep and uses cerebrospinal fluid to flush out harmful substances. Problems with glymphatic function have been linked to other brain disorders, such as Alzheimer’s disease. However, little is known about its role in ADHD, especially in adults. The researchers behind this study wanted to explore whether changes in glymphatic function could help explain the cognitive impairments associated with the condition.\n\nTo do this, the team analyzed brain imaging and cognitive data from 41 adults diagnosed with ADHD and compared them to 108 healthy adults. The data came from the University of California, Los Angeles Consortium for Neuropsychiatric Phenomic LA5c Study and included both structural and functional magnetic resonance imaging (MRI) scans, along with results from several cognitive tests. The researchers used advanced neuroimaging techniques to assess three indicators of glymphatic function: the volume of the choroid plexus (a part of the brain that produces cerebrospinal fluid), a measure known as the ALPS index (which reflects how well fluid moves along blood vessels in the brain), and the strength of the connection between brain activity and cerebrospinal fluid flow (called gBOLD-CSF coupling).\n\nThe participants also completed a range of assessments, including the Adult ADHD Self-Report Scale to measure ADHD symptoms, and standardized tests to evaluate memory, attention, and verbal learning. These included the California Verbal Learning Test and the Wechsler Memory Scale.\n\nThe results showed that adults with ADHD had lower ALPS index scores than healthy individuals, suggesting reduced glymphatic activity. This difference was observed across both hemispheres of the brain. The decrease in ALPS scores was linked to reduced fluid movement along specific fiber pathways in the brain, particularly those involved in communication between regions. These findings point to a possible impairment in how effectively the brain is able to clear waste.\n\nAlthough the volume of the choroid plexus tended to be higher in the ADHD group, this difference did not reach statistical significance. This may suggest a potential compensatory response or a marker of altered cerebrospinal fluid dynamics, but more research is needed to draw firm conclusions. Likewise, there were no significant differences between the ADHD and control groups in terms of gBOLD-CSF coupling, which reflects functional synchronization between brain activity and fluid flow. This suggests that while structural glymphatic changes may be present, the overall coordination between brain and fluid activity remains intact in adults with ADHD.\n\nImportantly, the researchers found that lower ALPS index scores were associated with poorer performance on memory tasks, including visual reproduction and delayed recognition. These correlations were stronger in the right hemisphere. The ALPS index also showed links with higher scores on obsessive-compulsive symptoms in participants with ADHD, suggesting a broader relationship between glymphatic function and psychiatric features.\n\nIn healthy participants, higher ALPS scores were also associated with better memory performance, suggesting that glymphatic activity may play a broader role in supporting cognitive health across individuals, not just those with ADHD.\n\nThese findings open up the possibility that glymphatic dysfunction contributes to the cognitive symptoms experienced by adults with ADHD. The researchers propose that impaired waste clearance could lead to the buildup of metabolic byproducts that interfere with brain signaling, particularly in pathways involving dopamine and norepinephrine. These neurotransmitters are already known to play a role in attention, motivation, and reward processing—all areas often affected in ADHD.\n\nAnother possible explanation is that impaired glymphatic function may contribute to low-grade inflammation in the brain, which has been increasingly recognized in ADHD research. Inflammation can disrupt brain development and affect how neurons communicate. The researchers also point out that sleep problems, which are common in ADHD, may worsen glymphatic dysfunction, since this system operates most effectively during deep sleep.\n\nOn a cellular level, the authors suggest that astrocytes—supportive brain cells that help regulate the glymphatic system—may play an important role. Astrocytes help manage fluid flow through channels called aquaporins and also influence how brain circuits develop. Dysfunction in these cells could create a cascade of problems affecting both waste clearance and neural communication.\n\nWhile this study is one of the first to examine glymphatic function in adult ADHD, it has several limitations. Because the data are cross-sectional, the researchers cannot determine whether glymphatic dysfunction causes cognitive problems or results from them. Longitudinal studies are needed to better understand the direction of this relationship. The relatively small sample size also limits the generalizability of the findings, and future research should aim to replicate these results in larger and more diverse groups.\n\nDespite these limitations, the study adds an important piece to the puzzle of ADHD. It suggests that biological systems beyond neurotransmitter signaling—such as waste clearance—may play a meaningful role in the disorder’s development and persistence. These insights could eventually lead to new therapeutic strategies. For example, improving sleep quality, promoting regular physical activity, or reducing brain inflammation could support glymphatic function and potentially ease cognitive symptoms in adults with ADHD.\n\nThe study, “Glymphatic system dysfunction in adult ADHD: Relationship to cognitive performance,” was authored by Yan Fang, Juan Peng, Tiantian Chu, Feng Gao, Fei Xiong, and Ye Tu."
        },
        {
            "id": "eb626199a648052c2d8615af657d75c1",
            "title": "High-quality carbs in midlife linked to healthier aging - Earth.com",
            "url": "https://www.earth.com/news/high-quality-carbs-in-midlife-linked-to-healthier-aging/",
            "publishedAt": "2025-05-17T17:11:55Z",
            "urlToImage": "https://cff2.earth.com/uploads/2025/05/17100920/High-quality-carbs-in-midlife-linked-to-healthier-aging.jpg",
            "source": "Earth.com",
            "description": "Women eating more high-quality carbs and fiber in midlife had a higher chance of aging well, with better mental and physical health.",
            "content": "Aging can mean many things. It can mean slowing down, feeling less sharp, or facing more health issues. But it doesnt have to. A new study suggests that what women eat in midlife could set the stage … [+5062 chars]",
            "full_content": "Aging can mean many things. It can mean slowing down, feeling less sharp, or facing more health issues. But it doesn’t have to. A new study suggests that what women eat in midlife could set the stage for how well they age.\n\nPublished in JAMA Network Open, the study from Tufts University and Harvard T.H. Chan School of Public Health dives into the power of carbohydrates and fiber in shaping health decades later.\n\nHow carbs affect aging\n\nNot all carbs are equal. Some lift you up, while others drag you down.\n\n“We’ve all heard that different carbohydrates can affect health differently, whether for weight, energy, or blood sugar levels. But rather than just look at the immediate effects of these macronutrients, we wanted to understand what they might mean for good health 30 years later,” said lead author Andres Ardisson Korat.\n\nThe study zeroed in on 47,000 women, ages 70 to 93. The researchers looked at what these women ate over a span of three decades, starting in 1984. They tracked their intake of refined carbs, high-quality carbs, and fiber. They wanted to see who aged well – and who didn’t.\n\nWhat healthy aging looks like\n\nLiving past 70 doesn’t mean you’re aging well. The researchers defined healthy aging as reaching 70 without major chronic diseases, keeping a sharp mind, staying physically capable, and feeling good mentally. Out of 47,000 women, only 3,706 fit that bill.\n\nWhat did those women have in common? A diet rich in high-quality carbs and fiber. The more they ate from whole grains, fruits, vegetables, and legumes, the better they aged.\n\nHigh-quality carbs boost aging\n\nEating more high-quality carbs wasn’t just good. It was transformative. Women who upped their intake of high-quality carbs by 10% had a 31% better chance of aging well.\n\nThe same couldn’t be said for refined carbs. Sugary snacks and white bread were linked to a 13% drop in the odds of healthy aging.\n\n“Our results are consistent with other evidence linking consumption of fruits and vegetables, whole grains, and legumes with lower risks of chronic diseases, and now we see the association with physical and cognitive function outcomes,” said study senior author Qi Sun.\n\nFiber’s role in protecting health\n\nFiber doesn’t just keep things moving. It protects your mind. It shields your body. For every one-standard-deviation bump in fiber intake, the odds of healthy aging shot up by 17 percent.\n\nFruit fiber boosted odds by 14 percent. Vegetable fiber added 11 percent. Even cereal fiber, often overlooked, contributed a 7% increase.\n\nThe benefits of fiber went beyond disease prevention. Women with higher fiber intake had stronger memories, better physical function, and fewer mental health problems.\n\nAll carbs affect aging differently\n\nGlycemic index (GI) and glycemic load (GL) may sound like fancy terms, but they matter. Foods with a high GI hit blood sugar hard and fast. Not great for aging well.\n\nHigh GL foods, on the other hand, had a surprising link to better mental health. But once the researchers factored in fiber intake, that connection weakened. The takeaway? Fiber might buffer some of the negative effects of high-GI foods.\n\nReplacing refined carbs\n\nImagine swapping out refined carbs for high-quality ones. What happens? Women who did had 8% to 16% better odds of aging well. That’s a big jump.\n\n“Studies are starting to find an association between food choices in midlife and quality of life in later years. The more we can understand about healthy aging, the more science can help people live healthier for longer,” Korat said.\n\nTracking women’s diets\n\nThis study tracked women’s diets for over 30 years. It connected their midlife eating habits to their health in their 70s and 80s. The findings suggest that small, consistent changes matter more than drastic diets.\n\nThe researchers saw that women who ate more whole grains, fruits, and veggies over time aged better than those who filled up on white bread and sweets.\n\nThe study mostly included white, educated health professionals. Participants reported their own dietary habits, which might not be completely accurate. And after three decades, memories can get hazy.\n\nStill, the findings were clear. Eating more high-quality carbs and fiber in midlife made a noticeable difference. It wasn’t just beneficial – it was transformative.\n\nWhat this means for women\n\nAging well isn’t just about avoiding illness. It’s about staying mentally sharp, physically active, and feeling good. The study suggests that what women eat in their 40s and 50s can impact their health decades later.\n\nBut it’s not just about eating fewer carbs. It’s about eating the right ones. Whole grains, fruits, vegetables, and legumes gave women a better shot at aging well.\n\nCarbs and fiber shape aging\n\nThe food choices women make in midlife are more than just meals. They’re investments.\n\nHigh-quality carbs and dietary fiber aren’t just good for digestion. They’re linked to lower risks of chronic diseases, sharper minds, and better physical health in old age.\n\nAging doesn’t have to mean decline, and it doesn’t have to mean slowing down. For the women in this study, eating well decades earlier paid off in a big way. The lesson? It’s never too early to think about the future. And it’s never too late to make better choices.\n\nThe study is published in the journal JAMA Network Open.\n\n—–\n\nLike what you read? Subscribe to our newsletter for engaging articles, exclusive content, and the latest updates.\n\nCheck us out on EarthSnap, a free app brought to you by Eric Ralls and Earth.com.\n\n—–"
        },
        {
            "id": "fbec136d17a34e1a026be2a495ba3117",
            "title": "Who needs more exercise: Women or men? - Live Science",
            "url": "https://www.livescience.com/health/exercise/who-needs-more-exercise-women-or-men",
            "publishedAt": "2025-05-17T17:00:00Z",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/v26dFsZW3qgAadxYDAqyEN.jpg",
            "source": "Live Science",
            "description": "Do the benefits of exercise differ by sex? The answer is yes, evidence suggests.",
            "content": "Exercising regularly is known to lower the risk of death, especially from heart problems. But scientists have discovered that that reduction in risk may differ between the sexes, with some people rea… [+5858 chars]",
            "full_content": "Exercise can promote a long, healthy life. But how much exercise do you need to reap those benefits? The answer might differ by sex.\n\nExercising regularly is known to lower the risk of death, especially from heart problems. But scientists have discovered that that reduction in risk may differ between the sexes, with some people reaping greater benefits in less workout time.\n\nSo, who has to exercise more to reduce their risk of death: Women or men?\n\nIt turns out that women may reap these survival benefits more easily than men do. That's according to a large study published in 2024 in the Journal of the American College of Cardiology , which included data from more than 412,000 American adults ages 27 to 61, 55% of whom were female.\n\n\"The beauty of this study is learning that women can get more out of each minute of moderate to vigorous activity than men do,\" study co-lead author Dr. Martha Gulati , director of preventive cardiology in the Smidt Heart Institute at Cedars-Sinai, said in a statement . \"It's an incentivizing notion that we hope women will take to heart.\"\n\nThe researchers collected participants' physical activity data via the National Health Interview Survey (NHIS), the largest and longest-running health survey in the U.S. The study looked at data collected between 1997 and 2017.\n\nRelated: 11 minutes of moderate exercise a day cuts early death risk by 20%, huge analysis suggests\n\nThe survey itself included questions about the types of exercises people performed and at what frequencies, durations and intensities. It also included participants' socioeconomic and demographic characteristics and medical conditions. The study excluded people who had certain health conditions at the start of the study time frame, such as coronary heart disease or cancer.\n\nSign up for the Live Science daily newsletter now Get the world’s most fascinating discoveries delivered straight to your inbox. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nThe researchers also looked through the National Death Index — a national database of death records — for deaths from any cause, as well as cardiovascular-related deaths. The data from survey participants is linked to this death-record data , so the researchers could then connect the data from their NHIS participants to the mortality data through the end of 2019. Overall, 39,935 participants died in the study timeframe, including 11,670 cardiovascular-related deaths, such as those from heart disease, heart attacks and strokes.\n\nAbout 32% of the women and 43% of the men surveyed said they engaged in regular aerobic exercise , exercising for at least 150 minutes per week. Compared to inactive individuals of the same sex, women who exercised regularly had up to a 24% lower risk of death from any cause. For men who exercised regularly, however, the reduction in mortality risk reached only 15%.\n\nWomen also gained these survival benefits much more quickly than men did, the study found. In men, the highest reduction in death risk was seen at about 300 minutes of moderate-to-vigorous physical activity (MVPA) per week. That came with an 18% reduction in all-cause mortality. Women saw an equal benefit in less than half that time, at about 140 minutes of MVPA a week.\n\nWomen who trained more than that each week saw a greater benefit until they also peaked at around 300 minutes of weekly MVPA.\n\nThat trend held true across all durations of exercise, the researchers found, with women consistently seeing \"proportionately greater benefits\" for any amount of exercise than men did.\n\nAbout 20% of women and 28% of men said they engaged in two or more sessions of strength training, such as lifting weights, each week. Overall, though, women reported an average of about 0.85 sessions per week, while men averaged 1.25 sessions per week.\n\nOn average, the women who strength-trained at least twice a week had a 19% lower mortality risk than women who trained less often or not at all. Men, on average, saw a 11% lower risk compared with inactive men.\n\nThese benefits were even greater when it came to cardiovascular health specifically.\n\nRelated: Why is it harder for some people to build muscle than others?\n\nCompared with inactive individuals, women who performed aerobic physical activity had a 36% lower cardiovascular mortality risk, while for active men, this risk reduction was about 14%. Muscle strengthening produced similar outcomes, with a cardiovascular risk reduction of 30% for women and 11% for men, compared to baseline.\n\n\"What surprised us the most was the fact that women who do muscle strengthening had a reduction in their cardiovascular mortality by 30%,\" Gulati told NPR . \"We don't have many things that reduce mortality in that way,\" she added.\n\nThe study did have some limitations, including that people's exercise data was self-reported, so it relied on the participants accurately reporting their activity levels.The study also tracked only leisure-time exercise, meaning it didn't count exercise completed during household tasks or as part of a job, which may have also contributed to the results. In addition, the study didn't account for potentially unassessed health issues in some participants, or changes in people's exercise trends over time.\n\nThat said, the results echo similar findings from a 2011 meta-analysis published in the journal Circulation . This review of 33 studies concluded that there was a stronger link between exercise and lower death risk in women than men.\n\nThe researchers behind the 2024 study hope their findings could help motivate more women to exercise, whether through traditional \" cardio \" or muscle strengthening regimes including bodyweight exercises or lifting weights.\n\n\"I am hopeful that this pioneering research will motivate women who are not currently engaged in regular physical activity to understand that they are in a position to gain tremendous benefit for each increment of regular exercise they are able to invest in their longer-term health,\" Dr. Christine Albert , chair of the Department of Cardiology in the Smidt Heart Institute who was not involved in the study, said in the statement."
        },
        {
            "id": "40ac16ec215302b8b10ead757ed92264",
            "title": "Bat tests positive for rabies at Great Plains Zoo - KELOLAND.com",
            "url": "https://www.keloland.com/news/local-news/bat-tests-positive-for-rabies-at-great-plains-zoo/",
            "publishedAt": "2025-05-17T16:25:58Z",
            "urlToImage": "https://www.keloland.com/wp-content/uploads/sites/103/2024/12/BatGettyImages-1214600684-e1733238123934.jpg?w=1280",
            "source": "KELOLAND.com",
            "description": "SIOUX FALLS, S.D. (KELO) – A bat at the Great Plains Zoo (GPZ) tested positive for rabies. In a press release, the South Dakota Department of Health reported that one bat on the zoo’s campus tested positive for the rabies virus. The bat was found between the …",
            "content": "SIOUX FALLS, S.D. (KELO) – A bat at the Great Plains Zoo (GPZ) tested positive for rabies. \r\nIn a press release, the South Dakota Department of Health reported that one bat on the zoo’s campus tested… [+1254 chars]",
            "full_content": "SIOUX FALLS, S.D. (KELO) – A bat at the Great Plains Zoo (GPZ) tested positive for rabies. \r\nIn a press release, the South Dakota Department of Health reported that one bat on the zoo’s campus tested… [+1254 chars]"
        },
        {
            "id": "97a7b7d6d25bc1627579cd0f900289f3",
            "title": "Inflammation Tied to Motivation Loss in Schizophrenia - Neuroscience News",
            "url": "https://neurosciencenews.com/inflammation-motivation-schizophrenia-28959/",
            "publishedAt": "2025-05-17T15:59:11Z",
            "urlToImage": "https://neurosciencenews.com/files/2025/05/inflammation-motivation-schizophrenia-neuroscience.jpg",
            "source": "Neurosciencenews.com",
            "description": "A new study has uncovered a biological link between inflammation and motivational deficits in people with schizophrenia, identifying a promising treatment target for symptoms that current medications fail to address.",
            "content": "Summary: A new study has uncovered a biological link between inflammation and motivational deficits in people with schizophrenia, identifying a promising treatment target for symptoms that current me… [+6967 chars]",
            "full_content": "Summary: A new study has uncovered a biological link between inflammation and motivational deficits in people with schizophrenia, identifying a promising treatment target for symptoms that current medications fail to address. Higher levels of the inflammatory marker C-reactive protein were associated with reduced activity in brain regions involved in reward and motivation, such as the ventral striatum and ventromedial prefrontal cortex.\n\nThese brain changes were specifically linked to negative symptoms like difficulty initiating work or social relationships, rather than to hallucinations or delusions. The findings lay the groundwork for precision medicine trials targeting inflammation in this subgroup of patients.\n\nKey Facts:\n\nInflammation-Motivation Link: High C-reactive protein levels correlate with motivational deficits.\n\nHigh C-reactive protein levels correlate with motivational deficits. Brain Circuit Impacted: Inflammation disrupts reward-related activity in the ventral striatum and prefrontal cortex.\n\nInflammation disrupts reward-related activity in the ventral striatum and prefrontal cortex. Targeted Treatment Trial: Infliximab is being tested for patients with both high inflammation and negative symptoms.\n\nSource: Emory University\n\nA new study from Emory University has identified a biological connection between inflammation and deficits in motivation in individuals with schizophrenia, offering new hope for treating symptoms that have long been resistant to existing therapies.\n\nPublished in Neuropsychopharmacology, the official publication of the American College of Neuropsychopharmacology, the study found that higher levels of C-reactive protein — a blood biomarker of inflammation produced by the liver — were associated with reduced activity in brain circuits tied to reward and motivation.\n\nFor example, previous studies of medications targeting inflammation in patients with schizophrenia have largely failed by not identifying which patients would benefit from these approaches. Credit: Neuroscience News\n\nThese brain changes, in turn, were linked to negative symptoms of schizophrenia specific to motivational deficits, such as difficulties in finding work, relationships or school. The inflammation was not associated with other schizophrenia symptoms such as hallucinations, delusions or depression.\n\nThe findings are significant because current antipsychotic medications do not address these motivational deficits and, in some cases, may even worsen them. These symptoms are also strongly associated with poor functional outcomes in patients with schizophrenia.\n\nResearchers focused on a key brain circuit involving the ventral striatum and the ventromedial prefrontal cortex — areas previously shown to be sensitive to inflammation in studies of depression.\n\n“This is the first study in schizophrenia to link inflammation with both brain changes in reward circuits and specific motivational symptoms,” says David Goldsmith, MD, associate professor in the Department of Psychiatry and Behavioral Sciences at Emory University School of Medicine.\n\n“By identifying a biological mechanism underlying these symptoms, we are closer to developing targeted treatments that could offer real relief to patients.”\n\nThe study supports a precision medicine approach by suggesting treatments targeting inflammation may only benefit a specific group of patients — those with elevated inflammatory markers and significant motivational challenges.\n\nFor example, previous studies of medications targeting inflammation in patients with schizophrenia have largely failed by not identifying which patients would benefit from these approaches.\n\nThe work helped lay the foundation for a current experimental-medicine trial at Emory testing the anti-inflammatory drug infliximab, commonly used to treat rheumatoid arthritis and inflammatory bowel disease, in patients with schizophrenia who have high inflammation and motivational deficits.\n\nThis is the first study of infliximab in this patient population and designed to test whether the impact of inflammation on this circuit and these symptoms may be causal.\n\n“There is an urgent need to develop new strategies to treat the negative symptoms of schizophrenia, which remains one of the greatest unmet needs in the field,” says Goldsmith.\n\n“We hope this line of research will change that. If we want to support recovery from schizophrenia, we must be able to treat these symptoms.”\n\nFunding: The study was funded by the National Institutes of Mental Health through a K23 Career Development Award (K23MH114037) totaling $957,420 over five years, as well as KL2TR002381 and UL1TR002378. Mentors on the project included Andrew Miller, MD (primary mentor), Michael Treadway, PhD and Elaine Walker, PhD.\n\nAbout this inflammation and schizophrenia research news\n\nAuthor: Jennifer Johnson McEwen\n\nSource: Emory University\n\nContact: Jennifer Johnson McEwen – Emory University\n\nImage: The image is credited to Neuroscience News\n\nOriginal Research: Closed access.\n\n“Inflammation is associated with avolition and reduced resting state functional connectivity in corticostriatal reward circuitry in patients with schizophrenia” by David Goldsmith et al. Neuropsychopharmacology\n\nAbstract\n\nInflammation is associated with avolition and reduced resting state functional connectivity in corticostriatal reward circuitry in patients with schizophrenia\n\nLow-grade inflammation has been associated with negative symptoms in patients with schizophrenia. Of these symptoms, deficits in motivation and pleasure, especially in the domain of avolition, are particularly disabling.\n\nEffects of inflammation on motivational deficits in patients with depression are associated with disruptions in corticostriatal reward circuitry involving the inferior ventral striatum (iVS) and ventromedial prefrontal cortex (vmPFC).\n\nAccordingly, we examined the relationships among inflammation, negative symptoms, and corticostriatal reward circuitry in patients with schizophrenia.\n\nNegative symptoms and high sensitivity C-reactive protein (hsCRP) were obtained in 57 individuals with schizophrenia. Resting state functional connectivity (rsFC) was obtained from a subset of 43 of these individuals.\n\nAssociations were tested between hsCRP and the motivation and pleasure (MAP) and expressivity (EXP) dimensions of the Brief Negative Symptom Scale (BNSS) as well as targeted rsFC between iVS and vmPFC. Covariates in all statistical models included age, sex, race, smoking, body mass index, depression, and chlorpromazine equivalents.\n\nhsCRP was significantly associated with BNSS MAP (β = 0.34, p corr = 0.022, specifically the domains of avolition and asociality (p < 0.05), but not BNSS EXP (β = −0.17, p corr = 0.57) or the domains of blunted affect or alogia (both p > 0.05). hsCRP was also significantly associated with decreased rsFC from right iVS to vmPFC (β=−0.37, p corr = 0.029), which in turn, was associated with increased avolition in individuals with higher (hsCRP >2 mg/L) but not lower inflammation (β=−14.01, p = 0.007 vs. β = 0.07, p = 0.77, respectively).\n\nhsCRP was associated with reduced avolition and corticostriatal rsFC in patients with schizophrenia and increased inflammation, underscoring the need for further research to replicate these associations with brain connectivity changes in this subgroup of individuals with schizophrenia."
        },
        {
            "id": "fb7d6af8f95105ab753363389afa9442",
            "title": "Your Brain Loves Deep Breathing, Science Explains Why - Neuroscience News",
            "url": "https://neurosciencenews.com/breathwork-calm-neuroscience-28958/",
            "publishedAt": "2025-05-17T15:45:06Z",
            "urlToImage": "https://neurosciencenews.com/files/2025/05/deep-beating-calmness-neurosicnce.jpg",
            "source": "Neurosciencenews.com",
            "description": "Breathwork, or the practice of intentionally controlling one’s breathing, has been shown to calm brain activity, reduce anxiety, and even ease symptoms of depression.",
            "content": "Summary: Breathwork, or the practice of intentionally controlling ones breathing, has been shown to calm brain activity, reduce anxiety, and even ease symptoms of depression.\r\nDeep, slow breathing en… [+6815 chars]",
            "full_content": "Summary: Breathwork, or the practice of intentionally controlling one’s breathing, has been shown to calm brain activity, reduce anxiety, and even ease symptoms of depression.\n\nDeep, slow breathing engages neural circuits that regulate emotional states, producing a measurable calming effect. This process is rooted in biology, not belief—animal studies show that consistent slow breathing reduces fear responses, confirming the effect isn’t just placebo.\n\nSimple techniques like box breathing and 4-7-8 breathing can offer benefits in as little as five minutes. While intense breathwork methods can cause altered states, most people benefit from basic breathing exercises. Breathwork offers a powerful, accessible tool for managing stress and enhancing mental well-being.\n\nKey Facts:\n\nNeurobiological Basis: Breathwork activates calming signals across brain circuits.\n\nBreathwork activates calming signals across brain circuits. Proven in Animals: Mice trained to breathe slowly showed reduced fear responses.\n\nMice trained to breathe slowly showed reduced fear responses. Simple Is Effective: Techniques like box breathing can lower stress in just minutes.\n\nSource: UCLA\n\nBreathwork – intentionally changing breathing patterns to improve physical, mental or emotional well-being – may seem woo-woo, but the science behind the practice is sound, says Jack Feldman, PhD, a professor of neurobiology at the David Geffen School of Medicine at UCLA.\n\nDr. Feldman discussed how breathing affects the brain in a conversation with Tyrone Lindqvist, lead singer of the Australian electronic dance trio Rufus Du Sol, on a recent episode of the “Sing for Science” podcast.\n\nIn other words, do deep breaths calm us down because we expect them to? Credit: Neuroscience News\n\nThe band has incorporated breathwork into its pre-performance ritual, Lindqvist said, and its new album, “Inhale/Exhale,” was partly inspired by the practice.\n\n“Breathwork has felt like a big part of our last three years,” Lindqvist said.\n\nDr. Feldman has been studying breathing and the brain for more than 40 years. In 1986, he discovered and named the area in the brain responsible for generating and controlling breathing, known as the preBötzinger Complex.\n\nMore recently, he and colleagues have investigated the effects of breathing rhythms and patterns on emotions, finding that slower breathing leads to a calmer mental state.\n\n“We think that the survival of early mammals was improved by their ability to breathe slowly,” Dr. Feldman said.\n\n“All mammals sigh, and we think under proper conditions they use their own form of breathwork in response to stressful situations. … It’s something we think that evolved early that we ultimately hijacked in terms of breathwork.”\n\nWhat makes breathwork work?\n\nDr. Feldman started his research in this area probing what he thought was a simple question: What mechanisms in the brain allow it to create a reliable breathing pattern that persists throughout the lifespan and adapts to movement, speech and other activities instantly and without thought?\n\nThis line of inquiry has led him to publish more than 150 scientific papers to date.\n\nThe short answer to why breathwork can have such profound effects on the body and mind is that there are signals related to breathing throughout the brain, he said.\n\nAn intentionally deep breath affects those signals, resulting in a calming response. Breathing is also involved in the signaling pathway for depression, he said, adding that studies show that consistent breathwork practice can be effective in treating conditions such as anxiety and depression.\n\nBut one doesn’t need to understand how breath affects the brain to benefit from breathwork, Dr. Feldman said, “much like you can drive a car without understanding how an engine works.”\n\nPracticing common breathing techniques, such as box breathing or 4-7-8 breathing, for a few minutes a day is a great way to start, he said.\n\nBox breathing involves inhaling for four counts, holding for four, exhaling for four, and holding for four; 4-7-8 breathing refers to inhaling for four counts, holding for seven, and exhaling for eight.\n\nDr. Feldman said Navy SEALS are known to use box breathing and other breathwork techniques to calm themselves in highly stressful situations.\n\nSome of Dr. Feldman’s recent work has investigated whether the placebo effect contributes to the efficacy of breathwork. In other words, do deep breaths calm us down because we expect them to?\n\n“You have a stressful situation, just sit down and take a few deep breaths, five minutes, and people will discover it’s restorative,” says Dr. Jack Feldman.\n\nTo that end, he and his colleagues modified breathing rates in mice, causing them to breathe more slowly for 30 minutes a day over a period of four weeks. Tests afterward showed the mice were much less fearful than a control group whose breathing wasn’t slowed.\n\n“It’s pretty amazing how much less fearful they were,” Dr. Feldman said. “The fact that we can see the effect of breathwork in mice really indicates that it’s … not all placebo components.”\n\nHe hopes the study, which is awaiting publication, “will have a positive impact on individuals who think breathwork is one of these woo-woo things, that you have to believe in something in particular to make it work,” he said.\n\nBreathing methods\n\nLindqvist was introduced to breathwork by his father-in-law, who was interested in Wim Hof, a Dutch athlete who advocates an intense breathing technique of quick, deep breaths followed by holding the breath for as long as a minute.\n\nThe practice can lead to lightheadedness and tingling sensations in the hands and feet. Hof claims it supports stress reduction and improves sleep. His website also indicates the technique can lead to loss of consciousness.\n\nFor Lindqvist, the practice created a feeling of being “extremely present” that lasted for several hours, he said.\n\nPeople new to breathwork should start with something less intense, Dr. Feldman suggested: “Don’t go out and run a marathon when you’ve been sitting on the couch.”\n\nThe Wim Hof Method and a similar technique, Holotropic Breathwork, can lead to altered states of consciousness, which both Lindqvist and Dr. Feldman described as “psychedelic.”\n\nThis – and the tingling physical sensations – likely results from changes in carbon dioxide levels caused by hyperventilation, Dr. Feldman explained.\n\nCarbon dioxide levels determine the pH, or acid base balance, of the blood, which has “a profound effect on the neurons in your brain as well as the rest of your body,” he said.\n\nTechniques such as the Wim Hof Method or Holotropic Breathwork can be invigorating, he said. But basic, slow breathing is all that’s needed for most people to experience the stress-reducing benefits of breathwork.\n\n“You have a stressful situation, just sit down and take a few deep breaths, five minutes, and people will discover it’s restorative,” Dr. Feldman said.\n\n“Maybe not everyone, but a lot of people will find that to be beneficial, and to me, that’s amazing.”\n\nAbout this breathwork and neuroscience research news\n\nAuthor: Will Houston\n\nSource: UCLA\n\nContact: Will Houston – UCLA\n\nImage: The image is credited to Neuroscience News"
        },
        {
            "id": "972e6acac7fe1c2770d27f3e0d9b432a",
            "title": "Midlife Cortisol Levels Linked to Alzheimer’s Risk - Neuroscience News",
            "url": "https://neurosciencenews.com/cortisol-aging-alzheimers-28957/",
            "publishedAt": "2025-05-17T15:21:31Z",
            "urlToImage": "https://neurosciencenews.com/files/2025/05/cortisol-Alzheimers-aging-neuroscience.jpg",
            "source": "Neurosciencenews.com",
            "description": "A new study finds that elevated cortisol levels in midlife are linked to increased brain amyloid deposition—a key marker of Alzheimer’s disease—specifically in post-menopausal women.",
            "content": "Summary: A new study finds that elevated cortisol levels in midlife are linked to increased brain amyloid depositiona key marker of Alzheimers diseasespecifically in post-menopausal women. Researcher… [+8321 chars]",
            "full_content": "Summary: A new study finds that elevated cortisol levels in midlife are linked to increased brain amyloid deposition—a key marker of Alzheimer’s disease—specifically in post-menopausal women. Researchers tracked 305 cognitively healthy individuals over 15 years and discovered that high cortisol predicted amyloid buildup later in life, but only among women who had gone through menopause.\n\nThe findings suggest that hormonal changes may amplify cortisol’s harmful effects on brain health. No similar relationship was found in men or with tau protein, another Alzheimer’s marker.\n\nKey Facts:\n\nSex-Specific Risk: High midlife cortisol predicted Alzheimer’s risk only in post-menopausal women.\n\nHigh midlife cortisol predicted Alzheimer’s risk only in post-menopausal women. Amyloid Link: Cortisol levels were associated with increased amyloid buildup, not tau.\n\nCortisol levels were associated with increased amyloid buildup, not tau. Prevention Potential: Findings suggest early stress reduction and hormone-based strategies could lower Alzheimer’s risk.\n\nSource: UT San Antonio\n\nCan stress lead to Alzheimer’s disease? It can in women who are post-menopausal, a study led by The University of Texas Health Science Center at San Antoino (UT Health San Antonio) shows.\n\n\n\nAnalyzing data from 305 cognitively unimpaired participants in the Framingham Heart Study, a long-term and ongoing community-based cohort study of residents in Framingham, Massachusetts, the scientists discovered that high levels of the stress hormone cortisol in midlife are linked to increased amyloid deposition in post-menopausal persons later.\n\n\n\nAmyloids are proteins that have folded incorrectly, preventing biologic function, forming deposits in tissues and organs, and implicated in Alzheimer’s disease.\n\nNo significant associations were observed in males or with tau burden, referring to the tau protein that contributes to neuronal dysfunction and death. Credit: Neuroscience News\n\nBy comparing midlife cortisol levels at the beginning of a 15-year period with disease indicators at the end, the researchers were able to determine that those levels could serve as an Alzheimer’s disease biomarker, with particular attention to gender differences and menopausal status.\n\nNo significant associations were observed in males or with tau burden, referring to the tau protein that contributes to neuronal dysfunction and death.\n\n\n\n“The results highlight the importance of identifying early risk factors when biomarkers are detectable but cognitive impairment is absent,” said Arash Salardini, MD, associate professor of cognitive and behavioral neurology with the Glenn Biggs Institute for Alzheimer’s and Neurodegenerative Diseases at UT Health San Antonio.\n\nSalardini is first author of the study titled, “Elevated serum cortisol associated with early-detected increase of brain amyloid deposition in Alzheimer’s disease imaging biomarkers among menopausal women: The Framingham Heart Study,” published April 24 in Alzheimer’s & Dementia: The Journal of the Alzheimer’s Association.\n\n\n\nOther authors also are with UT Health San Antonio, as well as the University of Texas School of Public Health San Antonio; Framingham Heart Study of the National Heart, Lung, and Blood Institute of the National Institutes of Health; Boston University; Gonzaba Medical Group, San Antonio; University of Galway, Ireland; Cedars-Sinai Medical Center; Massachusetts General Hospital/Harvard Medical School; New York University Grossman School of Medicine; Brigham and Women’s Hospital; Yale University; and the University of California at Davis.\n\n“Our work shows that considering sex and hormonal status in understanding Alzheimer’s disease pathogenesis is important, and suggests that stress reduction and hormonal interventions may hold promise for Alzheimer’s prevention, especially in at-risk women,” said Sudha Seshadri, founding director of the Biggs Institute and senior author of the study.\n\n\n\nTargeting risk factors early\n\n\n\nThe study notes that “sporadic” Alzheimer’s disease is the leading cause of cognitive decline in older adults. That features a prolonged asymptomatic phase of amyloid beta accumulation, the main component of amyloid plaques, eventually triggering progressive cognitive decline.\n\n\n\nRecognizing that these biological changes are already well established by the time symptoms emerge, effective early interventions must target Alzheimer’s disease risk factors during the preclinical stages.\n\nHowever, despite significant advancements in understanding how the disease affects the body’s normal biological processes, more than half of the overall risk has remained unexplained, underscoring the critical need to identify additional risk factors that can be targeted during the preclinical stage.\n\n\n\nOne promising line of investigation centers on cortisol, a steroid hormone essential for cellular homeostasis, or balance, and the stress response.\n\nGenetic studies had identified mutations in glucocorticoid, or steroid hormones that have anti-inflammatory and immunosuppressive effects, signaling pathways that increase susceptibility to Alzheimer’s disease.\n\n\n\nAlso, several cross-sectional and longitudinal studies had reported that higher blood cortisol levels are linked to an increased likelihood of developing the disease.\n\n\n\nTo address gaps and inconsistencies across those studies, the researchers led by UT Health San Antonio conducted a longitudinal analysis using data from the third-generation cohort of the Framingham Heart Study, which dates to 1948 and now is directed by the National Heart, Lung, and Blood Institute of the National Institutes of Health.\n\n\n\nThey assessed the relationship between serum cortisol levels in the 305 cognitively unimpaired, middle-aged individuals – 48.5% female, with a mean age of 39.6 years –and amyloid/tau burdens approximately 15 years later using positron emission tomography (PET) imaging. And they performed multivariable regression analyses adjusted for confounders.\n\n\n\nAll this allowed them to investigate cortisol’s impact at an earlier stage of Alzheimer’s disease pathogenesis, where interventions might be most effective.\n\n\n\nGiven the neuroprotective effects of estrogen and testosterone, which mitigate cortisol’s deleterious impact on neural tissues, they also explored sex-specific differences, focusing particularly on post-menopausal risk.\n\n\n\nThey hypothesized that cortisol’s impact on Alzheimer’s pathology would be more pronounced in women, especially after menopause, consistent with some previous findings.\n\n\n\nIndeed, they found that post-menopausal women with high midlife cortisol are at increased risk of Alzheimer’s disease, and that post-menopausal hormone changes may amplify cortisol’s effects on amyloid.\n\n\n\n“Longitudinal follow-up of our cohort will be crucial to determine whether these early amyloid changes translate into clinical symptoms and to clarify the causal role of cortisol in Alzheimer’s disease development,” Salardini said.\n\nAbout this Alzheimer’s disease research news\n\nAuthor: Steven Lee\n\nSource: UT San Antonio\n\nContact: Steven Lee – UT San Antonio\n\nImage: The image is credited to Neuroscience News\n\nOriginal Research: Open access.\n\n“Elevated serum cortisol associated with early-detected increase of brain amyloid deposition in Alzheimer’s disease imaging biomarkers among menopausal women: The Framingham Heart Study” by Arash Salardini et al. Alzheimer’s & Dementia\n\nAbstract\n\nElevated serum cortisol associated with early-detected increase of brain amyloid deposition in Alzheimer’s disease imaging biomarkers among menopausal women: The Framingham Heart Study\n\nINTRODUCTION\n\nThis study investigates whether midlife cortisol levels predict Alzheimer’s disease (AD) biomarker burden 15 years later, with particular attention to sex differences and menopausal status.\n\nMETHODS\n\nWe analyzed data from 305 cognitively unimpaired Framingham Heart Study participants (48.5% female; mean age: 39.6 ± 8.1 years). Serum cortisol was categorized into tertiles, with amyloid ([11C]PiB) and tau ([18F]Flortaucipir) positron emission tomography (PET) imaging conducted 15 years later. We performed multivariable regression analyses adjusted for confounders including, apolipoprotein E4 (APOE4) status.\n\nRESULTS\n\nElevated midlife cortisol correlated with increased amyloid deposition, specifically in post-menopausal women, predominantly in posterior cingulate, precuneus, and frontal-lateral regions (p < 0.05). No significant associations were observed with tau burden or in males.\n\nDISCUSSION\n\nThese findings reveal post-menopausal women with high midlife cortisol are at increased risk of AD. Results highlight the importance of identifying early risk factors when biomarkers are detectable but cognitive impairment is absent."
        }
    ]
}