{
    "status": "ok",
    "totalResults": 62,
    "category": "technology",
    "country": "us",
    "timestamp": "2025-05-19 14:31:49",
    "articles": [
        {
            "id": "9e64a6b4522ddf007020eabb2b00895d",
            "title": "Xiaomi’s In-House XRING 01 Was Made Possible Thanks To Research Efforts That Lasted 10 years, CEO Says The Chipset Was Part Of Investments Touching $14.5 Billion - Wccftech",
            "url": "https://wccftech.com/xiaomi-xring-01-development-lasted-10-years-and-cost-14-5-billion/",
            "publishedAt": "2025-05-18T05:13:00Z",
            "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/05/Xiaomi-XRING-01-2.jpg",
            "source": "Wccftech",
            "description": "Xiaomi CEO wrote a speech talking about the XRING 01 and how its development efforts spanned 10 years, along with a hefty bill",
            "content": "The XRING 01 received an official announcement earlier this week, with Xiaomis CEO stating that the SoC would be released later this month. While the specifications were not a part of the earlier pos… [+1923 chars]",
            "full_content": "The XRING 01 received an official announcement earlier this week, with Xiaomi’s CEO stating that the SoC would be released later this month. While the specifications were not a part of the earlier post, Chief Executive Lei Jun later penned a speech, mentioning the lengthy efforts and the enormous sums of money it took to materialize the XRING 01. While Xiaomi has had some experience developing its in-house SoC before, nothing was done on this scale or intricacy.\n\nMore than $4 billion has been invested in 2025 alone, with the XRING 01 being one of the highlights of developing core technology that will set the company apart from the competition\n\nIt was previously reported that, to make XRING 01 a reality, around 1,000 employees were hired, with the entire division being overseen by a former Qualcomm senior director who would directly report to Lei Jun. In short, Xiaomi likely recruited the absolute best to ensure that it would develop the ideal alternative to help reduce dependency on the likes of Qualcomm and MediaTek. As reported by ITHome, the CEO’s speech mentioned that the efforts to launch the XRING 01 took a whopping 10 years.\n\nThe custom chipset’s existence will allow Xiaomi to have better control over the hardware and software integration, with the company wanting to set itself apart from other industry players by focusing on core technology. However, this direction came at a great cost, literally. Lei Jun mentioned that R&D investments reached 105 billion yuan, which is around $14.5 billion, in only the last five years. While the aforementioned figure might not have been dedicated entirely to the XRING 01, we can assume that a decent chunk has gone into its development.\n\nAdditionally, the Xiaomi CEO says that over 30 billion yuan, or $4.1 billion, has been spent on R&D alone this year. Of course, it was far from an easy ride, with the Chief Executive noting that in the company’s 15-year timeline, it has had to face a bevy of challenges and immense adversity. 2019 was mentioned to be a particularly difficult period, but Lei Jun states that Xiaomi’s resilience is what it is today. According to a previous rumor, the XRING 01 has been fabricated on TSMC’s older 4nm process, and will rely on ARM’s older CPU designs instead of in-house cores.\n\nNews Source: ITHome"
        },
        {
            "id": "64d6eb76a344e7ed3e50163c75d24f45",
            "title": "Google I/O 2025: How to Watch and What to Expect - CNET",
            "url": "https://www.cnet.com/tech/mobile/google-io-2025-android-how-to-watch-and-what-to-expect/",
            "publishedAt": "2025-05-18T04:30:58Z",
            "urlToImage": "https://www.cnet.com/a/img/resize/2745cc26ea953a00ce37b342e4e529cdebdf9e62/hub/2025/05/09/f774bb4a-bc7c-433e-b90e-dceefcf1c2ae/promo-img.png?auto=webp&fit=crop&height=675&width=1200",
            "source": "CNET",
            "description": "With Android 16 out of the way, Google I/O will certainly be all about AI.",
            "content": "Google I/O 2025 takes place on May 20 and 21 with Google's big keynote happening on day 1. We expect Big G to talk about its myriad innovations across its ever-expanding portfolio of products -- almo… [+3264 chars]",
            "full_content": "Google I/O 2025 takes place on May 20 and 21 with Google's big keynote happening on day 1. We expect Big G to talk about its myriad innovations across its ever-expanding portfolio of products -- almost certainly with a huge focus on AI every step of the way. If we collectively cross our fingers, promise to be good and eat all our vegetables then we may even be treated to a sneak peek at upcoming hardware.\n\nRead more: Android 16: Everything Google Announced at the Android Show\n\nGoogle also hosted a totally separate event that focused solely on Android. The Android Show: I/O Edition saw the wrappers come off Android 16, with insights into the new Material 3 Expressive interface, updates to security and a focus on Gemini and how it'll work on a variety of other devices.\n\nBy breaking out Android news into its own virtual event, Google frees itself to spend more time during the I/O keynote to talk about Gemini, Deep Mind, Android XR and Project Astra. It's going to be a jam-packed event, so here's how you can watch I/O 2025 as it happens and what you can look forward to.\n\nThe Android Show focused solely on updates to Android 16. Google\n\nGoogle I/O: Where to watch\n\nGoogle I/O proper kicks off with a keynote taking place on May 20, 10 a.m. PDT (1 p.m. EDT, 6 p.m. BST). It'll almost certainly be available to stream online on Google's own YouTube channel, although a holding video is yet to be available. There's no live link on the I/O website yet, either, though you can use the handy links to add the event to your calendar of choice. Expect links to a livestream to be available closer to the day.\n\nWhat to expect from Google I/O 2025\n\nLittle chat about Android 16: As Google gave Android 16 its own outing already, it's likely that it won't be mentioned all that much during I/O. In fact at last year's event, Android was barely mentioned, while uses of the term \"AI\" went well over a hundred.\n\nSamsung's Project Moohan may get an outing during I/O or the Android Show. Tara Brown/CNET\n\nAndroid XR: Google didn't talk much about Android XR during the Android show, focusing instead on the purely phone-based updates to the platform. We expected to hear more about the company's latest foray into mixed-reality headsets in partnership with Samsung and its Project Moohan headset, so it's possible that this is being saved for I/O proper.\n\nGemini: With Android being spun out into its own separate event, Google is evidently clearing the way for I/O to focus on everything else the company does. AI will continue to dominate the conversation at I/O, just as it did last year (though hopefully Google can make it more understandable) with updates to many of its AI platforms expected to be announced.\n\nGemini is expected to receive a variety of update announcements, including more information on its latest 2.5 Pro update which boasts various improvements to its reasoning abilities, and in particular to its helpfulness for coding applications. Expect lots of mentions of Google's other AI-based products, too, including DeepMind, LearnLM and Project Astra. Let's just hope Google has figured out how to make this information make any kind of sense.\n\nBeyond AI, Google may talk about updates to its other products including GMail, Chrome and the Play Store, although whether these updates are big enough to be discussed during the keynote rather than as part of the developer-focused sessions following I/O's opening remains to be seen."
        },
        {
            "id": "b1974d5b0bed2ef7e9a69263141a184d",
            "title": "Fate/hollow ataraxia REMASTERED launches in 2025 - Gematsu",
            "url": "https://www.gematsu.com/2025/05/fate-hollow-ataraxia-remastered-launches-in-2025",
            "publishedAt": "2025-05-18T03:07:48Z",
            "urlToImage": "https://www.gematsu.com/wp-content/uploads/2025/05/Fate-hollow-ataraxia-REMASTERED-Ann_05-17-25.jpg",
            "source": "Gematsu",
            "description": "Fate/hollow ataraxia REMASTERED will launch for Switch and PC via Steam in 2025, publisher Aniplex and developer TYPE-MOON announced.",
            "content": null,
            "full_content": "Fate/hollow ataraxia REMASTERED will launch for Switch and PC via Steam in 2025, publisher Aniplex and developer TYPE-MOON announced.\n\nThe remastered version of the visual novel Fate/hollow ataraxia was first announced in August 2024, but a release window was not announced at the time.\n\nIf you missed it last year, watch the announcement teaser trailer here."
        },
        {
            "id": "442effeffed7eafce72f45d0c8a857f0",
            "title": "A manuscript over 2,000 years old and buried under the ashes of Mount Vesuvius has been analyzed thanks to a new technique. - Stewartville Star",
            "url": "https://thinkstewartville.com/2025/05/17/a-manuscript-over-2000-years-old-and-buried-under-the-ashes-of-mount-vesuvius-has-been-analyzed-thanks-to-a-new-technique/",
            "publishedAt": "2025-05-18T02:36:00Z",
            "urlToImage": "https://thinkstewartville.com/wp-content/uploads/2025/05/thinkstewartville.com-auto-draft-6480846130354-2025-05-15t091854.569.jpg",
            "source": "Thinkstewartville.com",
            "description": "The eruption of Mount Vesuvius in 79 AD sealed the fate of Pompeii and Herculaneum, preserving countless artifacts beneath layers of volcanic ash. Nearly two millennia later, researchers have made a remarkable breakthrough in analyzing one of history's most e…",
            "content": "Show table of content Hide table of content \r\nThe eruption of Mount Vesuvius in 79 AD sealed the fate of Pompeii and Herculaneum, preserving countless artifacts beneath layers of volcanic ash. Nearly… [+6764 chars]",
            "full_content": "The eruption of Mount Vesuvius in 79 AD sealed the fate of Pompeii and Herculaneum, preserving countless artifacts beneath layers of volcanic ash. Nearly two millennia later, researchers have made a remarkable breakthrough in analyzing one of history’s most elusive treasures: ancient manuscripts buried under Vesuvius’s destructive force. This scientific achievement represents a pivotal moment for archaeology and classical studies, revealing texts once thought permanently lost to time.\n\nRevolutionary imaging technique reveals hidden ancient text\n\nA manuscript over 2000 years old, preserved under Vesuvius’s volcanic ash, has recently yielded its secrets thanks to groundbreaking technology. This remarkable discovery came through combining advanced X-ray imaging with computer-assisted simulation, enabling researchers to virtually unroll the fragile document without physical manipulation. The breakthrough has revealed readable text on a scroll too delicate to handle conventionally.\n\n“It’s the first roll where ink is visible on the scan. Nobody knew what it was. We didn’t even know if there was writing,” explained Dr. Michael McOsker, a papyrologist from University College London, in an interview with The Guardian. The excitement surrounding this achievement stems from decades of frustration among scholars who possessed these ancient treasures but lacked the means to access their contents.\n\nScience Scientists reveal the first images of the most elusive animal in the ocean!\n\nThe scroll originated from a luxurious Roman villa in Herculaneum, believed to have belonged to Julius Caesar’s father-in-law. Excavations in the 18th century uncovered these buried treasures, which found their way to the Bodleian Library at Oxford University. For centuries, these carbonized scrolls remained tantalizingly closed books, their contents concealed by their fragile condition that caused them to crumble when handled.\n\nAfter careful analysis of the revealed letters, researchers have attributed the manuscript to Philodemus, an Epicurean philosopher who lived between 110 and 35 BCE. This attribution confirms the text’s remarkable age – over two millennia – and identifies its subject matter as a philosophical examination of vices. The discovery of ancient philosophical insights provides modern scholars with fresh perspective on classical ethical thought.\n\nGlobal competition spurs technological innovation\n\nThe technological breakthrough didn’t happen by chance. In 2023, the Vesuvius Challenge was launched, incentivizing researchers worldwide to develop methods for reading and deciphering manuscripts recovered from Vesuvius’s ash. This competitive approach proved remarkably effective in accelerating innovation in this specialized field.\n\nBy 2024, a research team shared a $700,000 prize for developing an AI model capable of reading 2,000 Greek letters on another manuscript from the same collection. The pace of advancement has astonished classical scholars accustomed to methodical progress spanning decades. “The pace is accelerating very quickly… All the technological advances in this area have been made in the last three to five years, and on the timescale of classicists, that’s amazing,” Dr. McOsker told The Guardian.\n\nScience “A giant nuclear laser under construction”: an American satellite reveals China’s breathtaking ambition.\n\nThe competition’s success demonstrates how targeted incentives can drive rapid scientific progress. Similar to how algorithmic approaches have solved seemingly impossible problems in other fields, the Vesuvius Challenge channeled diverse expertise toward a specific archaeological obstacle.\n\nWith the manuscript’s title and author now identified, researchers are working to decipher all remaining letters to reconstruct a coherent text. The speed of recent developments suggests this goal may be achieved sooner than initially expected, opening doors to further discoveries within Herculaneum’s library.\n\nHerculaneum’s hidden literary treasures\n\nWhile Pompeii often dominates discussions about Vesuvius’s eruption, Herculaneum harbors equally significant archaeological treasures. This Roman city, also devastated by pyroclastic flows in 79 AD, has yielded numerous manuscript scrolls that promise to expand our understanding of classical literature and philosophy.\n\nThe villa where these scrolls were discovered represents one of antiquity’s most significant private libraries. The connection to Julius Caesar’s family underscores the prestigious nature of this collection. Until recently, scholars could only speculate about the contents of these carbonized scrolls, making each successful reading a momentous occasion.\n\nScience 53 years after its launch, a Soviet space probe crashes back to Earth.\n\nThe ability to finally access these texts provides an unprecedented window into ancient intellectual life. “Everything we get from the Herculaneum library is new to us,” noted Dr. McOsker, highlighting the scholarly significance of these manuscripts. Unlike reunions with long-lost historical elements, each decoded manuscript represents entirely new material rather than rediscoveries of known texts.\n\nThe manuscript attributed to Philodemus adds to our knowledge of Epicurean philosophy, a significant school of thought that emphasized pleasure as life’s highest good while advocating moderation and intellectual pursuits. His writings on vices would have provided ethical guidance to Roman elites of the late Republic, making this text valuable for understanding both philosophical development and practical ethics in the ancient world.\n\nFuture prospects for vesuvian manuscripts\n\nThe successful decoding of this manuscript opens possibilities for analyzing hundreds more scrolls recovered from Herculaneum. With technology advancing rapidly, scholars anticipate accelerated progress in revealing these long-hidden texts. Each newly deciphered scroll could potentially transform our understanding of classical literature, philosophy, and history.\n\nThe techniques developed through the Vesuvius Challenge may find applications beyond these specific artifacts. Similar approaches could potentially help researchers examine other damaged or fragile historical documents worldwide. The ability to detect hidden information in deteriorated materials represents a significant advancement for conservation science broadly.\n\nScience Scientists create an accurate map of the seabed and discover nearly 100,000 submerged underwater mountains.\n\nAs artificial intelligence and imaging technologies continue to evolve, the barrier between present and past grows increasingly permeable. Texts once thought permanently lost to history may soon share their wisdom with modern readers, bridging a gap of two millennia and allowing ancient voices to speak again.\n\nThe Herculaneum scrolls represent just one application of these emerging technologies. As researchers refine their methods and expand their toolkit, countless other historical mysteries may yield their secrets, transforming our understanding of human intellectual history one ancient manuscript at a time."
        },
        {
            "id": "38e1cbaf414de7be564df87ab80fe30f",
            "title": "Here's A Look At The Size And Inside Of Switch 2 Game Cases - Nintendo Life",
            "url": "https://www.nintendolife.com/news/2025/05/heres-a-look-at-the-size-and-inside-of-switch-2-game-cases",
            "publishedAt": "2025-05-18T00:26:45Z",
            "urlToImage": "https://images.nintendolife.com/b340d43b4d606/large.jpg",
            "source": "Nintendo Life",
            "description": "Arriving in store next month",
            "content": "Image: Nintendo\r\nNintendo is slightly mixing up its box art game for the Switch 2 generation with red cases and artwork that now wraps around the spine of the case.\r\nIt seems another look at these ca… [+1117 chars]",
            "full_content": "Nintendo is slightly mixing up its box art game for the Switch 2 generation with red cases and artwork that now wraps around the spine of the case.\n\nIt seems another look at these cases (via Genki_JPN on social media) has now revealed what you can expect to see on the inside of these cases when you open them up.\n\nCompared to the transparent Switch case, the Switch 2 case is now red on the inside. The size of the cases also appears to be the same dimensions as the original Switch game case.\n\nHere is the inside. Red plastic is slightly clear instead of totally clear like the Switch 1 game cases. Otherwise they are the same as far as I can tell. pic.twitter.com/OA8ajFqmuW May 17, 2025\n\nAs you can see, the game manual holder returns in Switch 2 game cases and the game card holder is once again located at the bottom of the case. These new physical cases will arrive next month in stores alongside the release of the Switch 2.\n\nThis follows Nintendo sharing a look at the Mario Kart World box art last week in the Nintendo Today! mobile application. You can see this in our previous coverage here on Nintendo Life:"
        },
        {
            "id": "ee88eef367dc3228b70e5018db023e83",
            "title": "The seventh Google Store opens on May 30 - 9to5Google",
            "url": "http://9to5google.com/2025/05/17/google-store-domain-northside-austin/",
            "publishedAt": "2025-05-17T22:58:00Z",
            "urlToImage": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2022/08/google-store-logo-2.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
            "source": "9to5google.com",
            "description": "At the end of this month, Google Store Domain Northside in Austin, Texas will open as the company’s seventh retail location in the US.",
            "content": "At the end of this month, Google Store Domain Northside in Austin, Texas will open as the companys seventh retail location in the US. \r\nNews about this location emerged in January, with Texas becomin… [+983 chars]",
            "full_content": "At the end of this month, Google Store Domain Northside in Austin, Texas will open as the company’s seventh retail location in the US.\n\nNews about this location emerged in January, with Texas becoming the Google Store’s fifth state. It is located in an outdoor shopping area surrounded by restaurants, residential space, and corporate offices. There is a pretty big Apple Store in the area.\n\nLocated at 11701 Domain Blvd, Suite 164, Austin, TX 78758, the Google Store grand opening is set for Friday, May 30 at 10:00 AM CDT.\n\nThis is Google’s second store opening this year after Santa Monica, with this upcoming launch matching the two-store pace of 2024. It remains to be seen if there will be others this year.\n\nAdvertisement - scroll for more content\n\nAs always, you can demo and buy Pixel phones, watches, earbuds, and tablets, as well as Nest smart home devices (like cameras and thermostats). There’s also Fitbit, other accessories, and branded Google merchandise.\n\nMeanwhile, those in the area can order online and pick-up in the store, while Google offers troubleshooting, Pixel phone repair, classes, and other activities."
        },
        {
            "id": "95ac8dfc0252048acd01ba5b9a7dda09",
            "title": "Ed Boon said that there could be 'years of content' for Mortal Kombat 1 but it sadly didn't even make it two years - EventHubs",
            "url": "https://www.eventhubs.com/news/2025/may/17/ed-boon-mk1-content-conclusion/",
            "publishedAt": "2025-05-17T22:31:08Z",
            "urlToImage": "https://media.eventhubs.com/images/2025/05/17_mk1-ending-bnrt.webp",
            "source": "EventHubs",
            "description": "Mortal Kombat 1: Definitive Edition was announced earlier this week. Acquiring Mortal Kombat 1: Definitive Edition will give players access to Mortal Kombat 1's base game, Kombat Pack 1, the Khaos Reigns story expansion, Kombat Pack 2, and the ...",
            "content": "Mortal Kombat 1: Definitive Edition was announced earlier this week. Acquiring Mortal Kombat 1: Definitive Edition will give players access to Mortal Kombat 1's base game, Kombat Pack 1, the Khaos Re… [+4906 chars]",
            "full_content": "Mortal Kombat 1: Definitive Edition was announced earlier this week. Acquiring Mortal Kombat 1: Definitive Edition will give players access to Mortal Kombat 1's base game, Kombat Pack 1, the Khaos Reigns story expansion, Kombat Pack 2, and the new movie skins.\n\nFans will be able to pick up Mortal Kombat 1: Definitive Edition on the PlayStation 5, Xbox Series and PC for $69.99. The Switch version is a little cheaper as it's going for $59.99.\n\nOverall, this is a pretty good deal for those that have yet to buy Mortal Kombat 1. We'll likely see an influx of players in the coming days due to the release of the Definitive Edition package.\n\nHowever, most longtime fans of NetherRealm Studios games will probably see this as bad news for the future of Mortal Kombat 1. More specifically, it's a heavy indicator that Mortal Kombat 1 no longer has a future.\n\nSimilar situations happened with the releases of Mortal Kombat: Komplete Edition, Mortal Kombat XL and Mortal Kombat 11 Ultimate for Mortal Kombat 9, Mortal Kombat X and Mortal Kombat 11 respectively.\n\nEach of these rereleases packaged all available post-launch content that had been released up to that point. This also meant that NetherRealm Studios would be releasing no additional DLC for that game as they had moved on to their next project.\n\nLast time with Mortal Kombat 11, NetherRealm Studios had to outright confirm that DLC had concluded and that the company had moved on to their next project. We now know that project was Mortal Kombat 1 all along.\n\n\"So we were pretty sure when we launched Mortal Kombat 1 that we were going to be doing years of content, and this is year two.\" — Ed Boon\n\nIn some regards, it is somewhat disappointing to learn that this is actually the end of new DLC for Mortal Kombat 1. Shortly after the reveal of Mortal Kombat 1: Khaos Reigns, Ed Boon mentioned more plans for the game's future.\n\n\"With Mortal Kombat 11, we had Mortal Kombat 11, Aftermath, and then Ultimate,\" said Boon on the subject. \"So we would keep adding characters and story.\"\n\nNetherRealm Studios had this practice where they'd manage to create more and more content with additional game releases. Mortal Kombat X had more DLC than Mortal Kombat 9 while Mortal Kombat 11 had more than Mortal Kombat X.\n\n\"That's kind of the way we're doing our games now,\" continued Boon. \"So we were pretty sure when we launched Mortal Kombat 1 that we were going to be doing years of content, and this is year two.\"\n\nLooking back, this feels more like a hope from Ed Boon rather than a promise, especially since he mentioned that NetherRealm Studios was \"pretty sure\" that they'd \"be doing years of content.\"\n\nHowever, it's important to note that Mortal Kombat 1 was originally released on September 14, 2023. Sadly, this means that Mortal Kombat 1 experienced less than two years of post-launch content, so it would be more accurate to say that this was \"season two\" for Mortal Kombat 1.\n\nUltimately though, Mortal Kombat 1 ended up having the same number of DLC characters as Mortal Kombat 11 (13 for both if the pre-order bonus characters Shao Kahn and Shang Tsung both count). Of course, it can be argued that Mortal Kombat 1's six additional Kameo Fighters pushes it a little further.\n\nAt this point, it hasn't been outright confirmed that there will be no more DLC for Mortal Kombat 1, but considering NetherRealm Studios' history of doing this with previous games, it feels like a final nail in the coffin for any hopes. NetherRealm Studios may not even feel the need to make such an announcement this time due to how fans reacted to the news.\n\n\"It's not like when we finish a game, we go 'What are we going to do next?' we decided what we were going to do a long time ago.\" — Ed Boon\n\nRegardless, this news actually isn't all that surprising despite the weird timing. After all, we previously heard from alleged insiders that Kombat Pack 3 was planned at one point, but had been canceled.\n\nThis was apparently the direct result of the poor performance of the Khaos Reigns update. Had it sold better, we likely wouldn't be getting the Definitive Edition package just yet, and Ed Boon's statement \"years of content\" would've turned out to be true.\n\nThe characters that we heard about included Jade, Cassie, Kung Jin, Sonya, Kano and one last guest. We even saw an incomplete render of Kung Jin for Mortal Kombat 1, which seemingly added additional validity to these rumors.\n\nWith all of that said, we've already heard from Ed Boon himself that NetherRealm Studios has already planned out their next game for a long time now.\n\n\"It's not like when we finish a game, we go 'What are we going to do next?' we decided what we were going to do a long time ago,\" once said Boon on the matter.\n\nCould it finally be time for that Mortal Kombat remastered collection? According to Boon, it's a matter of \"when\" and not \"if\" that collection will ever happen.\n\n\"One day the stars are going to align and we're going to make that happen,\" concluded Boon about that.\n\nWe'll just have to wait and see what's next for Mortal Kombat and for NetherRealm Studios in general."
        },
        {
            "id": "27c5dd1340b13100d4d832e6bb1f983f",
            "title": "Amazon claims its ‘constantly inviting’ new customers to Alexa Plus - The Verge",
            "url": "https://www.theverge.com/news/669158/amazon-claims-its-constantly-inviting-new-customers-to-alexa-plus",
            "publishedAt": "2025-05-17T22:13:15Z",
            "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/alexa-plus.png?quality=90&strip=all&crop=0%2C3.8637918472968%2C100%2C78.583391915162&w=1200",
            "source": "The Verge",
            "description": "Amazon says “hundreds of thousands” already have access to Alexa Plus, refuting a Reuters report that questions where those users are.",
            "content": "The company says hundreds of thousands of customers already have access to its AI-powered digital assistant.\r\nThe company says hundreds of thousands of customers already have access to its AI-powered… [+2416 chars]",
            "full_content": "is a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020.\n\nYesterday, Reuters ran a story with the headline “Weeks after Amazon’s Alexa+ AI launch, a mystery: where are the users?,” in which it detailed its difficulty locating first-hand accounts of the AI-upgraded assistants’ use online. The Verge asked Amazon about the story, and the company has responded to say that the idea that Alexa Plus isn’t available is “simply wrong.”\n\nHere’s the company’s full — and rather strongly-worded! — statement on the matter, provided by Amazon spokesperson Eric Sveum via email to The Verge:\n\nIt’s simply wrong to say that Alexa+ isn’t available to customers—that assertion is false. Hundreds of thousands of customers have access to Alexa+ and we’re constantly inviting more customers that have requested Early Access.\n\nSveum also shared the below screenshot of what the email invite should look like.\n\nImage: Amazon\n\nAlexa Plus is Amazon’s generative AI-updated version of Alexa, which it announced in February is free to Amazon Prime subscribers or $19.99 a month otherwise.\n\nWhile Reuters doesn’t say Alexa Plus isn’t available to customers yet, it does quote an analyst who said, “There seems to be no one who actually has it.”\n\nThe outlet also reported that its efforts to find any real-world Alexa Plus users came up empty, writing that it had “searched dozens of news sites, YouTube, TikTok, X, BlueSky and Meta’s Instagram and Facebook, as well as Amazon’s Twitch and reviews of Echo voice-assistant devices on Amazon.com.” It added that it spoke with two people who’d posted on Reddit claiming to have used Alexa Plus, but that they “did not provide Reuters with hard evidence and their identities could not be corroborated.”\n\nStill, Engadget reported today that a wave of emails had gone out on Friday, inviting Amazon Alexa users to try out Alexa Plus. The outlet also reported that an Amazon spokesperson had told it “hundreds of thousands” of customers have tried the assistant."
        },
        {
            "id": "70cb63e040d2271218e060f4db4e3b3a",
            "title": "Gemini colors come to Nest Audio testing ‘Google Assistant’ upgrade - 9to5Google",
            "url": "http://9to5google.com/2025/05/17/nest-audio-gemini-colors/",
            "publishedAt": "2025-05-17T21:33:00Z",
            "urlToImage": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2020/10/google_nest_audio_sage_1.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
            "source": "9to5google.com",
            "description": "The Nest Audio is now using the Gemini colors, which raises some interesting branding questions. Since December...",
            "content": "Since December, Google has been testing a Gemini-powered upgrade for Assistant on some Nest speakers. The Nest Audio is now using the Gemini colors, which raises some interesting branding questions. … [+1549 chars]",
            "full_content": "Since December, Google has been testing a Gemini-powered upgrade for Assistant on some Nest speakers. The Nest Audio is now using the Gemini colors, which raises some interesting branding questions.\n\nIn the past day, Nest Audio users enrolled in the Google Home Public Preview that have “Experimental AI features” enabled have noticed Gemini’s blue and purple color scheme on the four circular lights when issuing commands and receiving responses. This is in addition to the upgraded voices.\n\nThis is appearing on Nest Audio devices running Cast firmware 3.75.468348. There are no reports from the 2nd-gen Nest Mini, which might not have the hardware and is the other speaker eligible for the preview. Google has yet to test Gemini on Nest Hubs. (It will be interesting to see if that just looks like the upcoming Google TV experience.)\n\nIt’s a straightforward change, but that raises some interesting questions about branding. Last August, Google said it would use “Gemini models” to improve Assistant. At that time, the company still referred to this upgraded experience as “Google Assistant.” It seemed that Assistant would remain the brand on Home devices, while mobile (phones, tablets, watches, headphones, cars, etc.) went all-in on Gemini.\n\nAdvertisement - scroll for more content\n\nAt CES 2025 in January, Google said “Assistant” on Android/Google TV would be upgraded with Gemini models. As of earlier this week, Google is now referring to the experience as “Gemini on Google TV.”\n\nIt looks increasingly likely that it will soon be Gemini on Nest speakers (and smart displays). While “Google Assistant” is familiar branding, it’s ultimately better for the company to unify under Gemini at this point.\n\nMore on Gemini:"
        },
        {
            "id": "688034a8d77b211cbb91e6ab6f3ccdf2",
            "title": "Nintendo explains why it chose Mario Kart World as its Switch 2 launch game - Nintendo Everything",
            "url": "https://nintendoeverything.com/nintendo-explains-why-it-chose-mario-kart-world-as-its-switch-2-launch-game/",
            "publishedAt": "2025-05-17T20:02:13Z",
            "urlToImage": "https://nintendoeverything.com/wp-content/uploads/Mario-Kart-World-Switch-2-launch.jpg",
            "source": "Nintendoeverything.com",
            "description": "When Nintendo Switch 2 launches in just a few weeks, Mario Kart World will be there right alongside it. Nintendo has now spoken about the decision to tie the two together. In a recent interview, Nintendo’s senior vice president of product development Nate Bih…",
            "content": "When Nintendo Switch 2 launches in just a few weeks, Mario Kart World will be there right alongside it. Nintendo has now spoken about the decision to tie the two together.\r\nIn a recent interview, Nin… [+2354 chars]",
            "full_content": "When Nintendo Switch 2 launches in just a few weeks, Mario Kart World will be there right alongside it. Nintendo has now spoken about the decision to tie the two together.\n\nIn a recent interview, Nintendo’s senior vice president of product development Nate Bihldorff spoke about how Mario Kart World is “one of the most broadly accessible games possible.” Also, anyone can easily get into the game, but it also has a high skill ceiling – meaning it’s very appealing to both hardcore and casual players.\n\nBihldorff shared the following in an interview with Inverse:\n\n“Mario Kart World is, in my mind anyways, one of the most broadly accessible games possible. The skill ceiling is incredibly high for people who are really into it. You saw this with Mario Kart Deluxe as well. But if you really want to play it at a high level, at the highest speed, the highest competitive level online, you’re going to spend a lot of time with this game, finding the best routes, finding the best techniques, all that. But at the same time, this is a game that, like Mario Kart Deluxe, has as many settings as you’d like to basically make it so that a kid, really any age, or a person of any skill level can also do it, so stuff like auto accelerates, stuff like smart steering, which basically guides you back onto track, which we actually have been able to have. Those are the sorts of things that you can basically turn them all on. If you have a five year old kid, give them the controller played on 50cc, they may beat you. You also have the some slight nudges to the formula of Mario Kart that, such as, when you get an item now it automatically hangs behind you instead of actually a whole button. That’s just another thing that makes it a little bit more accessible. So to my mind, not only does Mario Kart 8 clearly demonstrate that there’s a lot of appetite for racing games, broadly speaking, because it sold very well over the course the entire Switch generation, but really, it comes back to that idea that this is a game that really is going to satisfy any kind of Nintendo gamer. Even somebody who isn’t a Nintendo gamer yet might be later. For that reason, it really matches perfectly with the system.”\n\nMario Kart World will be the first entry in the series to launch alongside a new console. However, a few different titles have come close. Mario Kart 8 Deluxe, for instance, arrived just a couple of months after Nintendo Switch debuted.\n\nIn other Mario Kart World news, Nintendo recently confirmed that the game doesn’t use any AI-generated images.\n\nShare this:\n\nRelated"
        }
    ]
}