{
    "source": "data/news_entertainment_us_20250516_144354.json",
    "original_category": "entertainment",
    "original_country": "us",
    "timestamp": "2025-05-16 14:43:54",
    "articles": [
        {
            "id": "0e1f8ca02bde4d8936d9a4c601c03f71",
            "title": "‘Shōgun’ Star Cosmo Jarvis to Lead ‘Young Stalin’ Biopic From ‘Zone of Interest’ Producer Access Entertainment (EXCLUSIVE) - Variety",
            "url": "https://variety.com/2025/film/news/cosmo-jarvis-joseph-stalin-biopic-young-stalin-1236398702/",
            "urlToImage": "https://variety.com/wp-content/uploads/2025/01/GettyImages-2192201538.jpg?w=1000&h=563&crop=1",
            "source": "Variety",
            "summary": "Popular on Variety\n\nSet against the backdrop of Imperial Russia’s criminal underworld and revolutionary ferment, the film explores the making of the bloody dictator who would reshape the 20th century through terror, war and ideology — and the largest bank heist in Russian history, according to the logline. Cosmo Jarvis, star of FX’s smash hit series “Shōgun,” will star as future Soviet leader Joseph Stalin in “Young Stalin.” Georgian-French helmer Géla Babluani (“13 Tzameti,” “Money”) has signed on to direct the period thriller that is being financed by Len Blavatnik‘s Access Entertainment, which backed Jonathan Glazer’s Oscar-winning Holocaust film “The Zone of Interest” and last year’s “Conclave.”\n\nBased on the acclaimed bestseller by Simon Sebag Montefiore, “Young Stalin” charts the early days of the Soviet strongman when he was a bank-robbing gangster in pre-revolutionary Russia. Blavatnik is executive producing with Danny Cohen and Vince Holden."
        },
        {
            "id": "e7d7e6c6f7b526b3dc85c86034ad77e2",
            "title": "Horoscope for Thursday, 5/15/25 by Christopher Renstrom - SFGATE",
            "url": "https://www.sfgate.com/horoscope/article/horoscope-thursday-5-15-25-christopher-renstrom-20319965.php",
            "urlToImage": "https://s.hdnux.com/photos/47/72/12/10461851/6/rawImage.jpg",
            "source": "SFGate",
            "summary": "Star-crossed lovers?PlentyOfFish sorted through 150,000 users to find trends in matches between certain astrological signs. Aries, March 21 to Apri… [+7105 chars] Click through to find out."
        },
        {
            "id": "63e79b0ad3ba09921405288dbad205b8",
            "title": "Halle Bailey granted sole physical, legal custody of son Halo after ex DDG’s alleged abuse - Page Six",
            "url": "https://pagesix.com/2025/05/14/celebrity-news/halle-bailey-granted-sole-custody-of-son-after-ex-ddgs-alleged-abuse/",
            "urlToImage": "https://pagesix.com/wp-content/uploads/sites/3/2025/05/104504911.jpg?quality=75&strip=all&w=1024",
            "source": "Page Six",
            "summary": "8 Bailey petitioned the court for sole custody of the 16-month-old without giving notice to her ex because she “was afraid that the violence would reoccur.” Halle Bailey / Instagram\n\n8 In the legal docs, she claimed the violence first took place in January when she attempted to set up a visitation schedule with the rapper. hallebailey/Instagram\n\n8 Bailey was granted a temporary restraining order that stipulated DDG must stay 100 yards away from her and Halo. As a result, I then receive threats and hate on social media.”\n\nIn November 2024, Halle called out her ex for livestreaming with their son, writing in part on X, “i wasn’t told or notified and i am extremely upset to have my baby in front of millions of people.”\n\nHalle and DDG welcomed baby Halo in December 2023. Bailey also requested that he not be able to use his streaming platforms to weaponize his fanbase against her. She included photos of her chipped tooth and bruises on her arm in her restraining order request, which was granted by the LA courts. 8 The singer also asked that DDG stop using his streaming platforms to weaponize his fanbase against her."
        },
        {
            "id": "330dd98f4d722ebee5f611cc18edfefc",
            "title": "Cassie testifies on Kid Cudi relationship and alleged violence during Diddy trial - The Washington Post",
            "url": "https://www.washingtonpost.com/entertainment/music/2025/05/14/cassie-ventura-testimony-diddy-trial-day-3/",
            "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TBLYHE4XUGLJANHL3RT2L25XPM.jpg&w=1440",
            "source": "The Washington Post",
            "summary": "She found the woman at her car, she said, “pulled her out and … I was punching her in the head.”\n\nAdvertisement\n\nWhen asked by the government if she ever initiated a physical fight with Combs, Ventura said yes. It’s not normal.”\n\nVentura also discussed an alleged arson incident that she claimed Combs orchestrated against Mescudi. Advertisement\n\nAhead of the defense team’s plans to cross-examine Ventura on Thursday, here’s what we learned during her second day of testimony:\n\nVentura recounts alleged rape by Combs\n\nOn the stand, Ventura was asked to describe Combs’s alleged rape of her, which she said took place at her home in 2018 after they had broken up. Ventura admits to being violent\n\nCombs’s defense attorneys are expected to argue that Ventura and Combs had a mutually toxic relationship and that she was also violent toward him. Ventura said she did. Ventura said she went to rehab in 2020. Accusations of blackmail using freak-off videos\n\nVentura said she felt “trapped” on a commercial flight home to New York from the Cannes film festival — the year was unclear from testimony — as Sean Combs played freak-off videos for her on the plane and threatened to release them. Swollen everything.”\n\nFreak-offs lead Ventura to opiate abuse\n\nVentura said she had an “ongoing, off-and-on addiction to opiates,” which she used to “come down” from the drugs she had taken earlier during freak-offs. Ventura testified that Combs would procure drugs like Vicodin, oxycodone and Percocet for her, sometimes using his employees to fill prescriptions."
        },
        {
            "id": "fa23328f8db0c2e93f7244b43d573bf7",
            "title": "Halle Berry Breaks the Cannes Dress Code With Stunning High-Low Bubble Dress - instyle.com",
            "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNbEk1dWtvWmtpRjBXbTdUaHpVanBadHJVWHppcHJpRWpqMWFubVlqUkZkSHIxRTRWOTN5allmMmpvblFtb0NhNHdHTWVMUW5LSlBEdUFudzJOSS0xZkQyYnpjWXZoanQ4eG8xUFhrM1Y5ZUF5RzlDZWhGZDRxNE9aV2xGV1VjOVJ5cTNQcQ?oc=5",
            "urlToImage": null,
            "source": "Google News",
            "summary": "Content too short to summarize"
        },
        {
            "id": "0df2138a22cec67df66f0c2a7235276a",
            "title": "HBO Max is mocking itself with memes as Warner Bros. Discovery rolls out yet another rebrand - Business Insider",
            "url": "https://www.businessinsider.com/hbo-social-team-knows-rebrand-is-absurd-theyre-leaning-in-2025-5",
            "urlToImage": "https://i.insider.com/682506783fe8d3928365e205?width=1200&format=jpeg",
            "source": "Business Insider",
            "summary": "The internet is making fun of Max for changing its name to HBO Max (for the second time). Discovery distributed this meme to the media when it announced it was changing the name of its streaming service back to HBO Max. While WBD put out a relatively straight press release today about the rebrand, the company distributed a meme to go along with it, as my colleague Peter Kafka, who dove into the business implications of the rebrand, pointed out. On social media, the company went all in on silliness. Max's social team is going all out with the jokes because it probably knows that backpedaling to an earlier name is silly."
        },
        {
            "id": "1ef73edc40beae282696a1d01209a953",
            "title": "Tom Cruise’s Crazy, Death-Defying Stunts Land 5-Minute Cannes Standing Ovation at ‘Mission Impossible – The Final Reckoning’ Premiere - Variety",
            "url": "https://variety.com/2025/film/festivals/tom-cruise-cannes-mission-impossible-final-reckoning-premiere-1236388364/",
            "urlToImage": "https://variety.com/wp-content/uploads/2025/05/GettyImages-2215077477.jpg?w=1000&h=563&crop=1",
            "source": "Variety",
            "summary": "It’s the most extraordinary cast in the world.”\n\nOf Cruise, the director continued: “As a kid, I didn’t fit in and a lot of my life was imaginative play. I look forward to making a bunch of other kind of movies with you, I can’t wait.”\n\nCruise and Paramount are surely hoping “The Final Reckoning” follows in the footsteps of “Top Gun: Maverick,” which dazzled Cannes in 2022 and earned a five-minute standing ovation on its way $1.46 billion at the worldwide box office that summer. The film is directed by Christopher McQuarrie, who helmed three previous “Mission: Impossible” movies. But one can never doubt Cruise’s ability to deliver a blockbuster. Tom Cruise said goodbye to the “Mission: Impossible” franchise in electrifying fashion at the Cannes Film Festival, where “Mission: Impossible – The Final Reckoning” earned a five-minute ovation thanks in part to Cruise’s commitment to putting breathless and death-defying practical stunts on the big screen. I got to grow up and have my very own action figure.”\n\nMcQuarrie then passed the mic to Cruise. In addition to Cruise, “The Final Reckoning” brings back franchise stalwarts like Simon Pegg and Ving Rhames."
        },
        {
            "id": "7966cb4dac7afe4c4620a10c9c5f3e1e",
            "title": "Bruce Springsteen Calls Donald Trump ‘Incompetent and Treasonous’ at 2025 Tour Kick-Off - Rolling Stone",
            "url": "http://www.rollingstone.com/music/music-news/bruce-springsteen-donald-trump-incompetent-treasonous-1235339576/",
            "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2025/05/Springsteen-comment-trump.jpg?crop=0px%2C0px%2C1800px%2C1014px&resize=1600%2C900",
            "source": "Rolling Stone",
            "summary": "Now, I have hope, because I believe in the truth of what the great American writer James Baldwin said, he said, ‘In this world there isn’t as much humanity as one would like, but there’s enough.’ Let’s pray.” Related Content\n\nThis tour was initially seen as an additional leg of Springsteen and the E Street Band’s Letter to You run, which kicked off in early 2023. But it was renamed the Land of Hope and Dreams Tour earlier this month, and it is clearly tilting in a more political direction now that Trump is back in the White House. This is happening now.”\n\nHe continued: “And in my country, they are taking sadistic pleasure in the pain that they inflict on loyal American workers, they are rolling back historic civil rights legislation that led to a more just and moral society. This is ‘Land of Hope and Dreams. “In my home, the America I love, the America I’ve written about, and has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent, and treasonous administration. Hammering the point home, he followed up “Land of Hope and Dreams” with “Death to My Hometown,” a politically charged song from his 2012 LP, Wrecking Ball, about how rapacious corporate greed contributed to the Great Recession of 2007-08."
        },
        {
            "id": "ef6161eb72929b2d943e4e58a689d947",
            "title": "Blake Lively’s Lawyers Are Extorting Taylor Swift, Justin Baldoni Claims - The Hollywood Reporter",
            "url": "http://www.hollywoodreporter.com/news/general-news/blake-livelys-lawyers-extorting-taylor-swift-justin-baldoni-claims-1236217199/",
            "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2025/02/GettyImages-2003747429-e1740096649155.jpg?w=819&h=460&crop=1",
            "source": "Hollywood Reporter",
            "summary": "Because my dragons also protect those I fight for.”\n\nVenable on Monday challenged the subpoena, arguing that the singer and firm don’t have any relevant information and that Baldoni only seeks to “distract from the facts of the case.” Lively and Reynolds supported the firm’s bid to void the subpoena. We will imminently file motions with the court to hold these attorneys accountable for their misconduct here.”\n\nThe filling comes days after Swift was subpoenaed by Baldoni’s legal team, which declined to comment for this story. In the letter, Freedman says that a representative for Swift “addressed these inappropriate and apparently extortionate threats” in at least one written message to Lively’s legal team."
        },
        {
            "id": "3f09e48c95b10bdae6d495affec9d6b7",
            "title": "AP PHOTOS: A look at the second day of the Cannes Film Festival - AP News",
            "url": "https://apnews.com/article/cannes-film-festival-photos-mission-impossible-b522af22739995ed60f4ffcdeb788fae",
            "urlToImage": "https://dims.apnews.com/dims4/default/39a0fc4/2147483647/strip/true/crop/8091x4551+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F0a%2F12188b1d60d669938957f6871712%2F6b2b6c9216e74a47b36a4000f31fd6ae",
            "source": "Associated Press",
            "summary": "(Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nTom Cruise poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nJury president Molly Manning Walker poses for photographers at the photo call for the Un Certain Regard jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nDirector Mascha Schilinski poses for photographers upon arrival at the premiere of the film ‘Sound of Falling’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nAissa Maiga, from left, Mohamed Grayaa, Toure Blamassi, Foued Zaazaa, Deborah Christelle Lobe Naney, Laetitia Ky and Didar Domehri pose for photographers at the photo call for the film ‘Promised Sky’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nThis gallery features daily highlights from the festival, curated by Associated Press photo editors. ___\n\nFor more coverage of the 2025 Cannes Film Festival, visit https://apnews.com/hub/cannes-film-festival. CANNES, France (AP) — Much of the cinema world has descended on the Cannes Film Festival as the French Riviera extravaganza kicks off its 78th edition."
        }
    ]
}