{
    "source": "data/news_technology_us_20250519_143201.json",
    "original_category": "technology",
    "original_country": "us",
    "timestamp": "2025-05-19 14:32:01",
    "articles": [
        {
            "id": "9e64a6b4522ddf007020eabb2b00895d",
            "title": "Xiaomi’s In-House XRING 01 Was Made Possible Thanks To Research Efforts That Lasted 10 years, CEO Says The Chipset Was Part Of Investments Touching $14.5 Billion - Wccftech",
            "url": "https://wccftech.com/xiaomi-xring-01-development-lasted-10-years-and-cost-14-5-billion/",
            "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/05/Xiaomi-XRING-01-2.jpg",
            "source": "Wccftech",
            "summary": "More than $4 billion has been invested in 2025 alone, with the XRING 01 being one of the highlights of developing core technology that will set the company apart from the competition\n\nIt was previously reported that, to make XRING 01 a reality, around 1,000 employees were hired, with the entire division being overseen by a former Qualcomm senior director who would directly report to Lei Jun. While the aforementioned figure might not have been dedicated entirely to the XRING 01, we can assume that a decent chunk has gone into its development. As reported by ITHome, the CEO’s speech mentioned that the efforts to launch the XRING 01 took a whopping 10 years."
        },
        {
            "id": "64d6eb76a344e7ed3e50163c75d24f45",
            "title": "Google I/O 2025: How to Watch and What to Expect - CNET",
            "url": "https://www.cnet.com/tech/mobile/google-io-2025-android-how-to-watch-and-what-to-expect/",
            "urlToImage": "https://www.cnet.com/a/img/resize/2745cc26ea953a00ce37b342e4e529cdebdf9e62/hub/2025/05/09/f774bb4a-bc7c-433e-b90e-dceefcf1c2ae/promo-img.png?auto=webp&fit=crop&height=675&width=1200",
            "source": "CNET",
            "summary": "Beyond AI, Google may talk about updates to its other products including GMail, Chrome and the Play Store, although whether these updates are big enough to be discussed during the keynote rather than as part of the developer-focused sessions following I/O's opening remains to be seen. Gemini: With Android being spun out into its own separate event, Google is evidently clearing the way for I/O to focus on everything else the company does. What to expect from Google I/O 2025\n\nLittle chat about Android 16: As Google gave Android 16 its own outing already, it's likely that it won't be mentioned all that much during I/O. AI will continue to dominate the conversation at I/O, just as it did last year (though hopefully Google can make it more understandable) with updates to many of its AI platforms expected to be announced."
        },
        {
            "id": "b1974d5b0bed2ef7e9a69263141a184d",
            "title": "Fate/hollow ataraxia REMASTERED launches in 2025 - Gematsu",
            "url": "https://www.gematsu.com/2025/05/fate-hollow-ataraxia-remastered-launches-in-2025",
            "urlToImage": "https://www.gematsu.com/wp-content/uploads/2025/05/Fate-hollow-ataraxia-REMASTERED-Ann_05-17-25.jpg",
            "source": "Gematsu",
            "summary": "The remastered version of the visual novel Fate/hollow ataraxia was first announced in August 2024, but a release window was not announced at the time. If you missed it last year, watch the announcement teaser trailer here."
        },
        {
            "id": "442effeffed7eafce72f45d0c8a857f0",
            "title": "A manuscript over 2,000 years old and buried under the ashes of Mount Vesuvius has been analyzed thanks to a new technique. - Stewartville Star",
            "url": "https://thinkstewartville.com/2025/05/17/a-manuscript-over-2000-years-old-and-buried-under-the-ashes-of-mount-vesuvius-has-been-analyzed-thanks-to-a-new-technique/",
            "urlToImage": "https://thinkstewartville.com/wp-content/uploads/2025/05/thinkstewartville.com-auto-draft-6480846130354-2025-05-15t091854.569.jpg",
            "source": "Thinkstewartville.com",
            "summary": "As researchers refine their methods and expand their toolkit, countless other historical mysteries may yield their secrets, transforming our understanding of human intellectual history one ancient manuscript at a time. The ability to finally access these texts provides an unprecedented window into ancient intellectual life. Future prospects for vesuvian manuscripts\n\nThe successful decoding of this manuscript opens possibilities for analyzing hundreds more scrolls recovered from Herculaneum. With technology advancing rapidly, scholars anticipate accelerated progress in revealing these long-hidden texts. Each newly deciphered scroll could potentially transform our understanding of classical literature, philosophy, and history. Nearly two millennia later, researchers have made a remarkable breakthrough in analyzing one of history’s most elusive treasures: ancient manuscripts buried under Vesuvius’s destructive force. “Everything we get from the Herculaneum library is new to us,” noted Dr. McOsker, highlighting the scholarly significance of these manuscripts. This Roman city, also devastated by pyroclastic flows in 79 AD, has yielded numerous manuscript scrolls that promise to expand our understanding of classical literature and philosophy. Until recently, scholars could only speculate about the contents of these carbonized scrolls, making each successful reading a momentous occasion. Similar approaches could potentially help researchers examine other damaged or fragile historical documents worldwide."
        },
        {
            "id": "38e1cbaf414de7be564df87ab80fe30f",
            "title": "Here's A Look At The Size And Inside Of Switch 2 Game Cases - Nintendo Life",
            "url": "https://www.nintendolife.com/news/2025/05/heres-a-look-at-the-size-and-inside-of-switch-2-game-cases",
            "urlToImage": "https://images.nintendolife.com/b340d43b4d606/large.jpg",
            "source": "Nintendo Life",
            "summary": "Nintendo is slightly mixing up its box art game for the Switch 2 generation with red cases and artwork that now wraps around the spine of the case. Compared to the transparent Switch case, the Switch 2 case is now red on the inside. pic.twitter.com/OA8ajFqmuW May 17, 2025\n\nAs you can see, the game manual holder returns in Switch 2 game cases and the game card holder is once again located at the bottom of the case."
        },
        {
            "id": "ee88eef367dc3228b70e5018db023e83",
            "title": "The seventh Google Store opens on May 30 - 9to5Google",
            "url": "http://9to5google.com/2025/05/17/google-store-domain-northside-austin/",
            "urlToImage": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2022/08/google-store-logo-2.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
            "source": "9to5google.com",
            "summary": "Meanwhile, those in the area can order online and pick-up in the store, while Google offers troubleshooting, Pixel phone repair, classes, and other activities. This is Google’s second store opening this year after Santa Monica, with this upcoming launch matching the two-store pace of 2024. News about this location emerged in January, with Texas becoming the Google Store’s fifth state."
        },
        {
            "id": "95ac8dfc0252048acd01ba5b9a7dda09",
            "title": "Ed Boon said that there could be 'years of content' for Mortal Kombat 1 but it sadly didn't even make it two years - EventHubs",
            "url": "https://www.eventhubs.com/news/2025/may/17/ed-boon-mk1-content-conclusion/",
            "urlToImage": "https://media.eventhubs.com/images/2025/05/17_mk1-ending-bnrt.webp",
            "source": "EventHubs",
            "summary": "\"So we were pretty sure when we launched Mortal Kombat 1 that we were going to be doing years of content, and this is year two.\" We'll just have to wait and see what's next for Mortal Kombat and for NetherRealm Studios in general. At this point, it hasn't been outright confirmed that there will be no more DLC for Mortal Kombat 1, but considering NetherRealm Studios' history of doing this with previous games, it feels like a final nail in the coffin for any hopes. Could it finally be time for that Mortal Kombat remastered collection? Shortly after the reveal of Mortal Kombat 1: Khaos Reigns, Ed Boon mentioned more plans for the game's future. However, it's important to note that Mortal Kombat 1 was originally released on September 14, 2023. We even saw an incomplete render of Kung Jin for Mortal Kombat 1, which seemingly added additional validity to these rumors. With all of that said, we've already heard from Ed Boon himself that NetherRealm Studios has already planned out their next game for a long time now."
        },
        {
            "id": "27c5dd1340b13100d4d832e6bb1f983f",
            "title": "Amazon claims its ‘constantly inviting’ new customers to Alexa Plus - The Verge",
            "url": "https://www.theverge.com/news/669158/amazon-claims-its-constantly-inviting-new-customers-to-alexa-plus",
            "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/alexa-plus.png?quality=90&strip=all&crop=0%2C3.8637918472968%2C100%2C78.583391915162&w=1200",
            "source": "The Verge",
            "summary": "While Reuters doesn’t say Alexa Plus isn’t available to customers yet, it does quote an analyst who said, “There seems to be no one who actually has it.”\n\nThe outlet also reported that its efforts to find any real-world Alexa Plus users came up empty, writing that it had “searched dozens of news sites, YouTube, TikTok, X, BlueSky and Meta’s Instagram and Facebook, as well as Amazon’s Twitch and reviews of Echo voice-assistant devices on Amazon.com.” It added that it spoke with two people who’d posted on Reddit claiming to have used Alexa Plus, but that they “did not provide Reuters with hard evidence and their identities could not be corroborated.”\n\nStill, Engadget reported today that a wave of emails had gone out on Friday, inviting Amazon Alexa users to try out Alexa Plus. Hundreds of thousands of customers have access to Alexa+ and we’re constantly inviting more customers that have requested Early Access. Yesterday, Reuters ran a story with the headline “Weeks after Amazon’s Alexa+ AI launch, a mystery: where are the users?,” in which it detailed its difficulty locating first-hand accounts of the AI-upgraded assistants’ use online."
        },
        {
            "id": "70cb63e040d2271218e060f4db4e3b3a",
            "title": "Gemini colors come to Nest Audio testing ‘Google Assistant’ upgrade - 9to5Google",
            "url": "http://9to5google.com/2025/05/17/nest-audio-gemini-colors/",
            "urlToImage": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2020/10/google_nest_audio_sage_1.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
            "source": "9to5google.com",
            "summary": "As of earlier this week, Google is now referring to the experience as “Gemini on Google TV.”\n\nIt looks increasingly likely that it will soon be Gemini on Nest speakers (and smart displays). While “Google Assistant” is familiar branding, it’s ultimately better for the company to unify under Gemini at this point. Advertisement - scroll for more content\n\nAt CES 2025 in January, Google said “Assistant” on Android/Google TV would be upgraded with Gemini models."
        },
        {
            "id": "688034a8d77b211cbb91e6ab6f3ccdf2",
            "title": "Nintendo explains why it chose Mario Kart World as its Switch 2 launch game - Nintendo Everything",
            "url": "https://nintendoeverything.com/nintendo-explains-why-it-chose-mario-kart-world-as-its-switch-2-launch-game/",
            "urlToImage": "https://nintendoeverything.com/wp-content/uploads/Mario-Kart-World-Switch-2-launch.jpg",
            "source": "Nintendoeverything.com",
            "summary": "For that reason, it really matches perfectly with the system.”\n\nMario Kart World will be the first entry in the series to launch alongside a new console. In a recent interview, Nintendo’s senior vice president of product development Nate Bihldorff spoke about how Mario Kart World is “one of the most broadly accessible games possible.” Also, anyone can easily get into the game, but it also has a high skill ceiling – meaning it’s very appealing to both hardcore and casual players. So to my mind, not only does Mario Kart 8 clearly demonstrate that there’s a lot of appetite for racing games, broadly speaking, because it sold very well over the course the entire Switch generation, but really, it comes back to that idea that this is a game that really is going to satisfy any kind of Nintendo gamer."
        }
    ]
}