{
    "source": "data/news_entertainment_us_20250516_143209.json",
    "original_category": "entertainment",
    "original_country": "us",
    "timestamp": "2025-05-16 14:32:09",
    "articles": [
        {
            "id": "330dd98f4d722ebee5f611cc18edfefc",
            "title": "Cassie testifies on Kid Cudi relationship and alleged violence during Diddy trial - The Washington Post",
            "url": "https://www.washingtonpost.com/entertainment/music/2025/05/14/cassie-ventura-testimony-diddy-trial-day-3/",
            "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TBLYHE4XUGLJANHL3RT2L25XPM.jpg&w=1440",
            "source": "The Washington Post",
            "summary": "She found the woman at her car, she said, “pulled her out and … I was punching her in the head.”\n\nAdvertisement\n\nWhen asked by the government if she ever initiated a physical fight with Combs, Ventura said yes. It’s not normal.”\n\nVentura also discussed an alleged arson incident that she claimed Combs orchestrated against Mescudi. Advertisement\n\nAhead of the defense team’s plans to cross-examine Ventura on Thursday, here’s what we learned during her second day of testimony:\n\nVentura recounts alleged rape by Combs\n\nOn the stand, Ventura was asked to describe Combs’s alleged rape of her, which she said took place at her home in 2018 after they had broken up. Ventura admits to being violent\n\nCombs’s defense attorneys are expected to argue that Ventura and Combs had a mutually toxic relationship and that she was also violent toward him. Ventura said she did. Ventura said she went to rehab in 2020. Accusations of blackmail using freak-off videos\n\nVentura said she felt “trapped” on a commercial flight home to New York from the Cannes film festival — the year was unclear from testimony — as Sean Combs played freak-off videos for her on the plane and threatened to release them. Swollen everything.”\n\nFreak-offs lead Ventura to opiate abuse\n\nVentura said she had an “ongoing, off-and-on addiction to opiates,” which she used to “come down” from the drugs she had taken earlier during freak-offs. Ventura testified that Combs would procure drugs like Vicodin, oxycodone and Percocet for her, sometimes using his employees to fill prescriptions."
        },
        {
            "id": "3811027f35b500157760057b0153afa5",
            "title": "Diddy Sued for Alleged Rape by Woman Who Says His Penis Was Tootsie Roll-Sized - TMZ",
            "url": "https://www.tmz.com/2025/05/14/diddy-sued-alleged-rape-woman-penis-tootsie-roll-size/",
            "urlToImage": "https://imagez.tmz.com/image/04/16by9/2025/05/14/04f8bdbca760441da84b7358f578ccad_xl.jpg",
            "source": "TMZ",
            "summary": "The woman claims she screamed for Diddy to get off of her and stop and told him she didn't want to have sex ... but she says he overpowered her and did not stop penetrating her until he was close to climaxing. She claims Diddy called her a few times after the alleged rape and even invited her to one of his white parties ... but she says she did not respond to his calls. She claims after a night out at the club, Diddy took her back to his apartment ... leading her to his bedroom, where he locked the door and pushed her down onto the bed on her back, placing his hand around her throat and telling her, \"I'm going to suck the life out of you.\""
        },
        {
            "id": "0df2138a22cec67df66f0c2a7235276a",
            "title": "HBO Max is mocking itself with memes as Warner Bros. Discovery rolls out yet another rebrand - Business Insider",
            "url": "https://www.businessinsider.com/hbo-social-team-knows-rebrand-is-absurd-theyre-leaning-in-2025-5",
            "urlToImage": "https://i.insider.com/682506783fe8d3928365e205?width=1200&format=jpeg",
            "source": "Business Insider",
            "summary": "The internet is making fun of Max for changing its name to HBO Max (for the second time). Discovery distributed this meme to the media when it announced it was changing the name of its streaming service back to HBO Max. While WBD put out a relatively straight press release today about the rebrand, the company distributed a meme to go along with it, as my colleague Peter Kafka, who dove into the business implications of the rebrand, pointed out. On social media, the company went all in on silliness. Max's social team is going all out with the jokes because it probably knows that backpedaling to an earlier name is silly."
        },
        {
            "id": "1ef73edc40beae282696a1d01209a953",
            "title": "Tom Cruise’s Crazy, Death-Defying Stunts Land 5-Minute Cannes Standing Ovation at ‘Mission Impossible – The Final Reckoning’ Premiere - Variety",
            "url": "https://variety.com/2025/film/festivals/tom-cruise-cannes-mission-impossible-final-reckoning-premiere-1236388364/",
            "urlToImage": "https://variety.com/wp-content/uploads/2025/05/GettyImages-2215077477.jpg?w=1000&h=563&crop=1",
            "source": "Variety",
            "summary": "It’s the most extraordinary cast in the world.”\n\nOf Cruise, the director continued: “As a kid, I didn’t fit in and a lot of my life was imaginative play. I look forward to making a bunch of other kind of movies with you, I can’t wait.”\n\nCruise and Paramount are surely hoping “The Final Reckoning” follows in the footsteps of “Top Gun: Maverick,” which dazzled Cannes in 2022 and earned a five-minute standing ovation on its way $1.46 billion at the worldwide box office that summer. The film is directed by Christopher McQuarrie, who helmed three previous “Mission: Impossible” movies. But one can never doubt Cruise’s ability to deliver a blockbuster. Tom Cruise said goodbye to the “Mission: Impossible” franchise in electrifying fashion at the Cannes Film Festival, where “Mission: Impossible – The Final Reckoning” earned a five-minute ovation thanks in part to Cruise’s commitment to putting breathless and death-defying practical stunts on the big screen. I got to grow up and have my very own action figure.”\n\nMcQuarrie then passed the mic to Cruise. In addition to Cruise, “The Final Reckoning” brings back franchise stalwarts like Simon Pegg and Ving Rhames."
        },
        {
            "id": "280494d549c0dd7b9dc1b279e2a18029",
            "title": "‘The Hunger Games: Sunrise On The Reaping’ Casts Lili Taylor As Mags - Deadline",
            "url": "http://deadline.com/2025/05/hunger-games-sunrise-on-the-reaping-adds-lili-taylor-mags-1236397432/",
            "urlToImage": "https://deadline.com/wp-content/uploads/2025/05/GettyImages-468238760.jpg?w=1024",
            "source": "Deadline",
            "summary": "She is represented by Independent Artist Group and Untitled Entertainment. Meredith Wieck and Scott O’Brien are overseeing the project for the studio, for whom Robert Melnik negotiated deals. EXCLUSIVE: The Hunger Games: Sunrise on the Reaping has another new cast member in Emmy nominee Lili Taylor (Outer Range), who will play Mags, former Hunger Games champion-turned-District 12 mentor."
        },
        {
            "id": "3f09e48c95b10bdae6d495affec9d6b7",
            "title": "AP PHOTOS: A look at the second day of the Cannes Film Festival - AP News",
            "url": "https://apnews.com/article/cannes-film-festival-photos-mission-impossible-b522af22739995ed60f4ffcdeb788fae",
            "urlToImage": "https://dims.apnews.com/dims4/default/39a0fc4/2147483647/strip/true/crop/8091x4551+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F0a%2F12188b1d60d669938957f6871712%2F6b2b6c9216e74a47b36a4000f31fd6ae",
            "source": "Associated Press",
            "summary": "(Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nTom Cruise poses for photographers upon arrival at the premiere of the film ‘Mission: Impossible - The Final Reckoning’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nJury president Molly Manning Walker poses for photographers at the photo call for the Un Certain Regard jury at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nDirector Mascha Schilinski poses for photographers upon arrival at the premiere of the film ‘Sound of Falling’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Lewis Joly/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nAissa Maiga, from left, Mohamed Grayaa, Toure Blamassi, Foued Zaazaa, Deborah Christelle Lobe Naney, Laetitia Ky and Didar Domehri pose for photographers at the photo call for the film ‘Promised Sky’ at the 78th international film festival, Cannes, southern France, Wednesday, May 14, 2025. (Photo by Scott A Garfitt/Invision/AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nThis gallery features daily highlights from the festival, curated by Associated Press photo editors. ___\n\nFor more coverage of the 2025 Cannes Film Festival, visit https://apnews.com/hub/cannes-film-festival. CANNES, France (AP) — Much of the cinema world has descended on the Cannes Film Festival as the French Riviera extravaganza kicks off its 78th edition."
        },
        {
            "id": "9c2ae7d77c58091de2ce98d4e8c65492",
            "title": "'It represents a seismic change': What Gérard Depardieu's conviction means for France - BBC",
            "url": "https://www.bbc.com/culture/article/20250514-what-gerard-depardieus-conviction-means-for-france",
            "urlToImage": "https://ychef.files.bbci.co.uk/624x351/p0lb6t25.jpg",
            "source": "BBC News",
            "summary": "\"For people over the age of perhaps 50 and 60, Depardieu evokes memories of being a great actor of a certain era, but I don't know how many younger people are interested in that story anymore,\" she says. \"And I think the fall of Depardieu really does represent this seismic change in France, that's perhaps come later than in Hollywood and the rest of the world, but it is here now. She says there was condemnation when Depardieu's lawyer Jérémie Assous accused the actor's two female victims in the court case, a 54-year-old set dresser and a 34-year-old assistant director, of \"hysteria\", being \"liars\" and working for the cause of \"rabid feminism\". The world's most famous film festival, in Cannes, began on the same day that Gérard Depardieu, one of the biggest film stars France has ever produced, was found guilty of sexually assaulting two women on the film set of a 2021 film, The Green Shutters, who described him groping them while using obscene language. \"He is no longer sacred,\" she told journalists, a reference to the scale of Depardieu's power in the French film industry. Eve Jackson, the Culture Editor at French news channel France 24, tells the BBC that Depardieu \"has been revered as one of the sons of the Cannes Film Festival. Change has perhaps come later than in Hollywood and the rest of the world, but it is here now – Eve Jackson\n\nUnsurprisingly, Cannes Jury President, Juliette Binoche, who has also starred opposite Depardieu, was asked for her thoughts on the importance of his conviction at yesterday's opening press conference. Last year's festival, anticipating Depardieu's forthcoming trial, was full of activity from France's own #MeToo movement, with French female film-makers using international cinema's most public platform to show films dealing with the subject of sexual abuse. A few days before Depardieu's conviction, the 90-year-old Bardot publicly called the actor a \"genius\" on French TV, and deplored that \"talented people who touch the bottom of a girl are consigned to the deepest dungeon\". Getty Images Adèle Haenel is one of the younger stars who has been vocal about sexual assault (Credit: Getty Images)\n\nBut Jackson points to a reaction to an event during the Depardieu trial, which she says is significant of a societal shift."
        },
        {
            "id": "b940ef7e7424df4bd5916e493c8136ff",
            "title": "Tony Gilroy on Giving ‘Andor’ a ‘Hopeful’ End, Bringing Back K-2SO, and Episode 10’s Revealing Backstory - IndieWire",
            "url": "https://www.indiewire.com/features/interviews/andor-season-2-finale-explained-1235118725/",
            "urlToImage": "https://www.indiewire.com/wp-content/uploads/2025/05/PGM2-FF-004051.jpg?w=650",
            "source": "IndieWire",
            "summary": "And suddenly we have this young actress [who we don’t really know,” said Gilroy. I see that in some of the other characters, and I think that’s the one I don’t want.”\n\nElizabeth Dulau as Kleya in ‘Andor’ Season 2 ©Disney+/Courtesy Everett Collection\n\nThe ultimate Episode 210 storyline, and the incorporation of Kleya, as an almost adopted daughter, into Luthen’s backstory, was motivated and inspired by the talents of Dulau. I mean, she’s just astonishing.”\n\nTo hear Tony Gilroy’s full interview, subscribe to the Filmmaker Toolkit podcast on Apple, Spotify, or your favorite podcast platform. Gilroy and Skarsgård had both been impressed by the previously unknown actress’s talents, and wanted to give her and the character the opportunity to spread their wings before saying goodbye. But really, in the end, this is the beginning of ‘A New Hope.’ What’s going to come out of this is the phoenix of the Rebellion.”\n\nDiego Luna and Alan Tudyk (as K-2SO) in ‘Rogue One’ ©Walt Disney Co./courtesy Everett / Everett Collection\n\nThe last three-episode cycle “Andor” also saw K-2SO (voiced by Alan Tudyk) back into the fold, returning to the prominent supporting role that the modified KX-series security droid plays in “Rogue One.” It’s a move Gilroy purposefully delayed and left to the series end."
        },
        {
            "id": "ec7ae0a47bde808dddf77902a48dcccf",
            "title": "With tears and defiance, Kim Kardashian faces the men accused of robbing her in Paris - NPR",
            "url": "https://www.npr.org/2025/05/14/g-s1-66536/kim-kardashian-jewelry-robbery-testimony-paris-trial",
            "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe8%2F0b%2Fc36b7afd4ad6967302466a172284%2Fap25133539485223.jpg",
            "source": "NPR",
            "summary": "Kardashian said she was grateful for the opportunity to \"tell my truth\" in the packed Paris courtroom. \"This is my closure,\" she said. It \"always felt really safe,\" she said. It was so many memories,\" she said. The robbery reshaped Kardashian's sense of safety and freedom. \"I forgive you for what had taken place. Her Los Angeles home was robbed shortly after the Paris heist in what she believes was a copycat attack. \"I've always believed in second chances,\" she said. \"I was certain that was the moment that he was going to rape me,\" Kardashian said. She grabbed her phone but froze — \"I didn't know what 911 was (in France).\" They threw her on the bed, bound her hands and held a gun to her back. He taped her mouth shut, and took her to the bathroom. \"This experience really changed everything for us,\" she said."
        }
    ]
}