{
    "source": "data/news_science_us_20250519_143122.json",
    "original_category": "science",
    "original_country": "us",
    "timestamp": "2025-05-19 14:31:22",
    "articles": [
        {
            "id": "d6b69f10b827ba41404206ab8482b95d",
            "title": "Stone tools created 400,000 years show technological advancement of early humans - Earth.com",
            "url": "https://www.earth.com/news/stone-tools-flint-created-400000-years-show-technological-advancement-of-early-humans/",
            "urlToImage": "https://cff2.earth.com/uploads/2025/05/17162023/stone-tools_400000-years-old_Quina-like_tech-advance_1.jpg",
            "source": "Earth.com",
            "summary": "Credit: Tel Aviv University\n\n“Identifying the deer’s plentiful source, they began to develop the unique scrapers in the same place,” Litov explains. Prof. Barkai explains that the study reveals “links between technological developments and changes in the fauna hunted and consumed by early humans.”\n\nWhile previous theories credited advancements in stone tools to biological evolution, he and his team suggest a “double connection, both practical and perceptual.”\n\nPractically, tool sophistication evolved to meet the demands of hunting smaller, faster prey. Prehistoric hunters seemed to favor flint from the same region where the deer roamed – Mounts Ebal and Gerizim – suggesting a deep-rooted awareness of the landscape and its significance. “We found a connection between the plentiful source of fallow deer and the source of flint used to butcher them,” he notes. “In this study we tried to understand why stone tools changed during prehistoric times, with a focus on a technological change in scrapers in the Lower Paleolithic, about 400,000 years ago,” Litov explained. Tools made from a variety of local stones have been found at Jaljulia, but something unique occurred when they began sourcing both their prey and tool-making materials from the Samarian highlands. “Consequently, we see the emergence of the new Quina scrapers, with a better-shaped, sharper, more uniform working edge compared to the simple scrapers used previously,” Litov added. Archaeological evidence, including fallow deer bones from Mount Gerizim and other sites, suggests that the area supported deer populations well into the Holocene. A humble flint scraper, carried miles across rugged ground, reminds us that tools are never just tools. “Apparently, the Mountains of Samaria gained a prominent or even sacred status as early as the Paleolithic period,” Litov concludes, “and retained their unique cultural position for hundreds of thousands of years.”\n\nPrehistoric man was smarter than we thought\n\nPairing a resource with a place crops up again and again in human history, from obsidian quarries in the American Southwest to jade rivers in ancient China. These specialized tools – first appearing in Jaljulia around 500,000 years ago – later spread more broadly, showing up at Qesem Cave between 400,000 and 200,000 years ago. Hunters, then, were linking an essential resource – flint – to the very landscape that provided their new staple food."
        },
        {
            "id": "5c67c8a4078f408e7a96217232ea1d7d",
            "title": "Solar Superstorm Unleashes Rare Metal Clouds in Earth’s Upper Atmosphere - SciTechDaily",
            "url": "https://scitechdaily.com/?p=474777",
            "urlToImage": "https://scitechdaily.com/images/May-2024-Solar-Storm-scaled.jpg",
            "source": "SciTechDaily",
            "summary": "“We also plan to re-examine the data from other solar storms to see if we can better understand these phenomena.”\n\nReference: “Sporadic-E Layer Responses to Super Geomagnetic Storm 10–12 May 2024” by Lihui Qiu and Huixin Liu, 23 April 2025, Geophysical Research Letters. This combination gave them one of the most detailed global maps ever created of sporadic E activity during and after a major solar storm. This propagation characteristic from high to low latitudes suggests that sporadic E layers are most likely caused by the disturbed neutral winds in the E region.”\n\nUnderstanding the activity of the E layer is vital due to its potential to disrupt radio communications in the HF and VHF bands. During a powerful solar storm on Mother’s Day, scientists discovered that a mysterious ionospheric phenomenon, sporadic E layers, became unusually active, especially during the storm’s recovery. The research team hopes that their new findings will lead to better insights on Es layer activity and how such unique phenomena are created in the ionosphere."
        },
        {
            "id": "8861f1619a2a6f4d33222e019730aab0",
            "title": "The Next Earthquake Is Long Overdue: New Research Reveals Wasatch Fault More Dangerous Than Previously Believed - SciTechDaily",
            "url": "https://scitechdaily.com/the-next-earthquake-is-long-overdue-new-research-reveals-wasatch-fault-more-dangerous-than-previously-believed/",
            "urlToImage": "https://scitechdaily.com/images/Earthquake-Forecasting-Technology-Concept.jpg",
            "source": "SciTechDaily",
            "summary": "“This means that an earthquake rupture could lead to stronger, more intense shaking at the surface — meaning a greater chance of injury and destruction.”\n\nFurther, the scientists discovered earthquake slip is possible along the shallowly dipping portion of the Wasatch Fault because the fault rocks themselves are much weaker—worn down and slicker — than the surrounding, undamaged rock. “Although the Wasatch Fault dips sharply at Salt Lake City, it curves more gently at depth as it moves west and is probably oriented at a much shallower angle at earthquake depth than expected,” Shreedharan says. “This process is happening continuously, though at a very slow pace, under our feet.”\n\nReference: “Frictional and microstructural evidence for a weak Wasatch fault zone” by Srisharan Shreedharan, Alexis K. Ault and Jordan Jensen, 25 April 2025, Geology. DOI: 10.1130/G52606.1\n\nThe research is supported by the U.S. Geological Survey’s Earthquake Hazards Program."
        },
        {
            "id": "6385b994e647bcf67ac797d06823a3bf",
            "title": "What if everything, from animals to plants to atoms, has consciousness? This theory is gaining momentum - Earth.com",
            "url": "https://www.earth.com/news/what-if-everything-humans-animals-plants-atoms-has-consciousness-panpsychism/",
            "urlToImage": "https://cff2.earth.com/uploads/2024/06/17150059/panpsychism_consciousness_all-things_1.jpg",
            "source": "Earth.com",
            "summary": "Panpsychism alarms some thinkers who worry that ascribing feeling to atoms cheapens the concept of consciousness. Wherever the search leads, it forces us to face an unsettling possibility: consciousness might be less a rare jewel than a basic note in the cosmic score. If experience is not tacked onto matter but rides with it from the start, the gap between mind and world may shrink. Quantum puzzles and panpsychism\n\nA more controversial route links mind to quantum mechanics. Yet the framework has already inspired machine-consciousness tests, raising practical as well as philosophical stakes. Interest in the idea has surged again as researchers wrestle with the “hard problem of consciousness,” the stubborn mystery of how physical stuff gives rise to subjective feeling. So far, definitive evidence for Orch-OR is missing, but the debate keeps the link between physics and consciousness on the table. If IIT holds up, panpsychism gains a scientific foothold, because the theory does not limit consciousness to biology. Neuroscientists are refining Φ-based metrics, while physicists hunt quantum signatures in biology. Science meets philosophy today\n\nModern neuroscience attacks the mystery head-on."
        },
        {
            "id": "61020c4be104391e7caa10b1b8d58d8a",
            "title": "Paleontologists discover a 500-million-year-old, 3-eyed predator - NPR",
            "url": "https://www.npr.org/2025/05/17/g-s1-67434/sea-creature-fossil-three-eyed-predator-mosura",
            "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2809x1580+2+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F92%2Fb5%2F5b34d65b4640be2a93b4245b9d97%2Fmosura-life-sm-png.jpg",
            "source": "NPR",
            "summary": "\"The recent discovery of Mosura shows that a group of arthropods — one long-held to be rather pedestrian in its evolutionary history compared to its close relatives — was in on the 'explosion,' too.\" \"One of the really interesting things about this discovery is that multi-segmented abdomen-like region of the body of this new species, and it's something that we haven't seen in any of its close relatives before,\" Moysiuk said. The discovery of the Mosura — part of the extinct group, radiodonts — revealed that the creature was much more complex than fossils of other radiodonts previously suggested, according to researchers."
        },
        {
            "id": "a3fe8fbe2aba8ffee075f58aad2610b3",
            "title": "The oldest known rebbachisaur has been found, dating back 94 million years - Earth.com",
            "url": "https://www.earth.com/news/the-oldest-known-rebbachisaur-has-been-found-dating-back-94-million-years/",
            "urlToImage": "https://cff2.earth.com/uploads/2025/05/13035011/oldest-known-rebbachisaur-94-million-years.jpg",
            "source": "Earth.com",
            "summary": "The final note\n\nThe importance of this 94-million-year-old sauropod lies in its status as a missing piece that enriches our knowledge of an entire family of dinosaurs. This dinosaur’s existence adds depth to our understanding of the Late Cretaceous. These global partnerships are crucial in paleontology, where a single bone can trigger fresh perspectives on evolution. Hope for more answers\n\nFossils like these keep researchers on their toes. Changes in climate, vegetation, and terrain likely steered dinosaur evolution in complex ways that are only now being pieced together. Significance for the community\n\nScientists collaborate across countries and institutions to analyze and verify these fossils. Why the rebbachisaurid find matters\n\nPaleontologists are often eager to fill gaps in dinosaur family trees, and an early rebbachisaurid is especially important. Clues about changing worlds\n\nExperts think the shift from earlier diplodocoid forms to other sauropod families signals environmental pressures that shaped survival strategies. The study is published in Cretaceous Research. The findings help paint a broader picture of sauropod evolution in South America. Each detail – whether from bones or footprints – challenges our assumptions about how these animals looked and behaved."
        },
        {
            "id": "2e8987291f153f7a7536f868803c57ad",
            "title": "CERN scientists may have turned lead into gold in breakthrough experiment - Glass Almanac",
            "url": "https://glassalmanac.com/cern-scientists-may-have-turned-lead-into-gold-in-breakthrough-experiment/",
            "urlToImage": "https://glassalmanac.com/wp-content/uploads/2025/05/CERN-scientists-may-have-turned-lead-into-gold-in-breakthrough-experiment.jpg",
            "source": "Glassalmanac.com",
            "summary": "This concept is deeply rooted in nuclear physics, and while it’s been explored before, this marks the first time the transformation from lead to gold has been detailed with such precision. It’s not about making gold—it’s about mastering the forces that shape matter itself. And while we may not be turning base metals into fortune anytime soon, we are getting closer to unraveling the fundamental building blocks of everything around us. The energy required to strip protons from atomic nuclei is astronomically high, and the cost of running particle accelerators like CERN’s is far greater than the value of the gold produced. As we continue to explore the frontiers of particle physics, this experiment reminds us that the line between legend and reality is sometimes thinner than we think."
        },
        {
            "id": "9f1c963a307f25be7785e7ff43bb4b31",
            "title": "NASA’s Spacecraft Reveals Strange “Double Moon” Near the Sun - The Daily Galaxy",
            "url": "https://dailygalaxy.com/2025/05/nasa-spacecraft-double-moon-near-the-sun/",
            "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/NASAs-Spacecraft-Reveals-Strange-Double-Moon-Near-the-Sun.jpg",
            "source": "The Daily Galaxy --Great Discoveries Channel",
            "summary": "By imaging the sun’s outer atmosphere and the space between Earth and the sun, PUNCH helps scientists better understand how solar activity shapes our space environment. While PSP collects direct measurements inside the solar corona, PUNCH uses imaging techniques to observe how the corona extends and interacts with space near Earth. Together, these missions provide a fuller understanding of solar dynamics from the sun’s surface to the far reaches of the heliosphere."
        },
        {
            "id": "4acb8c2c464de5aaea9c8e3b42441627",
            "title": "Scientists Expose the Shocking Rupture of North America’s Hidden Billion-Year-Old Rift - The Daily Galaxy",
            "url": "https://dailygalaxy.com/2025/05/rupture-north-americas-billion-year-rift/",
            "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Expose-the-Shocking-Rupture-of-North-Americas-Hidden-Billion-Year-Old-Rift.jpg",
            "source": "The Daily Galaxy --Great Discoveries Channel",
            "summary": "The volcanic rocks and sedimentary deposits formed during and after the rifting phase created unique structures that influenced the region’s topography and mineral wealth. Lasting Geological and Economic Impacts\n\nThough the Midcontinent Rift did not succeed in splitting the continent, its legacy endures in both geological formations and natural resources. G. Randy Keller, a geophysics professor emeritus and director of the Oklahoma Geological Survey, described this phenomenon as “a spectacular failure.” He explained in the Nature article, “How that feature could just totally reorganize the crust of the Earth in the Lake Superior region and not manage to break the continent apart is fairly amazing.” This striking paradox highlights the complex interplay of forces shaping Earth’s crust over deep time. The exact reasons why the rift failed to progress to a full continental breakup remain a subject of scientific debate."
        },
        {
            "id": "258129860ed4d5d82d2b4b37b4c859f2",
            "title": "Perseverance Captures Unprecedented Passage of Deimos Across Mars’ Sky - The Daily Galaxy",
            "url": "https://dailygalaxy.com/2025/05/perseverance-passage-deimos-mars-sky/",
            "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Perseverance-Captures-Unprecedented-Passage-of-Deimos-Across-Mars-Sky.jpg",
            "source": "The Daily Galaxy --Great Discoveries Channel",
            "summary": "Perseverance’s Broader Contributions to Mars Exploration\n\nWhile the image of Deimos soaring over the Martian landscape is spectacular, it is only one facet of Perseverance’s ongoing mission. The Role of Deimos and Mars Moons in Planetary Science\n\nDeimos, the smaller and more distant of Mars’ two moons, is an intriguing object due to its irregular shape, tidal locking, and mysterious origin. Deimos against the planet Mars (Credit : NASA)\n\nESA’s Hera Mission: A Complementary Perspective on Deimos\n\nJust days after Perseverance’s Deimos observation, the European Space Agency’s Hera mission conducted a high-speed flyby of Mars on March 12, 2025. This achievement demonstrates the rover’s advanced imaging capabilities and the innovative methods scientists use to study Mars and its moons from the surface. This complements observations from orbiters and flyby missions, enriching our knowledge of how Martian moons interact with the planet and the space environment around them."
        }
    ]
}