{
    "source": "data/news_entertainment_us_20250519_143040.json",
    "original_category": "entertainment",
    "original_country": "us",
    "timestamp": "2025-05-19 14:30:40",
    "articles": [
        {
            "id": "99cc48c5571ddfd39cdd07167aa27cfb",
            "title": "Scarlett Johansson brings 50th season of ‘SNL’ to a low-key close - AP News",
            "url": "https://apnews.com/article/snl-season-50-final-episode-johansson-jost-b21ae98c1cdc429907bb988dd516221b",
            "urlToImage": "https://dims.apnews.com/dims4/default/5312106/2147483647/strip/true/crop/2512x1413+0+131/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2Fb5%2Fbcc0ad856a06ac81d4cbdb3f0eeb%2F762c75d0087b4329812ee77612bbac04",
            "source": "Associated Press",
            "summary": "Johansson is the subject of many of the Che-written jokes, so this year Jost compelled Che to bring her out and apologize for once comparing part of her body to “Costco roast beef.”\n\nThe 50th season brought much media discussion of who might run the show should 80-year-old creator Lorne Michaels ever step down. “It’s SNL’s 50th season, so I want to take a moment to say something to our boss,” Jost said. “It’s the ‘SNL’ finale, season 50 — worst one yet!” he said. let me run the show.”\n\nJost also appeared in a pre-recorded, behind-the-scenes bit where Johansson has torrid sex with Yang after she confesses to Nwodim and Gardner that she has a crush on him, and learns he has only been publicly pretending to be gay “for the clout.”\n\nJohansson has her heart broken when she learns Yang also has been hooking up with Nwodim, Gardner and guest star Emily Ratajkowski."
        },
        {
            "id": "8f9a0d1d5212bbb98fe8465d3fe53b95",
            "title": "Michael Che Apologizes to Scarlett Johansson for Infamous Roast Beef Joke: “I Was Jealous” - The Hollywood Reporter",
            "url": "http://www.hollywoodreporter.com/tv/tv-news/michael-che-scarlett-johansson-apologizes-roast-beef-joke-1236220532/",
            "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2025/05/1-2.jpg?w=1296&h=730&crop=1",
            "source": "Hollywood Reporter",
            "summary": "“And notice I said ‘human,’ because I once spent the summer on a farm.”\n\nBefore Johansson returned to host Saturday Night Live, she promised to “burn” Che “back” for the roast beef joke. “Before I tell another joke, I wanna take this opportunity to apologize to someone I hurt, Scarlett, can you come out here?” Che said at the top of the bit, with a humorous tone, which took place during yet another joke-swap with his “Weekend Update” co-host and Johansson’s husband Colin Jost. Retaliation, I’d say, should be expected.”\n\nDuring the episode, Che joked that he was also “sorry” to Jost “because I owe you everything,” another line seemingly written by his co-host."
        },
        {
            "id": "422cdfb6dc6b2bfa55caab9ba6eb676e",
            "title": "Austria’s JJ wins Eurovision 2025 with ‘Wasted Love’ - CNN",
            "url": "https://www.cnn.com/2025/05/17/entertainment/eurovision-song-contest-winner-austria-jj-latam-intl",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap25137838937604.jpg?c=16x9&q=w_800,c_fill",
            "source": "CNN",
            "summary": "The Israeli contestant Raphael — who was attending the Nova music festival when Hamas launched its cross-border attacks in October 2023 — sang to an arena where Palestinian flags were flying, following a rule change by the European Broadcasting Union (EBU). A rumored appearance by Celine Dion, who won Eurovision for Switzerland in 1988 and who, along with ABBA, is the contest’s most celebrated alumni, failed to materialize. This is the kind of music that I want to continue making.”\n\nJJ, representing Austria, performs on stage during the Grand Final of the 69th Eurovision Song Contest Opening Ceremony in Basel, Switzerland."
        },
        {
            "id": "7232b1687c5eec8bc3f57fb5b359791e",
            "title": "‘Lilo & Stitch’ First Reactions Praise Film as ‘Heartfelt’ and ‘Easily the Best Disney Live-Action Remake Yet’ - variety.com",
            "url": "https://variety.com/2025/film/news/lilo-and-stitch-first-reactions-live-action-remake-1236399452/",
            "urlToImage": "https://variety.com/wp-content/uploads/2025/05/Lilo-and-Stitch.jpg?w=1000&h=563&crop=1",
            "source": "Variety",
            "summary": "It’s also OUT OF THIS WORLD HILARIOUS and HEARTWARMING with a star-making… pic.twitter.com/zA3i722bx1 — Daniel Baptista • The Movie Podcast (@dbapz) May 18, 2025\n\n#LiloandStitch is the best Disney live-action to date. The film hits similar beats to the original, as well added something new flavors.”\n\nJournalist Laura Sirikul wrote on X, “Lilo and Stitch was heartwarming & really gave the official film more depth to Lilo & Nani. Seeing Stitch in his live-action form on the big screen brings on a huge wave of nostalgia. Very sweet.”\n\nPopular on Variety\n\nThe original “Lilo & Stitch” was released in 2002, making this the most recent animated movie that Disney has turned into live-action, and the first from the 2000s. Critic Wendy Lee Szany wrote on X, “Lilo and Stitch is the best Disney live-action to date. Read some of the first reactions below:\n\n#LiloandStitch is a cute reimagining that mostly captures the original’s spirit through a modern-day lens."
        },
        {
            "id": "e648394f28711187499698975d0eee7a",
            "title": "Kid Rock, President Trump both blast Bruce Springsteen for ‘punk move’ - MLive.com",
            "url": "https://www.mlive.com/news/2025/05/kid-rock-president-trump-both-blast-bruce-springsteen-for-punk-move.html",
            "urlToImage": "https://www.mlive.com/resizer/v2/W6TNVN5WFBFMZIVIWMVCXE6EW4.jpg?auth=6a12aa5eaac14b499db2dcebf44ade96b8e0380cc8edc52cecdadd6d33fa0a2e&width=1280&quality=90",
            "source": "mlive.com",
            "summary": "Rock added that he thinks Springsteen just wants to be in good standings in Hollywood. President Trump added: “Springsteen is ‘dumb as a rock,’ and couldn’t see what was going on, or could he (which is even worse!)? I’m proud to say that I’m more of Hollywood’s Kryptonite.”\n\nSpringsteen’s tour continues tonight in Manchester. “In my home, the America I love, the America I’ve written about that has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent, and treasonous administration,”\n\nHe went on to say: “Tonight, we ask all who believe in democracy and the best of our American spirit to rise with us, raise your voices against authoritarianism and let freedom ring.”\n\nPresident Trump also responded to Springsteen’s comments on Truth Social, writing on May 16:\n\n“I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States."
        },
        {
            "id": "42f8fd499e9800db81150033434bfda2",
            "title": "Justin and Hailey Bieber Step Out Separately Amid News of Financial Woes - TMZ",
            "url": "https://www.tmz.com/2025/05/17/justin-hailey-bieber-step-out-separately-amid-news-financial-woes/",
            "urlToImage": "https://imagez.tmz.com/image/dd/16by9/2025/05/17/dd6e3647b1f24d65a75e4703004f19db_xl.jpg",
            "source": "TMZ",
            "summary": "While Bieber didn't even throw on a hood to cover his mug, Hailey tried to keep a lower profile ... holding her phone up to obscure her features while heading for the car. The two stars were both spotted in the City of Angels Friday ... with Justin hitting up a West Hollywood café with a friend early on in the day -- looking relaxed in a red hoodie and not even hiding his face from the cameras. Justin and Hailey Bieber are each spending some time on their... don't worry, they're not breaking up -- they're just doing their own things in L.A."
        },
        {
            "id": "5d27d9bc67c6db4de5a465d22f8f9615",
            "title": "‘Fight back’: Pedro Pascal urges Cannes to resist US political pressure - Al Jazeera",
            "url": "https://www.aljazeera.com/news/2025/5/17/fight-back-pedro-pascal-urges-cannes-to-resist-trump-policies",
            "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2025/05/2025-05-17T140120Z_888123495_UP1EL5H12Y7JC_RTRMADP_3_FILMFESTIVAL-CANNES-EDDINGTON-1747511977.jpg?resize=1920%2C1440",
            "source": "Al Jazeera English",
            "summary": "And so keep telling the stories and keep expressing yourself and keep fighting to be who you are,” he said. Pascal, known for his role in dystopian video-game adaptation “The Last of Us”, added that it was “far too intimidating” for him to address a question about US President Donald Trump’s immigration policy. Advertisement\n\n“It’s very scary for an actor participating in a movie to sort of speak to issues like this,” he said."
        },
        {
            "id": "234dea9b4871ae261b3f5e0da608c14d",
            "title": "Mariska Hargitay Tears Up at Cannes Premiere of 'My Mom Jayne' - variety.com",
            "url": "https://variety.com/2025/film/markets-festivals/mariska-hargitay-cannes-premiere-my-mom-jayne-secret-biological-father-1236401882/",
            "urlToImage": "https://variety.com/wp-content/uploads/2024/05/Mariska-Hargitay.jpg?w=1000&h=563&crop=1",
            "source": "Variety",
            "summary": "As she got older, she began tLooking out at an audience that included her family, friends and producing team, an emotional Hargitay said, “It’s a very personal film, and truly a dream come true.” Hargitay was raised by Mickey Hargitay and, in the film, continues to refer to him as her “father.” Sardelli is also interviewed in the film about his love affair with Mansfield, which came when her relationship with Hargitay was having a rough patch — they would briefly get back together. Growing up, Hargitay acknowledged she had few memories of her mother and initially felt embarrassed about her sex kitten persona."
        },
        {
            "id": "fcf031281ec5061843556bfb77432f4c",
            "title": "'Die My Love' Gets 9-Minute Ovation At Cannes Premiere: Jennifer Lawrence Stars - Deadline",
            "url": "http://deadline.com/2025/05/die-my-love-cannes-ovation-jennifer-lawrence-robert-pattinson-1236402112/",
            "urlToImage": "https://deadline.com/wp-content/uploads/2024/11/Die-My-Love.jpeg?w=1024",
            "source": "Deadline",
            "summary": "RELATED: Cannes Film Festival 2025 in Photos: Richard Linklater, Zoey Deutch, Jennifer Lawrence, Robert Pattinson, ‘New Wave’ & ‘Die My Love’ Premieres\n\nWatch on Deadline\n\nRamsay directed Die My Love from her script written with Enda Walsh and Alice Burch. Producers include Justine Ciarrocchi and Lawrence on behalf of Excellent Cadaver, as well as Martin Scorsese, Andrea Calderwood, and Black Label Media’s Molly Smith, Trent Luckinbill and Thad Luckinbill. Jennifer Lawrence and co bask in 9-minutes worth of applause at ‘Die, My Love’ premiere #Cannes2025 pic.twitter.com/1FBMEa2kwG — Deadline (@DEADLINE) May 17, 2025\n\nSet in rural America, Die My Love is the portrait of a woman engulfed by love and madness."
        }
    ]
}