{
    "source": "data/news_sports_us_20250516_144453.json",
    "original_category": "sports",
    "original_country": "us",
    "timestamp": "2025-05-16 14:44:53",
    "articles": [
        {
            "id": "b77f0d7183e86c2abe980f7ba798bbb8",
            "title": "Celtics-Knicks: 5 takeaways as defending champions keep season alive - NBA",
            "url": "https://www.nba.com/news/celtics-knicks-takeaways-game-5-2025-nba-playoffs",
            "urlToImage": "https://cdn.nba.com/manage/2025/05/jaylen-brown-dribble.jpg",
            "source": "Heat.com",
            "summary": "The Celtics’ defense against the Knicks’ star is about more than just the man guarding him to start possessions, but Brown and his additional length clearly made an impact, with Brunson scoring just 22 points (7-17 FGs) after torching the Celtics for 39 in Game 4. They ran their own Spain pick-and-roll, Towns got caught in the back screen, and Kornet rolled free to the basket for a reverse alley-oop dunk …\n\nThe seven blocks stood out, but the Celtics have also been at their best offensively in this series (124.7 points scored per 100 possessions) in Kornet’s 78 minutes on the floor. It’s been one of the Celtics’ best three-game stretches of offense (129.6 points scored per 100 possessions) this season. The Knicks made one more 3-pointer than Boston over the first two games, but the Celtics have made 31 more over the last three. The first of those third-quarter blocks came at the end of a terrific defensive possession for the Celtics’ third big man. Bad shots will arise when you take that many 3-pointers, and there were certainly some bad ones as the Celtics blew 20-point leads in Games 1 and 2. After a Josh Hart 3 for the Knicks, the Celtics got the ball up the floor quickly and Al Horford got it back to a trailing White, who was already 5-for-9 from 3-point range at that point. He spun into the paint, drew two more defenders and made a terrific wraparound pass to Kornet for a layup …\n\nWhen asked what his job is with Tatum out, Brown responded, “Get it done in multiple ways … Whatever is needed, I’m excited to facilitate in whatever role.”\n\n4. “I feel like I can guard with the best of them.”\n\nOn offense, Brown had almost as many assists (12) as he had through the first four games (13). Facing elimination for the first time in two years and missing their best player, the Boston Celtics responded with a huge second half in Game 5 of the Eastern Conference semifinals, torching the New York Knicks’ defense and cruising to a 127-102 victory on Wednesday. Games 1, 4 and 5 account for three of the four times in these playoffs that a team has taken at least 58% of its shots from 3-point range. Then the Celtics were able to get out in transition, even after made buckets on the other end of the floor. The Celtics, of course, set an NBA record this season by taking 53.6% of their shots from beyond the arc. Because Brown was guarding Brunson, the Knicks guard sometimes got caught guarding Brown in transition."
        },
        {
            "id": "93757e15a02b3bd84fa513fe316eebf8",
            "title": "2025 NFL schedules by team: Full list of times, dates, TV, streaming for entire season for all 32 franchises - CBS Sports",
            "url": "https://www.cbssports.com/nfl/news/2025-nfl-schedules-by-team-full-list-of-times-dates-tv-streaming-for-entire-season-for-all-32-franchises/",
            "urlToImage": "https://sportshub.cbsistatic.com/i/r/2025/05/14/77a09d46-87d6-409c-858e-3b2e6e25e67e/thumbnail/1200x675/7b1b54ba545d856be770bc483e78e705/nfl-logos.jpg",
            "source": "CBS Sports",
            "summary": "Every single game. Well, folks, the full, 272-game NFL schedule is finally here. We know who is playing who, and when, and where, and on what TV station or streaming service."
        },
        {
            "id": "28996a30eda009b06613fd433cb9528a",
            "title": "Colts deleted their schedule-release video - NBC Sports",
            "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/colts-deleted-their-schedule-release-video",
            "urlToImage": "https://nbcsports.brightspotcdn.com/dims4/default/19f25b0/2147483647/strip/true/crop/4804x2702+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa4%2F55%2Fb173fdfd480e96133a86ff7fdbea%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F1860946315",
            "source": "NBCSports.com",
            "summary": "Their Minecraft-themed video (the Chargers opted for a Minecraft vibe, too) posted by the Colts was deleted. Make sure everyone who is in a position to give the video a thumb’s down has a chance to do so before the video goes live. The video also dubs Cardinals quarterback Kyler Murray a “chicken jockey,” and it shows Chiefs quarterback Patrick Mahomes as a frog that jumps into a boxing ring to stop a fight between Pat Mahomes Sr. and John Rocker."
        },
        {
            "id": "e08d40c3fe18871e055838173349bb60",
            "title": "Charles Barkley calls Steph Curry injury return theory 'stupid' - SFGATE",
            "url": "https://www.sfgate.com/warriors/article/barkley-calls-steph-curry-injury-theory-stupid-20328075.php",
            "urlToImage": "https://s.hdnux.com/photos/01/50/27/31/27358802/3/rawImage.jpg",
            "source": "SFGate",
            "summary": "Stephen Curry (in red) of Warriors is seen during Game 4 between Minnesota Timberwolves and Golden State Warriors at Chase Center on May 12, 2025 in San Francisco. Anadolu/Anadolu via Getty Images\r\n… [+2619 chars]"
        },
        {
            "id": "6426257c51e934e51938008e19613a24",
            "title": "3 initial observations on the Chiefs’ 2025 schedule - Arrowhead Pride",
            "url": "https://www.arrowheadpride.com/2025/5/14/24430514/chiefs-2025-nfl-schedule-initial-observations-slate",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/Ota5FbYviUNtQ6AuQguD45dRVh8=/0x275:3839x2285/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25994794/2198604486.jpg",
            "source": "Arrowhead Pride",
            "summary": "Kansas City will then appear on two of the first six Sunday Night Football telecasts on NBC — traveling to face the New York Giants in Week 3 while hosting the Detroit Lions in Week 6. The vast majority of the country will likely also see their CBS-affiliate broadcast the Chiefs hosting the Baltimore Ravens in Week 4 — outside a small sampling of markets likely getting the Las Vegas Raiders hosting the Chicago Bears. The Chiefs will also play a road game against the Jacksonville Jaguars on ESPN’s Week 5 edition of Monday Night Football. The Chiefs likely have a brutal first half of the season\n\nA caveat in assessing the schedule should be that we do not know which teams will fail to take an expected next step, which teams will rise above meager expectations, and — most importantly — which squads will be blessed with optimal health. The Chiefs will first encounter both top prospects on the road during the first five games of the season, with Carter now a Giant and Hunter a Jaguar."
        },
        {
            "id": "2af9b9245195bfe52d96231f9ad2b409",
            "title": "Lions open as favorites over Packers in Week 1 of 2025 season - Pride Of Detroit",
            "url": "https://www.prideofdetroit.com/2025/5/14/24429402/detroit-lions-favorites-season-opener-packers-week-1-gambling-odds-2025",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/sO2vR4c74BYBPxw5bZwSvdNRQnI=/0x195:5397x3021/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25994441/2183118505.jpg",
            "source": "Prideofdetroit.com",
            "summary": "While the Lions have focused their offseason on getting bigger and more athletic, the Packers spent their offseason getting a lot more athletic—investing in speedy linebackers in free agency while adding wide receivers and offensive/defensive linemen in the draft—and sacrificing bulk. This strategy should help them be more competitive throughout the season, but it’s also fair to wonder how this approach will play out against the Lions. Additionally, Isaac Tesla gives the Lions yet another dynamic offensive weapon, Ahmed Hassanein adds more juice on the edge, while Georgia’s Dan Jackson and Dominic Lovett will bolster the Lions' special teams."
        },
        {
            "id": "2235035640712faca364c37cd86beab0",
            "title": "Bears 2025 schedule release: Challenges throughout for new coach Ben Johnson - Chicago Sun-Times",
            "url": "https://chicago.suntimes.com/bears/2025/05/14/bears-nfl-schedule-release-day-thursday-tracker-caleb-williams-eagles-packers-fox-amazon",
            "urlToImage": "https://cst.brightspotcdn.com/dims4/default/3bcb50f/2147483647/strip/true/crop/5199x2968+0+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fc2%2F46%2Fe2a5ba4b46fbb6ea0980abfc688c%2Fwilliams-vikes.jpg",
            "source": "Suntimes.com",
            "summary": "Week 15: vs. Browns, Dec. 14 at noon (Fox 32)\n\nIt’s debatable whether the Browns, Saints or Giants at home will be the Bears’ easiest game. Week 12: vs. Steelers, Nov. 23 at noon (CBS 2)\n\nThe Bears will get a shot at the coach they wanted to pry away with a trade: Mike Tomlin. Week 14: at Packers, Dec. 7 at noon (Fox 32)\n\nThe Bears haven’t waited this long to face the Packers for the first time in a season since 1998, when they met in Weeks 15 and 17. Week 11: at Vikings, Nov. 16 at noon (Fox 32)\n\nThis deep into the season, it’ll be clear if the Bears are serious about making a playoff push. Week 18: vs Lions, Jan. 3 or 4 (TV TBD)\n\nThe NFL waits to set these games and wants meaningful matchups for two stand-alone spots Saturday and one Sunday."
        },
        {
            "id": "e6a985c4ae70b48183479ed626897f1f",
            "title": "Commanders scheduled for eight standalone games in 2025 - NBC Sports",
            "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/commanders-scheduled-for-eight-standalone-games-in-2025",
            "urlToImage": "https://nbcsports.brightspotcdn.com/dims4/default/1b9fed8/2147483647/strip/true/crop/6747x3795+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ffe%2F35%2Fa98b2f014c41991ee23291e4d8f1%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2195703054",
            "source": "NBCSports.com",
            "summary": "In Week 7, the Commanders will host the Cowboys for another 4:25 p.m. start on FOX. The franchise will have a pair of 1 p.m. Sunday starts for road games against the Vikings and Giants before a special standalone Saturday matchup against the Eagles in Week 16. After a Week 12 bye, the Commanders will face the Broncos on Sunday Night Football for another primetime matchup."
        },
        {
            "id": "793686eebe4594a128b4e277ef93456d",
            "title": "Chargers Roast Steelers In Schedule Release Video - Steelers Depot",
            "url": "https://steelersdepot.com/2025/05/chargers-roast-steelers-in-schedule-release-video/",
            "urlToImage": "https://steelersdepot.com/wp-content/uploads/2025/05/ChargersVid3-1.jpg",
            "source": "Steelers Depot",
            "summary": "The Chargers have certainly gone after players and teams harder than the Steelers in the past and overall, Pittsburgh got off fairly easy. Compare that to Pittsburgh’s direction, a “Catching Bigfoot” theme that didn’t reveal the schedule until the very end. Still, as far as the NFL goes, it’s as biting critiques as you’ll see from team-to-team."
        },
        {
            "id": "725738c2249264d0d478d4929fa0463d",
            "title": "Breaking down the Raiders' 2025 schedule game by game - Las Vegas Raiders",
            "url": "https://www.raiders.com/news/raiders-2025-schedule-release-game-by-game-breakdown-afc-west-nfc-east-afc-south",
            "urlToImage": "https://static.clubs.nfl.com/image/upload/t_editorial_landscape_12_desktop/raiders/qkd8cfaqqr0hgywgdfhi",
            "source": "Raiders.com",
            "summary": "Content too short to summarize"
        }
    ]
}