{
    "source": "data/news_health_us_20250519_143054.json",
    "original_category": "health",
    "original_country": "us",
    "timestamp": "2025-05-19 14:30:54",
    "articles": [
        {
            "id": "f41c1359c9b714e36bbb0676dfbb3dd3",
            "title": "U. researchers unveil AI-powered tool for disease prediction with 'unprecedented accuracy' - KSL.com",
            "url": "https://www.ksl.com/article/51314532/u-researchers-unveil-ai-powered-tool-for-disease-prediction-with-unprecedented-accuracy",
            "urlToImage": "https://img.ksl.com/slc/3085/308581/30858186.jpeg?filter=kslv2/responsive_story_lg",
            "source": "KSL.com",
            "summary": "The technology offers several key advantages:\n\nEnhanced understanding of disease progression: RiskPath can map how different risk factors change in importance over time, revealing critical windows for intervention. \"And what those do is help clinicians, and maybe one day patients, be able to understand their risk for a chronic or progressive disease better and earlier,\" she said. \"By identifying high-risk individuals before symptoms appear or early in the disease course and pinpointing which risk factors matter most at different life stages, we can develop more targeted and effective preventive strategies. \"The ultimate aim of RiskPath and tools like RiskPath is to help people build better risk stratification tools and decision support tools. De Lacy and the rest of the research team validated RiskPath across three major long-term patient cohorts involving thousands of participants to successfully predict eight different conditions, including depression, anxiety, ADHD, hypertension and metabolic syndrome. Practical risk visualization: The system provides intuitive visualizations showing which time periods in a person's life contribute most to disease risk, helping researchers identify optimal times for preventive interventions."
        },
        {
            "id": "daa2207b6daea7cf40bce65cf832075c",
            "title": "This commonly prescribed drug can increase the risk of Alzheimer’s by 46% - Times of India",
            "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/this-commonly-prescribed-drug-can-increase-the-risk-of-alzheimers-by-46/articleshow/121237625.cms",
            "urlToImage": "https://static.toiimg.com/thumb/msid-121237625,width-1070,height-580,imgsize-53936,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "source": "The Times of India",
            "summary": "\"This study found that there was nearly a 50% increased risk of dementia among patients aged 55 and over who had used strong anticholinergic medication daily for three years or more,\" Professor Tom Dening, Head of the Centre for Dementia at the University, and a member of the research team said. The study, which analyzed 21 studies and included a meta-analysis of six, looked at the impact of anticholinergic drugs taken for at least three months.These medications block acetylcholine, a neurotransmitter that is critical for memory and cognitive function. How does the prescription drug increase the risk of Alzheimer’s\n\nStudy Biotech & Health Tech Abroad: Top Courses at Harvard, Stanford\n\nAn estimated 57 million people were living with dementia globally in 2021, with Alzheimer’s disease accounting for 60–70% of all cases."
        },
        {
            "id": "0d52258b61dac072fc9f7882af6a0d9b",
            "title": "Glymphatic dysfunction linked to cognitive performance deficits in adults with ADHD, study finds - PsyPost",
            "url": "https://www.psypost.org/glymphatic-dysfunction-linked-to-cognitive-performance-deficits-in-adults-with-adhd-study-finds/",
            "urlToImage": "https://www.psypost.org/wp-content/uploads/2025/05/brain-7.jpg",
            "source": "PsyPost",
            "summary": "While this study is one of the first to examine glymphatic function in adult ADHD, it has several limitations. Despite these limitations, the study adds an important piece to the puzzle of ADHD. Because the data are cross-sectional, the researchers cannot determine whether glymphatic dysfunction causes cognitive problems or results from them. These neurotransmitters are already known to play a role in attention, motivation, and reward processing—all areas often affected in ADHD. The researchers used advanced neuroimaging techniques to assess three indicators of glymphatic function: the volume of the choroid plexus (a part of the brain that produces cerebrospinal fluid), a measure known as the ALPS index (which reflects how well fluid moves along blood vessels in the brain), and the strength of the connection between brain activity and cerebrospinal fluid flow (called gBOLD-CSF coupling). Likewise, there were no significant differences between the ADHD and control groups in terms of gBOLD-CSF coupling, which reflects functional synchronization between brain activity and fluid flow. To do this, the team analyzed brain imaging and cognitive data from 41 adults diagnosed with ADHD and compared them to 108 healthy adults. The findings suggest that disruptions in the brain’s waste clearance system could help explain some of the persistent memory and attention problems seen in adults with the condition. However, little is known about its role in ADHD, especially in adults."
        },
        {
            "id": "eb626199a648052c2d8615af657d75c1",
            "title": "High-quality carbs in midlife linked to healthier aging - Earth.com",
            "url": "https://www.earth.com/news/high-quality-carbs-in-midlife-linked-to-healthier-aging/",
            "urlToImage": "https://cff2.earth.com/uploads/2025/05/17100920/High-quality-carbs-in-midlife-linked-to-healthier-aging.jpg",
            "source": "Earth.com",
            "summary": "Eating more high-quality carbs and fiber in midlife made a noticeable difference. The study suggests that what women eat in their 40s and 50s can impact their health decades later. Whole grains, fruits, vegetables, and legumes gave women a better shot at aging well. “Studies are starting to find an association between food choices in midlife and quality of life in later years. For the women in this study, eating well decades earlier paid off in a big way. They’re linked to lower risks of chronic diseases, sharper minds, and better physical health in old age. Women who upped their intake of high-quality carbs by 10% had a 31% better chance of aging well. It connected their midlife eating habits to their health in their 70s and 80s. But it’s not just about eating fewer carbs. High-quality carbs and dietary fiber aren’t just good for digestion. But once the researchers factored in fiber intake, that connection weakened. The more we can understand about healthy aging, the more science can help people live healthier for longer,” Korat said. Aging doesn’t have to mean decline, and it doesn’t have to mean slowing down. What this means for women\n\nAging well isn’t just about avoiding illness. Women who did had 8% to 16% better odds of aging well."
        },
        {
            "id": "fbec136d17a34e1a026be2a495ba3117",
            "title": "Who needs more exercise: Women or men? - Live Science",
            "url": "https://www.livescience.com/health/exercise/who-needs-more-exercise-women-or-men",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/v26dFsZW3qgAadxYDAqyEN.jpg",
            "source": "Live Science",
            "summary": "\"I am hopeful that this pioneering research will motivate women who are not currently engaged in regular physical activity to understand that they are in a position to gain tremendous benefit for each increment of regular exercise they are able to invest in their longer-term health,\" Dr. Christine Albert , chair of the Department of Cardiology in the Smidt Heart Institute who was not involved in the study, said in the statement. Compared with inactive individuals, women who performed aerobic physical activity had a 36% lower cardiovascular mortality risk, while for active men, this risk reduction was about 14%. \"What surprised us the most was the fact that women who do muscle strengthening had a reduction in their cardiovascular mortality by 30%,\" Gulati told NPR . On average, the women who strength-trained at least twice a week had a 19% lower mortality risk than women who trained less often or not at all. Women also gained these survival benefits much more quickly than men did, the study found. In men, the highest reduction in death risk was seen at about 300 minutes of moderate-to-vigorous physical activity (MVPA) per week. In addition, the study didn't account for potentially unassessed health issues in some participants, or changes in people's exercise trends over time. But scientists have discovered that that reduction in risk may differ between the sexes, with some people reaping greater benefits in less workout time."
        },
        {
            "id": "40ac16ec215302b8b10ead757ed92264",
            "title": "Bat tests positive for rabies at Great Plains Zoo - KELOLAND.com",
            "url": "https://www.keloland.com/news/local-news/bat-tests-positive-for-rabies-at-great-plains-zoo/",
            "urlToImage": "https://www.keloland.com/wp-content/uploads/sites/103/2024/12/BatGettyImages-1214600684-e1733238123934.jpg?w=1280",
            "source": "KELOLAND.com",
            "summary": "In a press release, the South Dakota Department of Health reported that one bat on the zoo’s campus tested… [+1254 chars] (KELO) – A bat at the Great Plains Zoo (GPZ) tested positive for rabies. SIOUX FALLS, S.D."
        },
        {
            "id": "97a7b7d6d25bc1627579cd0f900289f3",
            "title": "Inflammation Tied to Motivation Loss in Schizophrenia - Neuroscience News",
            "url": "https://neurosciencenews.com/inflammation-motivation-schizophrenia-28959/",
            "urlToImage": "https://neurosciencenews.com/files/2025/05/inflammation-motivation-schizophrenia-neuroscience.jpg",
            "source": "Neurosciencenews.com",
            "summary": "Neuropsychopharmacology\n\nAbstract\n\nInflammation is associated with avolition and reduced resting state functional connectivity in corticostriatal reward circuitry in patients with schizophrenia\n\nLow-grade inflammation has been associated with negative symptoms in patients with schizophrenia. Effects of inflammation on motivational deficits in patients with depression are associated with disruptions in corticostriatal reward circuitry involving the inferior ventral striatum (iVS) and ventromedial prefrontal cortex (vmPFC). For example, previous studies of medications targeting inflammation in patients with schizophrenia have largely failed by not identifying which patients would benefit from these approaches. Published in Neuropsychopharmacology, the official publication of the American College of Neuropsychopharmacology, the study found that higher levels of C-reactive protein — a blood biomarker of inflammation produced by the liver — were associated with reduced activity in brain circuits tied to reward and motivation. Negative symptoms and high sensitivity C-reactive protein (hsCRP) were obtained in 57 individuals with schizophrenia. The work helped lay the foundation for a current experimental-medicine trial at Emory testing the anti-inflammatory drug infliximab, commonly used to treat rheumatoid arthritis and inflammatory bowel disease, in patients with schizophrenia who have high inflammation and motivational deficits. About this inflammation and schizophrenia research news\n\nAuthor: Jennifer Johnson McEwen\n\nSource: Emory University\n\nContact: Jennifer Johnson McEwen – Emory University\n\nImage: The image is credited to Neuroscience News\n\nOriginal Research: Closed access."
        },
        {
            "id": "fb7d6af8f95105ab753363389afa9442",
            "title": "Your Brain Loves Deep Breathing, Science Explains Why - Neuroscience News",
            "url": "https://neurosciencenews.com/breathwork-calm-neuroscience-28958/",
            "urlToImage": "https://neurosciencenews.com/files/2025/05/deep-beating-calmness-neurosicnce.jpg",
            "source": "Neurosciencenews.com",
            "summary": "But basic, slow breathing is all that’s needed for most people to experience the stress-reducing benefits of breathwork. Breathwork activates calming signals across brain circuits. “Maybe not everyone, but a lot of people will find that to be beneficial, and to me, that’s amazing.”\n\nAbout this breathwork and neuroscience research news\n\nAuthor: Will Houston\n\nSource: UCLA\n\nContact: Will Houston – UCLA\n\nImage: The image is credited to Neuroscience News People new to breathwork should start with something less intense, Dr. Feldman suggested: “Don’t go out and run a marathon when you’ve been sitting on the couch.”\n\nThe Wim Hof Method and a similar technique, Holotropic Breathwork, can lead to altered states of consciousness, which both Lindqvist and Dr. Feldman described as “psychedelic.”\n\nThis – and the tingling physical sensations – likely results from changes in carbon dioxide levels caused by hyperventilation, Dr. Feldman explained. Source: UCLA\n\nBreathwork – intentionally changing breathing patterns to improve physical, mental or emotional well-being – may seem woo-woo, but the science behind the practice is sound, says Jack Feldman, PhD, a professor of neurobiology at the David Geffen School of Medicine at UCLA. But one doesn’t need to understand how breath affects the brain to benefit from breathwork, Dr. Feldman said, “much like you can drive a car without understanding how an engine works.”\n\nPracticing common breathing techniques, such as box breathing or 4-7-8 breathing, for a few minutes a day is a great way to start, he said. Some of Dr. Feldman’s recent work has investigated whether the placebo effect contributes to the efficacy of breathwork. … It’s something we think that evolved early that we ultimately hijacked in terms of breathwork.”\n\nWhat makes breathwork work? In other words, do deep breaths calm us down because we expect them to?"
        },
        {
            "id": "972e6acac7fe1c2770d27f3e0d9b432a",
            "title": "Midlife Cortisol Levels Linked to Alzheimer’s Risk - Neuroscience News",
            "url": "https://neurosciencenews.com/cortisol-aging-alzheimers-28957/",
            "urlToImage": "https://neurosciencenews.com/files/2025/05/cortisol-Alzheimers-aging-neuroscience.jpg",
            "source": "Neurosciencenews.com",
            "summary": "Alzheimer’s & Dementia\n\nAbstract\n\nElevated serum cortisol associated with early-detected increase of brain amyloid deposition in Alzheimer’s disease imaging biomarkers among menopausal women: The Framingham Heart Study\n\nINTRODUCTION\n\nThis study investigates whether midlife cortisol levels predict Alzheimer’s disease (AD) biomarker burden 15 years later, with particular attention to sex differences and menopausal status. All this allowed them to investigate cortisol’s impact at an earlier stage of Alzheimer’s disease pathogenesis, where interventions might be most effective. “Our work shows that considering sex and hormonal status in understanding Alzheimer’s disease pathogenesis is important, and suggests that stress reduction and hormonal interventions may hold promise for Alzheimer’s prevention, especially in at-risk women,” said Sudha Seshadri, founding director of the Biggs Institute and senior author of the study. Cortisol levels were associated with increased amyloid buildup, not tau. “The results highlight the importance of identifying early risk factors when biomarkers are detectable but cognitive impairment is absent,” said Arash Salardini, MD, associate professor of cognitive and behavioral neurology with the Glenn Biggs Institute for Alzheimer’s and Neurodegenerative Diseases at UT Health San Antonio. Source: UT San Antonio\n\nCan stress lead to Alzheimer’s disease? Given the neuroprotective effects of estrogen and testosterone, which mitigate cortisol’s deleterious impact on neural tissues, they also explored sex-specific differences, focusing particularly on post-menopausal risk. Also, several cross-sectional and longitudinal studies had reported that higher blood cortisol levels are linked to an increased likelihood of developing the disease. Genetic studies had identified mutations in glucocorticoid, or steroid hormones that have anti-inflammatory and immunosuppressive effects, signaling pathways that increase susceptibility to Alzheimer’s disease."
        }
    ]
}