{
    "source": "data/news_sports_us_20250516_143244.json",
    "original_category": "sports",
    "original_country": "us",
    "timestamp": "2025-05-16 14:32:44",
    "articles": [
        {
            "id": "7c6584c92625e263204db5649754b590",
            "title": "Jaylen Brown, Celtics show championship grit in Game 5 win over Knicks: Takeaways - Boston.com",
            "url": "https://www.boston.com/sports/boston-celtics/2025/05/14/jaylen-brown-celtics-show-championship-grit-in-game-5-win-over-knicks-takeaways/",
            "urlToImage": "https://bdc2020.o0bc.com/wp-content/uploads/2025/05/EC4UFM3SDTOPANXEFGYPFCDTQY-6825521571695-768x432.jpg",
            "source": "Boston.com",
            "summary": "“So whatever is needed on me, I’m excited to be able to facilitate in whatever role, so it could change each game, each night, defensively, offensively, but the goal is to just lead, just be myself.”\n\nJalen Brunson committed five fouls in the third quarter (and one in the fourth)\n\nThe Celtics kept building massive leads against the Knicks early in the series only to see them leak away like water cupped between two hands. Advertisement:\n\nOffensively, Kornet got plenty of help from Brown, Derrick White and Jrue Holiday, but the Celtics held the Knicks to 17 points in the quarter in large part because they could not get anything going near the rim. “I unfortunately was a little tired and didn’t have my usual wit and charm.”\n\nKristaps Porzingis was the exact opposite\n\nGoing forward, the Celtics will also need to consider to what extent Porzingis can be part of the rotation – in stark contrast to Kornet, Porzingis played 12 minutes and was -12 in a game the Celtics won by 25 points. The Celtics are a championship-caliber team oozing with playoff experience and championship-quality mental strength, which is what made it so stunning that they went down 2-0 at home against the Knicks in the first place. We did that tonight, and we’ve got to try to find a way to win Game 6.”\n\nAdvertisement:\n\nThe Celtics showed their mettle. That strategy has now worked against both Brunson and Towns at various times in the series, and as the Celtics look ahead to a Game 6 that few thought they would see, they will need to consider how they can make both players work as much as possible on the defensive end. In two of those games, the Celtics shot their worst games all year, and on Wednesday, they built a 20-plus point lead without Tatum. “So we kind of have to play a little differently and just find ways to create offense, to rebound, just everything he does on the court. He wasn’t always rewarded with an assist – one of the Celtics’ best plays of the game started when Brown collapsed the defense and ended with Kornet sliding to the rim for an open pick-and-roll dunk several passes later. Wednesday’s game wasn’t just a team fighting for pride after its star went down – the Celtics were the better, more fundamental team. The rest of Brown’s game is what propelled the Celtics forward and kept their season alive. We haven’t won anything yet, just gotta find a way to go to New York and win a game.”\n\nWhite’s 3-point shooting was excellent, but he also went to the free-throw line 11 times. Advertisement:\n\nBut Brown’s biggest contributions may have come on the defensive end, where he took on the task of guarding Jalen Brunson and hounded the Knicks’ guard into a very tough game. However, Tatum’s injury ensured that the Celtics won’t be fully healthy for the foreseeable future."
        },
        {
            "id": "3f4c123113a84021347c5d1b5520b086",
            "title": "Timberwolves heading back to Western Conference finals after 121-110 Game 5 win over Golden State - Star Tribune",
            "url": "https://www.startribune.com/timberwolves-warriors-game-5-nba-playoffs-live-updates/601350695",
            "urlToImage": "https://arc.stimg.co/startribunemedia/VKYYIB3PBBAGHEB43SXAMPN62M.jpg?&w=1200&ar=1.91:1&fit=crop",
            "source": "Minneapolis Star Tribune",
            "summary": "The Wolves picked the perfect moment to have one of their best shooting nights of the season. The Wolves shot 63%; they were at 66% through three quarters. Their hot shooting offset their high number of turnovers (21)."
        },
        {
            "id": "7ff21d704d834e90cad80861837344f9",
            "title": "2025 NFL schedule release live updates: Thanksgiving, Christmas, international games and more as full schedule is announced - Yahoo Sports",
            "url": "https://sports.yahoo.com/nfl/live/2025-nfl-schedule-release-live-updates-thanksgiving-christmas-international-games-and-more-as-full-schedule-is-announced-120139408.html",
            "urlToImage": "https://s.yimg.com/ny/api/res/1.2/EjvlE318ho0i__Pdj.OA1w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-02/36dd9710-f508-11ef-bf7e-3dcff80cb5a2",
            "source": "Yahoo Entertainment",
            "summary": "ET\n\nTV channel: NFL Network | ESPN\n\nFollow along with the latest NFL schedule rumors, leaks and announcements below. Earlier this week, the NFL and its broadcast partners announced several different primetime and holiday games. Home and away opponents have been set for the 2025-26 NFL season since the conclusion of last season, but the timing of each of those matchups (as well as bye weeks) was revealed in full on Wednesday."
        },
        {
            "id": "e08d40c3fe18871e055838173349bb60",
            "title": "Charles Barkley calls Steph Curry injury return theory 'stupid' - SFGATE",
            "url": "https://www.sfgate.com/warriors/article/barkley-calls-steph-curry-injury-theory-stupid-20328075.php",
            "urlToImage": "https://s.hdnux.com/photos/01/50/27/31/27358802/3/rawImage.jpg",
            "source": "SFGate",
            "summary": "Stephen Curry (in red) of Warriors is seen during Game 4 between Minnesota Timberwolves and Golden State Warriors at Chase Center on May 12, 2025 in San Francisco. Anadolu/Anadolu via Getty Images\r\n… [+2619 chars]"
        },
        {
            "id": "6426257c51e934e51938008e19613a24",
            "title": "3 initial observations on the Chiefs’ 2025 schedule - Arrowhead Pride",
            "url": "https://www.arrowheadpride.com/2025/5/14/24430514/chiefs-2025-nfl-schedule-initial-observations-slate",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/Ota5FbYviUNtQ6AuQguD45dRVh8=/0x275:3839x2285/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25994794/2198604486.jpg",
            "source": "Arrowhead Pride",
            "summary": "Kansas City will then appear on two of the first six Sunday Night Football telecasts on NBC — traveling to face the New York Giants in Week 3 while hosting the Detroit Lions in Week 6. The vast majority of the country will likely also see their CBS-affiliate broadcast the Chiefs hosting the Baltimore Ravens in Week 4 — outside a small sampling of markets likely getting the Las Vegas Raiders hosting the Chicago Bears. The Chiefs will also play a road game against the Jacksonville Jaguars on ESPN’s Week 5 edition of Monday Night Football. The Chiefs likely have a brutal first half of the season\n\nA caveat in assessing the schedule should be that we do not know which teams will fail to take an expected next step, which teams will rise above meager expectations, and — most importantly — which squads will be blessed with optimal health. The Chiefs will first encounter both top prospects on the road during the first five games of the season, with Carter now a Giant and Hunter a Jaguar."
        },
        {
            "id": "74beb98922ddb109f8aaaddb931cc239",
            "title": "Pope meets Sinner: No. 1 player gives tennis fan Pope Leo XIV racket on Italian Open off day - AP News",
            "url": "https://apnews.com/article/pope-leo-jannik-sinner-tennis-italian-open-9305b5f2957ac15c7a405f836371ec1e",
            "urlToImage": "https://dims.apnews.com/dims4/default/28afbf2/2147483647/strip/true/crop/7087x3986+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fcd%2F91ca9b470d0d96410862c4a20b47%2Fd9ab5416b746418a9f27f98940780067",
            "source": "Associated Press",
            "summary": "Earlier in the week, after Leo’s first quip about not wanting to invite him, Sinner said it was “a good thing for us tennis players” that the new pope likes to play the sport. “We hope to embrace the Holy Father again soon, maybe on a tennis court.”\n\nThe pope and Sinner posed for photos in front of the Davis Cup trophy that Sinner helped Italy win for the second consecutive time last year. Leo, the first American pope, is an avid tennis player and fan and had said earlier this week that he would be up for a charity match when it was suggested by a journalist. “It’s an honor,” Sinner said in Italian as he and his parents arrived in a reception room of the Vatican’s auditorium. But the pope looked around at the antiques and said, “Better not.”\n\nLeo, a 69-year-old from Chicago, then appeared to joke about his white cassock and its appropriateness for Wimbledon, perhaps a reference to the All England Club’s all-white clothing rule."
        },
        {
            "id": "2af9b9245195bfe52d96231f9ad2b409",
            "title": "Lions open as favorites over Packers in Week 1 of 2025 season - Pride Of Detroit",
            "url": "https://www.prideofdetroit.com/2025/5/14/24429402/detroit-lions-favorites-season-opener-packers-week-1-gambling-odds-2025",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/sO2vR4c74BYBPxw5bZwSvdNRQnI=/0x195:5397x3021/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25994441/2183118505.jpg",
            "source": "Prideofdetroit.com",
            "summary": "While the Lions have focused their offseason on getting bigger and more athletic, the Packers spent their offseason getting a lot more athletic—investing in speedy linebackers in free agency while adding wide receivers and offensive/defensive linemen in the draft—and sacrificing bulk. This strategy should help them be more competitive throughout the season, but it’s also fair to wonder how this approach will play out against the Lions. Additionally, Isaac Tesla gives the Lions yet another dynamic offensive weapon, Ahmed Hassanein adds more juice on the edge, while Georgia’s Dan Jackson and Dominic Lovett will bolster the Lions' special teams."
        },
        {
            "id": "e6a985c4ae70b48183479ed626897f1f",
            "title": "Commanders scheduled for eight standalone games in 2025 - NBC Sports",
            "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/commanders-scheduled-for-eight-standalone-games-in-2025",
            "urlToImage": "https://nbcsports.brightspotcdn.com/dims4/default/1b9fed8/2147483647/strip/true/crop/6747x3795+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ffe%2F35%2Fa98b2f014c41991ee23291e4d8f1%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2195703054",
            "source": "NBCSports.com",
            "summary": "In Week 7, the Commanders will host the Cowboys for another 4:25 p.m. start on FOX. The franchise will have a pair of 1 p.m. Sunday starts for road games against the Vikings and Giants before a special standalone Saturday matchup against the Eagles in Week 16. After a Week 12 bye, the Commanders will face the Broncos on Sunday Night Football for another primetime matchup."
        },
        {
            "id": "793686eebe4594a128b4e277ef93456d",
            "title": "Chargers Roast Steelers In Schedule Release Video - Steelers Depot",
            "url": "https://steelersdepot.com/2025/05/chargers-roast-steelers-in-schedule-release-video/",
            "urlToImage": "https://steelersdepot.com/wp-content/uploads/2025/05/ChargersVid3-1.jpg",
            "source": "Steelers Depot",
            "summary": "The Chargers have certainly gone after players and teams harder than the Steelers in the past and overall, Pittsburgh got off fairly easy. Compare that to Pittsburgh’s direction, a “Catching Bigfoot” theme that didn’t reveal the schedule until the very end. Still, as far as the NFL goes, it’s as biting critiques as you’ll see from team-to-team."
        },
        {
            "id": "725738c2249264d0d478d4929fa0463d",
            "title": "Breaking down the Raiders' 2025 schedule game by game - Las Vegas Raiders",
            "url": "https://www.raiders.com/news/raiders-2025-schedule-release-game-by-game-breakdown-afc-west-nfc-east-afc-south",
            "urlToImage": "https://static.clubs.nfl.com/image/upload/t_editorial_landscape_12_desktop/raiders/qkd8cfaqqr0hgywgdfhi",
            "source": "Raiders.com",
            "summary": "Content too short to summarize"
        }
    ]
}